{
    "count": 151,
    "jokes": [
        {
            "joke": "Skateboarding class... At this school there is AP Skateboarding fundamentals, and for the final they have to record a montage. The students stand outside eager to start the final but a student has a question, \"What's a kickflip?\" The teacher gives a dirty look, \"Wanna know what a kickflip is?\" He pulls out a bowling ball, \"Put your board flat on the ground.\" He drops the bowling ball on the board cracking the board in half. The kid looks devestated. The teacher says, \"Now get out of here before I put my foot yo ass boi.\"",
            "fix": "devestated",
            "length": 534,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If someone does t want to eat a human... Doesn't that make them a cantibal?",
            "fix": "cantibal",
            "length": 75,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is pink and fluffy? Pink fluf.",
            "fix": "fluf",
            "length": 35,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A mother-in-law doesn't trust her sons-in-law... So she decides to test them. First, she goes to the oldest's house. She jumps into a well, but her son-in-law rescues her promptly. The next morning, the oldest son-in-law finds a brand new Suzuki in front of his house with a little note: \"Lots of love, your mother-in-law.\" The next day, she goes to her second son-in-law's house. She jumps into a well once again. Her son-in-law rescues her, but only after pondering about the decision for a while. The next morning, the second son-in-law finds a second-hand Trabant in front of his house with a little note: \"Love, your mother-in-law.\" Finally, the next day she goes to see her third son-in-law. She jumps into a well, but the youngest son-in-law doesn't rescue her, so she drowns and dies. The next morning, the youngest son-in-law finds a plendid new Porsche in front of his house with a little note: \"Thank you. Your loving father-in-law.\"",
            "fix": "plendid",
            "length": 950,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A robber was about to raid a bank, but realizes he didn't put on his mask. So he asks everyone in the building if they saw his face. First he approaches a young man. With a desparate tone the robber hysterically asks if the man saw his face. Out of fear the young man immediately says yes without thinking and of course got shot afterwards. After that he goes around and asks anyone else, but no one else seemed to saw his face. Only after he comes along a married couple. He asks the man, \"Did you saw my face? I dare you!\" With a little smile one the face the man says: \"No, I didn't see anything, I was busy with my phone ate the time, but dude, I am 100% sure my wife saw your face!\"",
            "fix": "desparate",
            "length": 691,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Entering Area 51: US soldier: - Sir, this is secret territoy and you don't have permission to... - Me - Where the fuck are you running, Pikachu?!",
            "fix": "territoy",
            "length": 145,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A bear walks into a bar: The bartender says, what can I get you? The bear says, \"let me get uhh... BeerThe bartender says sure, but why the long pause? The bear holds up his arms and says,\" because I'm a fucking bear.. \"",
            "fix": "BeerThe",
            "length": 223,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So I was in the market to buy a boat and I went to my local boat emporium and asked the man, \"Do you have any sales on boats?\" \"Well you're in luck,\" says the salesman, \"because for today only if you purchase one yacht from us, you will get a second one for free!\" \"Wow!\" I said, \"So let me get this straight, if we do this deal, I'm getting a yatch more than I paid for?\"",
            "fix": "yatch",
            "length": 382,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Oh deer. What do you call a deer with no eyes? No Eye-deer. What do you call a deer with no eyes and no legs? Still no Eye-deer. What do you call a deer with no eyes, no legs and on a barbicue? Still no flaming eye-deer!",
            "fix": "barbicue",
            "length": 220,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A roman centurion walks into a bar and orders a martinus. The barkeeper looks at him and says, \"mate, don't you mean a martini?\" The centurio answers, \"if I wanted a double I would've ordered it!\"",
            "fix": "centurio",
            "length": 200,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Does your dick touch your asshole: A little boy was sitting on his grandpa's lap while his grandpa was smoking a cigar. The boy asks his grandpa, \"could I have a drag your cigar?\" The Grandpa says to the little boy, \"well can your dick touch your asshole?\" The Little boy says, \"no,\" so grandpa tells him he can't have a drag. The Next day grandpa is sitting on the front porch drinking a beer, the little boy walks up and asks grandpa, \"can I have a sip of your beer?\" The Grandpa asks, \"well can you dick touch your asshole?\" The little boys says, \"no,\" so grandpa tells him he can't have any beer. Two days after that, the little boy is sitting on the deck eating a plate of cookies when Grandpa walks out. Grandpa asks the little boy, \"could I have one year cookies?\" The Little boy asks his grandpa, \"well can your dick touch your asshole?\" The grandpa says, \"yes it can!\" The little boy says to grandp, \"good then you can go fuck yourself!\"",
            "fix": "grandp",
            "length": 966,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between feminism and meninism? One is a group of people that blatantly condone inequality, while the other is a bunch of guys mocking them.",
            "fix": "meninism",
            "length": 161,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you know when you are going to drown in milk? When its past your eyes! Heres anothjer one: Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads, \"Small medium at large.\"",
            "fix": "anothjer",
            "length": 222,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Death or Ugabuga? Two men are washed away on an island after their plane has crashed. After a few days of surviving on this island, they encounter a native tribe. The island is the home of this tribe, and they do not like trespassers or intruders so they take the two men back to see the chief. The two men are brought to the leader and in front of the antire tribe the leaders states, \"you have only two options to get off of this island, you can choose death, or your can choose Ugabuga.\" So the chief turns to the first man and asks him which one would he like. The first man says, \"well fuck, I don't want to die, I want to see my family and kids again, so I choose Ugabuga.\" The leader proceeds to take off the mans pants, bend him over, spread his cheeks and each tribe member takes their turn fucking him in the ass. This leaves the man almost dead and barely alive. He can barely talk, move, or keep his eyes open. The leader then turns to the second man and he asks him, \"Death or Ugabuga?\" The second man states, \"fuck that, I would rather die then get fucked in the ass by 30 guys, I'll choose death!\" The leader then says, \"Okay the decision has been made, it will be death for the second man, death... Death by Ugabuga!\"",
            "fix": "antire",
            "length": 1243,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do yo call a Mexican Titanic? Sink-o De Mayo haah.",
            "fix": "haah",
            "length": 55,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What Color Is It? In case you hadn't noticed, the color of the wind is 'blew.' Water always looks 'wet' to me. Dirt is oviously 'dirty.' Soup seems 'soupy.' If you can't find those Crayons in your box, contact CRAYOLA.",
            "fix": "oviously",
            "length": 218,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Do you know the difference bewtween a chair and a dick? If no: Be careful where you sit.",
            "fix": "bewtween",
            "length": 88,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the most influental animal rights philosopher? Karl Barx.",
            "fix": "influental",
            "length": 64,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a magic owel? Hoo-Dini!",
            "fix": "owel",
            "length": 40,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Voodoo Dick: This newlywed guy is going away on a business trip for 3 weeks, and he doesn't want his brand new bride to get lonely and mess around while he's gone, so he stops by the sex toy shop in town. He looks around and sees lots of dildos, sex dolls, vibrators and etc, but nothing that would keep his wife occupied for 3 weeks. So he asks the clerk, who happens to be the store owner, and though at first the clerk says there is nothing there that would keep a person satisfied for that long, after some badgering, he finally pulls a black ebony box with a gold clasp from underneath the counter -- all the while assuring the newlywed that it's not for sale, being a family heirloom and of priceless sentimental value. He opens the box, and inside is an apparently normal dildo. The newlywed guy is unimpressed, but the clerk interrupts. \"Let me demonstrate,\" he says. He looks at the box and says, \"Voodoo Dick -- The Door!\" And the voodoo dick jumps into the air, floats over to the door, and starts going at the keyhole like crazy, pounding away until the door begins to crack down the center. Finally, the clerk says, \"Voodoo Dick -- The Box!\" And the voodoo dick flies back into the box. With some difficulty, the guy convinces the clerk to sell it to him. When he arrives home, he gives his wife the box and says, \"Just open it and say, 'voodoo dick, my pussy' if you ever get horny, all right?\" So he leaves on his business trip, and by the third day, the wife is getting pretty horny. So she opens the box and says, \"Voodoo dick, my pussy,\" thinking the whole thing rather rdiculous. After about 15 minutes, she has had several orgasms and is starting to get tired, so she tries to pull the voodoo dick out. Apparently, her husband had forgotten to tell her how to turn it off. So she puts on a dress and starts driving to the hospital. About half way there, the voodoo dick is pumping away at her, and she starts multiple orgasming, and so she swerves a bit over the yellow line. A police officer happens to be behind her, and pulls her over. As the cop stands at the window, she is sweating and her face is blushed, and she's squirming all over as the voodoo dick goes at her. The cop looks at her for a second and says, \"Lady, how many drinks have you had tonight?\" She says quickly, \"Officer, I swear I haven't had anything to drink! There's this voodoo dick going at my pussy and I can't make it stop! I'm on the way to the hospital to have it removed!\" The officer thinks about it for a second, gives her a smirk and says, \"Voodoo Dick my ass, lady.\"",
            "fix": "rdiculous",
            "length": 2587,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "All the mathematical functions went to a party... There they saw the exponential function sitting by himself They poked him, \"c'mon man, join the party.\" To which he replied, \"it's not my fault, everytime I try to integrate, I just end up with myself.\"",
            "fix": "everytime",
            "length": 256,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Knock knock, who's there? \"Star wars episode IV a new.\" \"Star wars episode IV a new who?\" \"Star wars episode IV a new whope.\" So bad that it's good?",
            "fix": "whope",
            "length": 154,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is worse to injest than E Coli? Broc Coli.",
            "fix": "injest",
            "length": 47,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "British toilet humour. \"Go and have a look at the size of the shit I've just done in the bathroom!\" I said to my wife. \"No thanks,\" she replied. \"Please, just one quick look,\" I said, \"You won't believe it, it's a good two pounder.\" Shaking her head in disbelief, she pinched her nose, ran in, looked down the toilet, then ranout and said, \"There's nothing down there, you must've flushed it.\" I said, \"It's on the scales!\"",
            "fix": "ranout",
            "length": 435,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Funny shairy: JUDGE: \"Order! Order!\" Pathan: \"1 Pizza, 2 Roll, 3 Burger and 1 Cold-drink!\" JUDGE: \"Shut Up!\" Pathan: \"No, No, 7-Up..;-P.",
            "fix": "shairy",
            "length": 143,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is a blood cell's favourite candy? Rhesus Pieces. Badum tsch.",
            "fix": "tsch",
            "length": 66,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I'd like to see a world without plagarism: You may say I'm a dreamer, but I'm not the only one.",
            "fix": "plagarism",
            "length": 95,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two drums and a cymbal fall off of a cliff. Ba-dum tisch.",
            "fix": "tisch",
            "length": 57,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a dinosaur made of plastic bricks? A legosaurus! Randomly made up this the other night, thought I'd share.",
            "fix": "legosaurus",
            "length": 123,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A surgeon turns to his assistant, while operating, and says... \"Hey, it's the right or the left one?\" \"Are you serious?\" \"Just kidneying!\"",
            "fix": "kidneying",
            "length": 144,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do Chinese people say when it is sunny outside I wish it was raining cats and dogs that would be dericious.",
            "fix": "dericious",
            "length": 112,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I was pulled over for speeding the other day: The officer asked me had I any excuses for the speed I was going. I said, \"sorry officer I was just trying to keep up with the traffic.\" He paused, looked around and said, \"but there is no one else on the road.\" I said 'why do you think I was going so fast, shur wasn't I trying to catch up. \"",
            "fix": "shur",
            "length": 344,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the Ogre cry when he left the doctor's office? He was diagnosed with shrektal cancer.",
            "fix": "shrektal",
            "length": 93,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why are people afraid to talk to black people? Their scared they'll say something nigative.",
            "fix": "nigative",
            "length": 91,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "My girlfriend broke my heart this Christmas: We'd been together for many years. We've had our fights but we also have so many really good memories together. I consider her as The One, my soulmate. I can't picture my life without her.. We spent Christmas at her parent's place this year. After we opened our presents, she looked at me and asked if we could speak together. I gave her that dress she's been talking about for months - which was wrapped around a couple of plane tickets to Barcelona. We'd always talked about going there. But now she wanted to talk with me. Alone. I was for sure thinking of spontanious thank-you-sex and smiled as I went in the other room along with her. And then she's looking at me and says: \"We need to break up.\" Shocked, of course, I look at her unable to find any words. She takes my hand and says: \"But don't worry, you won't lose me. We will always stay brother and sister.\"",
            "fix": "spontanious",
            "length": 917,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why was the methathesiophobe scared of coins? Because he was afraid of change.",
            "fix": "methathesiophobe",
            "length": 78,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a mix between an umingmak and a wealthy Canadian-American inventor? An Elon Muskox! Please don't kill me.",
            "fix": "umingmak",
            "length": 122,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A rabbit and a bear were walking through the woods: The bear turns to the rabbit and says man I gotta shit. The rabbit said you know what me too. They each find their oun perspective bush, then meet back on the trail. Then bear turns to the rabbit and asks sheepishly, do you ever have a problem with shit sticking to your fur? Rabbit says no, Bear picks him up and wipes his ass...",
            "fix": "oun",
            "length": 382,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There is now a blood test to determine gender attraction. It checks homoglobin levels.",
            "fix": "homoglobin",
            "length": 86,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many RothChilds does it take to change a light bulb? There still working on it...",
            "fix": "RothChilds",
            "length": 85,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What species of mushroom is known for being an instigator? The shittalkie mushroom.",
            "fix": "shittalkie",
            "length": 83,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "From my 7yo: \"Why did the moon marry the sun?\" Because the sun is hott.",
            "fix": "hott",
            "length": 73,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Fight with Alarm Clock: Had a fight with my alarm clock, I refused to wake up, things got violen. Now its broken and I am awake don't know who won.",
            "fix": "violen",
            "length": 147,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the kids not want to eat their PbJ sandwiches? 'Cause it had lead in them.",
            "fix": "PbJ",
            "length": 82,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a homeless man who trashes food you give him then says he only accepts cash? A rootabegga.",
            "fix": "rootabegga",
            "length": 107,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A little alley street walks into a bar... He sits down at the only chair and asks the bartender for a drink. \"Umm uhhh sir? C-could I please have some.. Uhh... Water?\" The bartender gives him his cup of water and the little alley sips away happily. Then, your typical 2-way street walks in, sees the little alleyway in the only chair and politely asks him to move. \"Mr. Alley, you seem to be in my seat, could you please find somewhere else to drink your beverage?\" The little alley squeaks, \"Oh I'm so sorry Mr. Two-way street, I didn't ummm realize I was in your chair. Here you go.\" The little alley downs his water and scampers out of the bar. The two-way street orders some Pepsi and sits down to read his morning paper. Suddenly, a mean old 2-lane highway storms in, and yells, \"Out of my seat ya weenie.\" The street replied, \"Sir, I'm trying to enjoy my refreshment and read the morni...\" WHAM! The highway smacks the street on the head and the street decides he's going to be a pacifist today, \"I mean of course, it's your seat, my apologies.\" \"Gimme some beer, not that pussy ass girly cola.\" The bartender pulls out the finest Miller Light he can find and passes it to the highway. All was peaceful until around 4PM when Interstate 95 runs in during rush hour, \"MOVE OUT OF THE WAY BITCH I'M IN A HURRY.\" \"FUGGIN MAKE EM YA BASTARD,\" and the two hammer away at each other. The two go at it for a few minutes, but the highway could not keep up with the fury of hundreds of short-tempered drivers that had just been cut off. The interstate grabs the highway, \"GET THE FUCK OUT OF MY ASS,\" and tosses him where the 2-way street was nursing his headwound. The interstate claims victory, finishes his beer and says, \"QUICK BARTENDER, GIMME SOME VODKA.\" The interstate begins to down vodka by the handle. Halfway through the 3rd handle of vodka, the Autobahn walks in, \"Out of my way, you puny little piece of asphalt.\" The Autobahn grabs his gun and puts 6 rounds into the interstate. He sits down and tells the bartender, \"I want the blood of my enemies mixed with your hardest rum on the rocks, shaken, not stirred.\" The bartender squeezes out some of the interstate's blood from an open gunshot wound and uses the bullets for ice. He mixes it with rum and serves it to the autobahn. But before the autobahn can pick up his drink, a little dirt bike trail walks in. The autobahn says, \"Ha, I suppose you're gonna make me move out of my chair?\" The trail starts screaming and grabs the autobahn by his head and rips him limb from limb. With a guttural cry of victory the little bike trail runs out. At this point, the highway has recovered sufficiently to ask the street, \"Gee what's his problem?\" The street replies, \"Oh him? He's a cycle path.\"",
            "fix": "morni",
            "length": 2784,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Women: What do you call a woman without an @sshole? Divorced.",
            "fix": "sshole",
            "length": 61,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Someone asked me if there were any LGBT gamers in the group: I guess you could call be a GAYmer... Hehe.",
            "fix": "GAYmer",
            "length": 104,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There were zwei peanuts walking down the strase... And one was a salted... Peanut.",
            "fix": "strase",
            "length": 82,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between Christmas presents and ass whoopins? You ain't gettin' no Christmas presents!",
            "fix": "whoopins",
            "length": 107,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Ouch! A gorgeous young redhead goes into the doctor's office and said that her body hurt wherever she touched it. \"Impossible!\" Says the doctor. \"Show me.\" The redhea... D took her finger, pushed on her left breast and screamed, then she pushed her elbow and screamed in even more. She pushed her knee and screamed; Likewise she pushed her ankle and screamed. Everywhere she touched made her scream. The doctor said, \"You're not really a redhead, are you?\" Well, no, \"she said,\" I'm actually a blonde.\"\" I thought so, \"the doctor said.\" Your finger is broken. \"",
            "fix": "redhea",
            "length": 574,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two scientitsts walk into a bar... 1st Scientist, -\"I'll have an H2O.\" 2nd Scientist, -\"I'll have an H2O, too.\" The bartender gives them both water because he is able to distinguish the boundary tones that dictates the grammatical function of homonyms in coda position as well as pragmatic context.",
            "fix": "scientitsts",
            "length": 302,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What happened to the dinosaurs that first was aware of the metheorite? The where petrified.",
            "fix": "metheorite",
            "length": 91,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Minions. 3D. BluRayRiP. 4K. AXX0. Torrent: Talk like a pirate day.",
            "fix": "BluRayRiP",
            "length": 66,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy speaks with a comediant terrorist. Guy: What do you plan to do? Terrorist: I will kill 10.000 people and a squirrel. Guy: Why 10.000 people? Terrorist: See? No one cares about the ten thousand peop... What did you just say? Guy: I... Said... Why a squirrel, sir.",
            "fix": "peop",
            "length": 268,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Whats the question to the answer, \"it's a cockrobin?\" What's that up my ass Batman?",
            "fix": "cockrobin",
            "length": 85,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "How do you measure a great misunderstanding? In kiloWhats.",
            "fix": "kiloWhats",
            "length": 58,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Dad, things are going great.. Mr. Smith immigrated to the United States as a young man and fulfilled the immigrant's dream: He started up his own nail factory in Brooklyn, bought a nice house, sent his kids to college, even put the oldest son through Harvard Business School. When the young man graduated, Smith patted him on the back and said, \"Jimmy, you're the smart one. I'm turning the business over to you and retiring to Miami Beach.\" A year later he got an excited call from his son. \"Dad, things are going great: I've computerized inventory, automated the factory, even got a great new ad campaign going. You've got to come see it with your own eyes.\" So the young man picked him up at the airport, and just before they reached the factory a huge billboard loomed up. In huge let- ters, beneath a close-up of Jesus on the cross, it read USE SMITH'S NAILS FOR THE TOUGHEST JOBS. \"Jimmy,\" groaned Mr. Smith, \"that's the new ad campaign? I'm telling you, the public's never gonna go for it.\" A year later Jimmy informed him that things at the factory were going very well. \"Come on up and check it out, Dad,\" he urged. \"Oh, and by the way, you were right about that ad campaign. We've got a whole new one running now.\" So Mr. Smith flew up again, and on the way in from the airport spotted the same huge billboard. Only this time the picture showed Jesus crumpled at the foot of the cross, and the slogan read, YOU SHOULD HAVE USED SMITH'S NAILS.",
            "fix": "ters",
            "length": 1464,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A little girl walks into a pet shop and asks... 'Excuthe me, do you have any widdle wabbits?' The shopkeeper's heart melts, he gets down on his knees so that he's on her level, and says, 'Do you want a widdle white wabbit or a thoft, fwuffy bwack wabbit, or one like that widdle bwown wabbit over there?' The little girl blushes, rocks on her heels, puts her hands on her knees, leans forward and whispers... 'I don't weally fink my pyfon gives a phuk!..",
            "fix": "phuk",
            "length": 454,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "A little fish uwu: Once there was a little fish who wanted to be a journalist, he go, \"on air,\" and died...",
            "fix": "uwu",
            "length": 109,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Worst you ever been hurt: A bunch of good ol' boys are sitting in a diner telling stories about their worst injuries ever when ol' Curtis scooches a chair over and says, \"Well, the SECOND worst I ever got hurt was when I was huntin' one fall and the call o' nature came upon me. As I pulled down my overhauls and squatted, my nut sack triggered a bear trap that was chained there under some leaves and it snapped ahold of my jake!\" The whole table of fellas jumped back and let out a collective, \"Ooooo!\" Finally, one of them says, \"Jeez, Curt! What was the WORST you ever been hurt, then?\" Curtis leans in and says, \"Well, the sound o' that trap scurred me, and I lit out a runnin'. And when I got to the end o' that chain...\"",
            "fix": "scooches",
            "length": 735,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A lady stood in line in a grocery shop: She put the grocery on the table 1egg 1milk 1bred 1banana 1avocado 1soda 1bag of chips 1toothpaste 1ice 1bagofdicks 1orange 1gum 1cucumber The man at the counter is looking at the groceries and then at the woman and mumbles: Ohh so you are single!? The women answer a bit shy: Yes, how did you figure that out? The man who already packed the groceries in a bag looks at her as he hands over the bag and say: Because you are fucking ugly.",
            "fix": "bagofdicks",
            "length": 477,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a guy who is in color guard? A flaggot.",
            "fix": "flaggot",
            "length": 56,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What vegetable has the most sexual self-control? The cuecummer!",
            "fix": "cuecummer",
            "length": 63,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "What's another name for a necrophile? A disexual.",
            "fix": "disexual",
            "length": 49,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The President of the United States and the Prime minister of Canada are comparing their bodyguards. The president orders his secret service agent to jump off a 40 foot platform. The agent hesitates and does so. The Canadian Prime minster now requests his highly trained guard to jump from the same spot. Guard replies: \"Here's a kilogram of cocaine. You jum... WAIT! I WAS JOKING MR PRIME MINISTER! SHITT!\"",
            "fix": "jum",
            "length": 408,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One day Junior brings his Grandfather to school to share his stories as a Franco-American fighter pilot during WW2: His stories are wonderfully delightful and told with a thick French accent, while gesturing wildly using his hands to describe the movement of the airplanes. \"Zee fawkers fly like zees. Zen I fly like zees. Then zee fawkers fly back like zees, zen I pull up like zees. I shoots zee fawkers right out of the sky.\" The teacher said, \"I'm sorry to interrupt, sir. I know you kids are giggling but I want to be clear that a Fokker is a type of aircraft.\" The Ace said, \"certainmont, cherie. But zees fawkers were flying Mescherschmits.\"",
            "fix": "fawkers",
            "length": 654,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Why is Saturn like your balls? Because it is in between jupeter an your anus.",
            "fix": "jupeter",
            "length": 77,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Canadian bird watching is pretty depressing... It's hard to see these birds all aloon.",
            "fix": "aloon",
            "length": 86,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The prime: Why was 6 afraid that of 7? Because there was a rumor going around in the prime number that seven, the primest of all prime numbers, eight nine because nine wasn't a prime number, because apparently prime numbers don't eat other prime numbers that's how the stay prime numbers.",
            "fix": "primest",
            "length": 288,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a radish and a beet? I've never radished off to OP's mom.",
            "fix": "radished",
            "length": 87,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If Beethoven's music had base in it... He would be bassthoven.",
            "fix": "bassthoven",
            "length": 62,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How does a Metal Wizard perform his spells? He ChromeCasts. AnDruid humor.",
            "fix": "AnDruid",
            "length": 74,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you make a horomone? You refuse to pay her Courtesy of my grandmother.",
            "fix": "horomone",
            "length": 77,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A kid was on walk with her mother,: Looked at erected penis of a donkey, asked, mom what is it?, Nothing baby! Replied mother with smile, next day kid was on walk with his father, spotted same scene again, asked, what is it dad?, Father replied, Son it is one dangerous thing, don't like at it!. But dad, mom said its nothing, kid asked again, Father replied with a funny face, \"son its nothing for your momy:; May be, but will destroy our assholes for sure.\"",
            "fix": "momy",
            "length": 461,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do mathematics and environmental beat mixers have in common? Al Gore rythms.",
            "fix": "rythms",
            "length": 81,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Marcus and Yacov, two Hasidic Jews, went to Pincus the tailor for new suits. \"Pincus,\" Yacov said, \"the last time we came to you for new suits, we told you we wanted black suits. The suits you made were not black. They were sort of dark grey maybe, but not black, We need new suits, and this time we want black suits, from the darkest cloth there is.\" Pincus reached behind for a bolt of cloth and he said, \"See this cloth? It is from this fabric that I make the habits for nuns. In all the world,\" Pincus said, fingering the bolt of fabric, \"there is no blacker cloth than the cloth I make nun's habits from, and it is from this cloth that I'll make your new suits!\" A few weeks later the two Hasidic Jews were walking down the street in their new suits when they passed two nuns. Impulsively, on a whim, one of the men went up to one of the nuns. He grabbed her sleeve and held it up against his own. Then, in an angry voice, he muttered something to his friend and they both walked on. \"What did that man want?\" One nun asked the other. \"I don't know,\" she replied. \"He looked at my garment, said something in Latin, and left.\" \"In Latin?\" Asked the first nun. \"What did he say?\" He said, \"Marcus, Pincus fuctus.\"",
            "fix": "fuctus",
            "length": 1236,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "What do you call a gay dyslexic? A dickslexic.",
            "fix": "dickslexic",
            "length": 46,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the silent performer that got sent to jail? He was sodomimed.",
            "fix": "sodomimed",
            "length": 80,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Dealing with a Barking Dog A blonde and her husband are lying in bed listening to the next door neighbou r's dog. It has been in the backyard barking for hours and hours. The blonde jumps up out of bed and says, \"I've had enough of this.\" She goes downstairs. The blonde finally comes back up to bed and her husband says, \"The dog's barking is louder now, what have you been doing?\" The blonde says, \"I put the dog in our backyard... Let's see how THEY like all the barking!\"",
            "fix": "neighbou",
            "length": 481,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "At the height of The Beatles' popularity... A woman walks into a tattoo shop and pulls up her dress, exposing her thighs. She points the the left thigh and says, \"I want a tatto of John Lennon here,\" then to the right, \"and Paul McCartney right here.\" After agreeing on a price, she jumps on the table and the man goes to work. Upon completing the tattoos he bandages her thighs and says, \"Take off the bandages in two weeks. If you're not satisfied, come back and we'll figure it out.\" Two weeks later the woman storms into the tattoo parlor shouting, \"These don't look anything like The Beatles!\" The tattoo artist asks her to hop on the table and open her legs so he can have a look. \"I'm going to have to disagree maam, we're going to need a third opinion.\" The artist exits the backdoor and brings a drunken vagrant in from the alley. The vagrant looks at the woman sprawled out on the table and says, \"I don't know who it is on the left, and I don't know who it is on the right, but the one in the middle with the beard and stinky breath MUST be Willie Nelson!\"",
            "fix": "tatto",
            "length": 1079,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If EA made an alphabet. Do you think if EA made an alphabet they would make a free betabet then release the the betabet as an alphabet?",
            "fix": "betabet",
            "length": 135,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why does the easter bunny hide his eggs? He doesn't want anybody to know he fuc%ing the chicken.",
            "fix": "fuc",
            "length": 96,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What convention do you go to on St. Patrick's Day? LepreCON. I'm sorry, I had to.",
            "fix": "LepreCON",
            "length": 81,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Last night I had a dream that I was a muffler. When I woke up I was axhausted.",
            "fix": "axhausted",
            "length": 78,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How did the explorer react when the which doctor turned him into a miniature ballsack? He was a little testie! Bump dump pshhh!",
            "fix": "testie",
            "length": 127,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Are one-liners accepted? I immediately stopped telling people I was xenophobic when I realized it doesn't mean, \"afraid of xenomorphs.\"",
            "fix": "xenomorphs",
            "length": 137,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three workers on a bridge: Three construction workers were sitting on a bridge for lunch. One was American, one was Mexican, and the last Irish. The American opens his lunch box and sees he has a hamburger and says, \"if I get another damn hamburger I'm jumping from this bridge.\" The Mexican opens his and sees a burrito inside and says, \"damn my corazone, I'm tired of burritos, if I get another one ill join you in jumping!\" The Irish man opens his and sees he has potatoes and says, \"not even a flask to go with it, to hell with it ill jump to if I get the same lunch!\" So they all agree to jump if they receive the same lunches the next day and sure enough they all did and jumped from the bridge after leaving notes on why they did so. The wives are all standing around the graves when the Irish wife and the Mexicans wives are both crying about how if they didn't make the same lunch this wouldn't of happened. However the Americans wife stood there silently looking at her husbands gravestone. The other two wives were looking at her with questioning looks when she looks up at them and says, \"what? He packed his own damn lunch!\"",
            "fix": "corazone",
            "length": 1145,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Winter is a lot like Justin Bieber. It was cute and exciting in the begining, but now its a bit annoying and it should probably just stay in Canada.",
            "fix": "begining",
            "length": 148,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two wolves in a forest... Are arguing about who they are. The first wolf goes, \"I am a wolf you are a nuther one.\" The second wolf replies, \"We are both wolves, look I have a snout like your, paws like yours, my coat looks just like yours, our ears are the same.\" The first one then says, \"look I'll go out and show myself to the natives and then you go and show yourself after.\" They agree and the first wolf goes and runs past the natives' village. The natives point and say, \"hey look a wolf.\" The first wolf tells the second wolf to go. The second wolf runs past the village and the natives say, \"Hey look another one.\"",
            "fix": "nuther",
            "length": 633,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you say to Simba when he's slow? Mufasa! \"Move faster,\" heu heu heu.",
            "fix": "heu",
            "length": 78,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I recently bought some fragrenced candles: They cost me several scents.",
            "fix": "fragrenced",
            "length": 71,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Are you celebrating Chinese New Year, gurrrl? Because I'd like to go home from the baa and ram ewe.",
            "fix": "gurrrl",
            "length": 99,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Two drums and a cymbal fall off a cliff... Ba dun tsshh.",
            "fix": "tsshh",
            "length": 56,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Cabbage get merried to Onion: Friends ask them about wedding nigh... Cabbage told them in sad way, \"What wedding night, it tooks whole night to undress each other.\"",
            "fix": "merried",
            "length": 166,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a woman who's not wearing underwear? A barracouchie.",
            "fix": "barracouchie",
            "length": 69,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "What did the fish thief say to the cops when he turned himself in? I gillt was killing me.",
            "fix": "gillt",
            "length": 90,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Lump sum: I don't want to say the Chinese companies are behind the times when it comes to retirement packages, but my friend who worke din China and recently retired asked for a lump sum. They gave it to him with pork fried rice!",
            "fix": "worke",
            "length": 229,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So a guy wants to prove there is a god and decides to let God save him in his flooding home. When the water is down to his knees, a rescue boat arrives. He refuses to leave in it and says, \"God will save me.\" When the water is to his chest, another boat arrives, to which he says the same thing. When the water is at his chin, a helicopter arrives, but he denies it again, so he drowns. When he accends up to heaven, he confronts God and says, \"Why didn't you save me?\" To which God replies, \"What do you mean? I sent two boats and a helicopter!\"",
            "fix": "accends",
            "length": 552,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the trilby wearing neckbeard atheist find in t he synagogue during channukkah? M'nora.",
            "fix": "channukkah",
            "length": 95,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the hotel clerk tell the guest with paruresis during check in? Your in 8.",
            "fix": "paruresis",
            "length": 82,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Found a concert that costs 45 cents!... It's 50cent and Nickelback /mikedrop.",
            "fix": "mikedrop",
            "length": 77,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many Greg Louganis does it take to fill a swimming pool? I don't know but it only takes one to empty it.",
            "fix": "Louganis",
            "length": 108,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A dyslexic guy walks into a bra: One of my favs.",
            "fix": "favs",
            "length": 48,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Kindergarten: Girl kindergarten asked teacher girl kindergarten: Teacher Is 5 years old girl will get pragnant? Teacher: No, because she has no menstruation yet. Boy kindergarten: See? I told you, don't be afraid.",
            "fix": "pragnant",
            "length": 213,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a society governed by men with no testicles? An anorchy... I swear, that one KILLED at the urology convention.",
            "fix": "anorchy",
            "length": 127,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Some elements walk into a bar... Oxygen, hydrogen, sulpher, sodium, and phosphorus all walk into a bar. The bartender says, \"OH SNaP!\"",
            "fix": "sulpher",
            "length": 136,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "FYI: The. Gif file format is pronounced, \"jiff:\" I know because I joogled it.",
            "fix": "joogled",
            "length": 79,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is mitosis? Those are the things on the ends of my feetsis. Thought of this during my last bio exam.",
            "fix": "feetsis",
            "length": 105,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The porn version of Interstellar is out... It's called, \"IntoStella.\" For the bonus point: In the gay porn version, Matthew McConaughey ends up in Uranus.",
            "fix": "IntoStella",
            "length": 156,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Twat did you say? I cunt hear you. Iv got an ear infucktion. Better assk again.",
            "fix": "assk",
            "length": 79,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I hate it when winter comes. It makes my weenus so dry.",
            "fix": "weenus",
            "length": 55,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "My Somali Girlfriend's nickname is 747... Because her blackbox can take a hell of a pounding.",
            "fix": "blackbox",
            "length": 93,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "What is a group of endermen called? A basketball team.",
            "fix": "endermen",
            "length": 54,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "I was constipated once... Nowhere near as shitty as diharea tho...",
            "fix": "diharea",
            "length": 66,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Masked man robs a sperm bank... He approaches the safe with a gun and yells at the nurse, \"Open up this safe!\" Nurse replied in fear, \"But sir this is a sperm bank, we don't have any money here.\" I said open up this safe now! \"He yelled again and the nurse opened it up.\" Now drink this viel!\"\" But sir this is sperm!\"\" I said drink! \"And the nurse drank with disgust.\" Drink another! \"And she emptied another viel with less resistance. The robber reveals his face and nurse found out that the robber was actually her husband.\" Now Sharon, was it really that hard? \"",
            "fix": "viel",
            "length": 581,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the lumberjack who was looking oking for help? He went to town and found another feller.",
            "fix": "oking",
            "length": 107,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy died and went to Hell: He goes all OH NO I'M DAMNED -- the Devil says calm down, the place is nicer than you think. It is? Sure. Do you like to drink? I guess so. Good! Wednesday is Drinking Day! We have all beverages from all over the world, you can drink anything you like! Is that so? Yes! And that's not all. Do you like to smoke? Uh yes? Good! Thursday is Smoke Day in Hell! All cigars, narguile pipes you name it we got it! Cool, heh? Yes it is! I see Hell is really a nice place! Told you so! Say, do you like to take dicks in the ass? What? No, I don't! Uh, I think you wont like Fridays much.",
            "fix": "narguile",
            "length": 607,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did Avril Lavigne say when she found out her massuse was actually an undercover cop? All this time you were pretending? So much for my happy ending... I can't promise I am the first one to say it, but I did make it up myself.",
            "fix": "massuse",
            "length": 230,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the cannibal do after he dumped his girlfriend? Wiped his ass. Ba dum tschhh.",
            "fix": "tschhh",
            "length": 86,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How did the geometry teach kill himself? He used a hypote, -\"noose.\"",
            "fix": "hypote",
            "length": 70,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I cumfronted my girlfriend this morning... What did she have to say? Get me a towel.",
            "fix": "cumfronted",
            "length": 84,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "How do you stop a lawyer from drowing? Shoot him before he hits the ground.",
            "fix": "drowing",
            "length": 75,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I was laying on my significant other's chest and commented on how comfortable it was... And she hits me with a, \"It's like it's MAMMorey foam!\" Line. I was quite impressed.",
            "fix": "MAMMorey",
            "length": 174,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What was the name of Europe's most famous Jewish knight? Sir cumcised.",
            "fix": "cumcised",
            "length": 70,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "A frog walks into a bank: A frog is looking to open up a new business, so he stops by his local bank to see about financing. His loan officer, Mrs. Paddywhack, is going through his financials. \"Do you have any collateral?\" She asks. \"We can't give you any money without something to secure the loan.\" The frog pulls out a small figurine from his briefcase. \"This was my great-great-great grandfathers. It I s vary valuable and is in perfect condition; It has never left its place on my mantle until today.\" Mrs. Paddywhack looks it over and over. She knows it is valuable, but can't quite figure out what it is. \"I'll have to clear this with my boss,\" she says. She walks back to her bosses office, explains the whole situation and sets the figurine down on the desk. \"I just can't figure out what it is,\" she says. Her boss takes one look at it and says, \"It's a nick-knack, Paddywhack. Give the frog a loan.\"",
            "fix": "financials",
            "length": 922,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a baby deer's droppings? FawnDoo! Nailed it.",
            "fix": "FawnDoo",
            "length": 61,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A vampire walks into a bar: This vampire walks into a bar. Says ooOOOooOOOooo boogity boogity. Bar tender says, \"Alright, well what'll you have?\" Vampire sits down and says can I get a big glass of hot water? \"Bartender goes, gets a giant cup of boiling water and says.\" Here. I thought you guys needed blood or something like that though, why hot water? \"Vampire reaches into his coat pocket, pulls out this giant tampon and says.\" I'm making tea. \"",
            "fix": "boogity",
            "length": 457,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What so you call a bulldog mixed with a shih tzu? A bull shiht.",
            "fix": "shiht",
            "length": 63,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two friends join the SAS. Two friends, Pat and Mick, are trying to join the SAS. After doing all the training their commanding officer in charge tells them, \"Now you two must realise that you have to do anything your commanding officer says no question asked, so Mick go into that room there,\" so Mick walks in. The officer then says to Pat, \"Do you think you could kill a friend Pat?\" To which Pat replies, \"oh no I love all my friends.\" \"WHAT DID I JUST SAY PAT!\" \"Yes sir!\" Pat exclaims. The officer then says, \"Do you think you could kill Mick, Pat?\" \"Oh never sir Mick is like a brother to me I have kno...\" \"WHAT DID I JUST SAY!\" \"Oh right, yes sir.\" \"Well then take this gun, and walk into that room, where you shall kill Mick,\" so Pat goes in and 5 minutes later he goes back to his commanding officer and he says, \"I've done it sir.\" \"Well you'll be glad to know that gun was fake Pat and just call Mick back in.\" Pat then replies, \"I can't sir.\" \"Why?\" \"I strangled him.\"",
            "fix": "kno",
            "length": 1011,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A zoophil, a murderer, a necrophiliac, a pyromaniac and a sadomasochist were gathered at a party. After a while they started to get bored, and the zoophile suggested they go out to find a cat they could rape. The killer was enthusiastic and suggested they kill it afterwards. The necrophilic was happy and wanted to sleep with it after it was dead. The pyromaniac looks at the others with wide eyes and suggest they burn it afterwards. Everyone looks at the sadomasochist and asks him: So what do you have to contribute to this conversation? The sadomasochist: Mjaaauuu ...",
            "fix": "zoophil",
            "length": 573,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Little salamander: So this happy little salamander is taking a stroll through the woods one day, and all of a sudden gets a whiff of some weed. Smells like pretty good stuff too, so he decides to investigate... He follows his nose for a little and then looks up, there is a monkey up in a tree. This monkey is smoking a huge joint, the salamander yells, \"hey! Monkey! Smells like some good ass weed you got,\" the monkey looked down, startled.. And said, \"hell yeah! C'mon up man have a puff!\" So the salamander made his way up the tree, took a few fat rips and coughed his ass off. \"Monkey! That shit is the SHIT!\" The salamander exclaimed. \"But... I have dry mouth so bad now man! Sandpaper!\" So the monkey pointed to the left and said, \"go over that little hill and through the bushes. You'll find a nice cool stream to drink out of.\" So he made his way over the hill, and through the bushes down to the stream. He started drinking away with his eyes closed. After a satisfying drink, he opened his and eyes and WHOA! He was face to face with a big ass alligator. The alligator spoke before he could.. \"Salamander... Looks like you have been chiefing some fine ass weed! Where may I ask did you partake?\" \"Through those bushes and over the hill, there is a nice monkey in a tree. He will smoke you up!\" \"Thank you man,\" replied the alligator. And he started walking, through the bushes and over the hill. It took him a few minutes but he followed the smell and at last saw the monkey up in a tree. The monkey looked down and saw the alligator and said, \"FUUUUUCK DUDE! YOU MUSTVE BEEN REEEEEEEALY THIRSTY!\"",
            "fix": "chiefing",
            "length": 1626,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Who is this Rorschach guy? And why did he paint so many pictures of my parents fighting? -Rob DenBleyker.",
            "fix": "DenBleyker",
            "length": 105,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Chin nut: What do you call nuts on a wall? A wallnut What do you call nuts on a chest? A chestnut What do you call nuts on your chin? A blowjob.",
            "fix": "wallnut",
            "length": 144,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A Modern Islamic Couple are getting married.. A modern Islamic couple preparing for a religious wedding meet with their Mullah for counseling. The Mullah asks if they have any last questions before they leave. The man says, \"We realize it's tradition in Islam for men to dance with men, and women to dance with women. But, at our wedding reception, we'd like your permission to dance together.\" \"Absolutely not,\" says the Mullah. \"It's immoral. Men and women always dance separately.\" \"So, after the ceremony I can't even dance with my own wife?\" \"No,\" answers the Mullah. \"It ' s forbidden in Islam.\" \"Well, OK,\" says the man. \"What about sex? Can we finally have sex?\" \"Of course!\" Replies the Mullah. \"AlIa ho Akber! Sex is OK within a marriage to have children!\" \"What about different positions?\" Asks the man. \"AlIa ho Akber! No problem,\" says the Mullah. \"Woman on top?\" The man asks. \"Sure,\" says the Mullah. \"AlIa ho Akber. Go for it!\" \"Doggy style?\" \"Sure! AlIa ho Akber!\" \"On the kitchen table?\" \"Yes, yes! AlIaho Akber!\" \"Can I do it with all my four wives together on rubber sheets with a bottle of hot oil, a couple of vibrators, leather harnesses, a bucket of honey and a porno video?\" \"You may, indeed. AlIa ho Akber!\" \"Can we do it standing up?\" \"No,\" says the Mullah. \"Why not?\" Asks the man. \"Because that could lead to dancing.\"",
            "fix": "AlIaho",
            "length": 1397,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple with five kids had to be careful when trying to have sexy times. The codenamed it, \"doing the laundry.\" One day the husband was trying to get frisky, but the wife just had too much to do with the kids. Well she thought, he has been working a lot of overtime to pay for christmas and has been attentive to every other need that has come up. She calls her sister and makes plans for her to pick up one of the kids giving her some extra time that day. She walks up behind him and whispers, \"I have some time to help you out with that laundry.\" \"It's ok sweetie, it was a small load, I did it by hand.\"",
            "fix": "codenamed",
            "length": 613,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Wittle Wabbit: Little girl walks into a pet shop and asks in the sweetest little lisp: \"Excuthe me, mithter, do you keep wittle wabbits?\" And the shopkeeper gets down on his knees, so that he's on her level, and asks: \"Do you want a wittle white wabby or a soft and fuwwy bwack wabby or maybe one like that cute wittle bwown wabby over there?\" The little girl puts her hands on her knees, leans forward and says in a quiet voice: \"I don't fink my pyfon really giveths a thit.\"",
            "fix": "giveths",
            "length": 482,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Baseball heaven? There were two old guys, Abe and Sol, sitting on a bench in a park feeding pigeons and talking about baseball, just like they did every day. Abe turns to Sol and says, \"Do you think there's baseball in heaven?\" Solomon thinks about it for a minute and replies, \"I dunno, Abe. But let's make a deal: If I die first, I will come back and tell you, and if you die first, you come back and tell me, if there is basebal l in heaven.\" They shake on it and, sadly, a few months later poor Abe passes on. One day soon afterward, Sol is sitting there feeding the pigeons by himself when he hears a voice whisper, \"Sol... Sol...\" Sol responds, \"Abe! Is that you?\" \"Yes it is Sol,\" whispers the spirit of Abe. Sol, still amazed, asks, \"So, is there baseball in heaven?\" \"Well,\" says Abe says, \"I got good news and I got bad news.\" \"Gimme the good news first,\" says Sol. Abe says, \"Well... There is baseball in heaven.\" Sol says, \"That's great! What news could be bad enough to ruin that!?\" Abe sighs and whispers, \"You're pitching on Friday.\"",
            "fix": "basebal",
            "length": 1072,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Mike Wazowski opens up a tattoo shop: Called Monsters Ink.",
            "fix": "Wazowski",
            "length": 58,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A woman with small breasts is fed up with her bust line: So she goes to a witch doctor. He does a ceremony where he tells her, \"everytime someone says I'm sorry to you your breast will grow.\" So she leaves and on her way out knocks into someone who says pardon me. She looks down and her breast double in size. So while walking down the street she turns the corner and knocks into someone else who says I'm sorry. She looks down again and the are huge. Too huge. So she starts rushing back to the witch doctor to get him to stop the spell. She bumps into an Asian man who says to her, \"Thousand Pardons.\" The next day the headline of the news paper read, \"Man killed by flying torpedos.\"",
            "fix": "everytime",
            "length": 693,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I'm part indian: My ancestors are from the slapahoe tribe.",
            "fix": "slapahoe",
            "length": 58,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "A man's wife loves to go commando... When she's wearing a dress and one day she goes to the mall to get a new pair of shoes. The salesman helps her try on a few pairs and notices jer lackbof underwear. He says, \"Miss I could eat that pussy full of ice cream.\" She gets offended and storms home to complain to her husband and demands he go beat the shit out of the salesman. He says, \"No for 3 reasons. One you've got too damn many shoes already. Two you should have worn panties. And three... Any man who can eat that much ice cream is a man I will not fuck with.\"",
            "fix": "lackbof",
            "length": 568,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do a politician and a sperm have in common? One in thousnads has a chance to e a human being.",
            "fix": "thousnads",
            "length": 98,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy moves into a new neighborhood... And a redneck knocks on the door. The guy opens and the redneck says, \"howdy neighbor! Welcome to the neighborhood! Tonight I'm gona throw a party in your honor - there's gona be a whole lot of dancin, a whole lot of drinkin and a whole lot of screwin!\" The guy replies, \"sounds great! What should I bring?\" The redneck replies, \"wll - you can bring whatever you want, it's just gona be you and me.\"",
            "fix": "wll",
            "length": 444,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call an asian lounge singer? George Crooney.",
            "fix": "Crooney",
            "length": 56,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So a man dies and finds himself in hell. As he is sitting in the waiting lobby the devil walks up to him and they strike up a conversation. \"So what do you do here in Hell anyway?\" Says the man. \"Well do you like to smoke weed?\" Answers the devil, \"Fuck yes!\" \"You are gonna looove Mondays! We all gather together and smoke as much weed as we can handle!\" \"What else?\" \"Do you like to drink?\" Asks the devil. \"Of course!\" \"You are gonna loooove Tuesdays! We drink as much as we want with no risk of a hangover!\" \"Awesome! Hell doesn't sound half bad!\" \"And do you like to eat?\" Asked the devil. \"HELL YEAH!\" Replies the man. \"You are gonna loooooove Wednesdays! We always have a huge feast and you can eat all day without feeling sick!\" Says the devil. \"Alright!\" \"And are you a homosexual?\" \"Um.. No.\" \"You're gonna hate Thursdays.\"",
            "fix": "looove",
            "length": 865,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Do you love multiple trees?... No. I'm mahogamous.",
            "fix": "mahogamous",
            "length": 50,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you circumsize a redneck? Kick his sister in the jaw.",
            "fix": "circumsize",
            "length": 60,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a group of politically similar crows? A cawcus.",
            "fix": "cawcus",
            "length": 64,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a zoo enclosure without any change? A nickeless cage.",
            "fix": "nickeless",
            "length": 70,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two aliens sitting in a bar... The first looks at the second and says, \"bleep loop do dooee day baaarrggg.\" The second looks ask at the first a d says, \"shut up frank, you're drunk.\"",
            "fix": "dooee",
            "length": 186,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        }
    ]
}
