{
    "count": 151,
    "jokes": [
        {
            "joke": "If Beethoven's music had base in it... He would be bassthoven.",
            "fix": "bassthoven",
            "length": 62,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How does a Metal Wizard perform his spells? He ChromeCasts. AnDruid humor.",
            "fix": "AnDruid",
            "length": 74,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you make a horomone? You refuse to pay her Courtesy of my grandmother.",
            "fix": "horomone",
            "length": 77,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A kid was on walk with her mother,: Looked at erected penis of a donkey, asked, mom what is it?, Nothing baby! Replied mother with smile, next day kid was on walk with his father, spotted same scene again, asked, what is it dad?, Father replied, Son it is one dangerous thing, don't like at it!. But dad, mom said its nothing, kid asked again, Father replied with a funny face, \"son its nothing for your momy:; May be, but will destroy our assholes for sure.\"",
            "fix": "momy",
            "length": 461,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do mathematics and environmental beat mixers have in common? Al Gore rythms.",
            "fix": "rythms",
            "length": 81,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Marcus and Yacov, two Hasidic Jews, went to Pincus the tailor for new suits. \"Pincus,\" Yacov said, \"the last time we came to you for new suits, we told you we wanted black suits. The suits you made were not black. They were sort of dark grey maybe, but not black, We need new suits, and this time we want black suits, from the darkest cloth there is.\" Pincus reached behind for a bolt of cloth and he said, \"See this cloth? It is from this fabric that I make the habits for nuns. In all the world,\" Pincus said, fingering the bolt of fabric, \"there is no blacker cloth than the cloth I make nun's habits from, and it is from this cloth that I'll make your new suits!\" A few weeks later the two Hasidic Jews were walking down the street in their new suits when they passed two nuns. Impulsively, on a whim, one of the men went up to one of the nuns. He grabbed her sleeve and held it up against his own. Then, in an angry voice, he muttered something to his friend and they both walked on. \"What did that man want?\" One nun asked the other. \"I don't know,\" she replied. \"He looked at my garment, said something in Latin, and left.\" \"In Latin?\" Asked the first nun. \"What did he say?\" He said, \"Marcus, Pincus fuctus.\"",
            "fix": "fuctus",
            "length": 1236,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "What do you call a gay dyslexic? A dickslexic.",
            "fix": "dickslexic",
            "length": 46,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the silent performer that got sent to jail? He was sodomimed.",
            "fix": "sodomimed",
            "length": 80,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Dealing with a Barking Dog A blonde and her husband are lying in bed listening to the next door neighbou r's dog. It has been in the backyard barking for hours and hours. The blonde jumps up out of bed and says, \"I've had enough of this.\" She goes downstairs. The blonde finally comes back up to bed and her husband says, \"The dog's barking is louder now, what have you been doing?\" The blonde says, \"I put the dog in our backyard... Let's see how THEY like all the barking!\"",
            "fix": "neighbou",
            "length": 481,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "At the height of The Beatles' popularity... A woman walks into a tattoo shop and pulls up her dress, exposing her thighs. She points the the left thigh and says, \"I want a tatto of John Lennon here,\" then to the right, \"and Paul McCartney right here.\" After agreeing on a price, she jumps on the table and the man goes to work. Upon completing the tattoos he bandages her thighs and says, \"Take off the bandages in two weeks. If you're not satisfied, come back and we'll figure it out.\" Two weeks later the woman storms into the tattoo parlor shouting, \"These don't look anything like The Beatles!\" The tattoo artist asks her to hop on the table and open her legs so he can have a look. \"I'm going to have to disagree maam, we're going to need a third opinion.\" The artist exits the backdoor and brings a drunken vagrant in from the alley. The vagrant looks at the woman sprawled out on the table and says, \"I don't know who it is on the left, and I don't know who it is on the right, but the one in the middle with the beard and stinky breath MUST be Willie Nelson!\"",
            "fix": "tatto",
            "length": 1079,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If EA made an alphabet. Do you think if EA made an alphabet they would make a free betabet then release the the betabet as an alphabet?",
            "fix": "betabet",
            "length": 135,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why does the easter bunny hide his eggs? He doesn't want anybody to know he fuc%ing the chicken.",
            "fix": "fuc",
            "length": 96,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What convention do you go to on St. Patrick's Day? LepreCON. I'm sorry, I had to.",
            "fix": "LepreCON",
            "length": 81,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Last night I had a dream that I was a muffler. When I woke up I was axhausted.",
            "fix": "axhausted",
            "length": 78,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How did the explorer react when the which doctor turned him into a miniature ballsack? He was a little testie! Bump dump pshhh!",
            "fix": "testie",
            "length": 127,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Are one-liners accepted? I immediately stopped telling people I was xenophobic when I realized it doesn't mean, \"afraid of xenomorphs.\"",
            "fix": "xenomorphs",
            "length": 137,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three workers on a bridge: Three construction workers were sitting on a bridge for lunch. One was American, one was Mexican, and the last Irish. The American opens his lunch box and sees he has a hamburger and says, \"if I get another damn hamburger I'm jumping from this bridge.\" The Mexican opens his and sees a burrito inside and says, \"damn my corazone, I'm tired of burritos, if I get another one ill join you in jumping!\" The Irish man opens his and sees he has potatoes and says, \"not even a flask to go with it, to hell with it ill jump to if I get the same lunch!\" So they all agree to jump if they receive the same lunches the next day and sure enough they all did and jumped from the bridge after leaving notes on why they did so. The wives are all standing around the graves when the Irish wife and the Mexicans wives are both crying about how if they didn't make the same lunch this wouldn't of happened. However the Americans wife stood there silently looking at her husbands gravestone. The other two wives were looking at her with questioning looks when she looks up at them and says, \"what? He packed his own damn lunch!\"",
            "fix": "corazone",
            "length": 1145,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Winter is a lot like Justin Bieber. It was cute and exciting in the begining, but now its a bit annoying and it should probably just stay in Canada.",
            "fix": "begining",
            "length": 148,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two wolves in a forest... Are arguing about who they are. The first wolf goes, \"I am a wolf you are a nuther one.\" The second wolf replies, \"We are both wolves, look I have a snout like your, paws like yours, my coat looks just like yours, our ears are the same.\" The first one then says, \"look I'll go out and show myself to the natives and then you go and show yourself after.\" They agree and the first wolf goes and runs past the natives' village. The natives point and say, \"hey look a wolf.\" The first wolf tells the second wolf to go. The second wolf runs past the village and the natives say, \"Hey look another one.\"",
            "fix": "nuther",
            "length": 633,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you say to Simba when he's slow? Mufasa! \"Move faster,\" heu heu heu.",
            "fix": "heu",
            "length": 78,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I recently bought some fragrenced candles: They cost me several scents.",
            "fix": "fragrenced",
            "length": 71,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Are you celebrating Chinese New Year, gurrrl? Because I'd like to go home from the baa and ram ewe.",
            "fix": "gurrrl",
            "length": 99,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Two drums and a cymbal fall off a cliff... Ba dun tsshh.",
            "fix": "tsshh",
            "length": 56,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Cabbage get merried to Onion: Friends ask them about wedding nigh... Cabbage told them in sad way, \"What wedding night, it tooks whole night to undress each other.\"",
            "fix": "merried",
            "length": 166,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a woman who's not wearing underwear? A barracouchie.",
            "fix": "barracouchie",
            "length": 69,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "What did the fish thief say to the cops when he turned himself in? I gillt was killing me.",
            "fix": "gillt",
            "length": 90,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Lump sum: I don't want to say the Chinese companies are behind the times when it comes to retirement packages, but my friend who worke din China and recently retired asked for a lump sum. They gave it to him with pork fried rice!",
            "fix": "worke",
            "length": 229,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So a guy wants to prove there is a god and decides to let God save him in his flooding home. When the water is down to his knees, a rescue boat arrives. He refuses to leave in it and says, \"God will save me.\" When the water is to his chest, another boat arrives, to which he says the same thing. When the water is at his chin, a helicopter arrives, but he denies it again, so he drowns. When he accends up to heaven, he confronts God and says, \"Why didn't you save me?\" To which God replies, \"What do you mean? I sent two boats and a helicopter!\"",
            "fix": "accends",
            "length": 552,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the trilby wearing neckbeard atheist find in t he synagogue during channukkah? M'nora.",
            "fix": "channukkah",
            "length": 95,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the hotel clerk tell the guest with paruresis during check in? Your in 8.",
            "fix": "paruresis",
            "length": 82,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Found a concert that costs 45 cents!... It's 50cent and Nickelback /mikedrop.",
            "fix": "mikedrop",
            "length": 77,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many Greg Louganis does it take to fill a swimming pool? I don't know but it only takes one to empty it.",
            "fix": "Louganis",
            "length": 108,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A dyslexic guy walks into a bra: One of my favs.",
            "fix": "favs",
            "length": 48,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Kindergarten: Girl kindergarten asked teacher girl kindergarten: Teacher Is 5 years old girl will get pragnant? Teacher: No, because she has no menstruation yet. Boy kindergarten: See? I told you, don't be afraid.",
            "fix": "pragnant",
            "length": 213,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a society governed by men with no testicles? An anorchy... I swear, that one KILLED at the urology convention.",
            "fix": "anorchy",
            "length": 127,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Some elements walk into a bar... Oxygen, hydrogen, sulpher, sodium, and phosphorus all walk into a bar. The bartender says, \"OH SNaP!\"",
            "fix": "sulpher",
            "length": 136,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "FYI: The. Gif file format is pronounced, \"jiff:\" I know because I joogled it.",
            "fix": "joogled",
            "length": 79,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is mitosis? Those are the things on the ends of my feetsis. Thought of this during my last bio exam.",
            "fix": "feetsis",
            "length": 105,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The porn version of Interstellar is out... It's called, \"IntoStella.\" For the bonus point: In the gay porn version, Matthew McConaughey ends up in Uranus.",
            "fix": "IntoStella",
            "length": 156,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Twat did you say? I cunt hear you. Iv got an ear infucktion. Better assk again.",
            "fix": "assk",
            "length": 79,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I hate it when winter comes. It makes my weenus so dry.",
            "fix": "weenus",
            "length": 55,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "My Somali Girlfriend's nickname is 747... Because her blackbox can take a hell of a pounding.",
            "fix": "blackbox",
            "length": 93,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "What is a group of endermen called? A basketball team.",
            "fix": "endermen",
            "length": 54,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "I was constipated once... Nowhere near as shitty as diharea tho...",
            "fix": "diharea",
            "length": 66,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Masked man robs a sperm bank... He approaches the safe with a gun and yells at the nurse, \"Open up this safe!\" Nurse replied in fear, \"But sir this is a sperm bank, we don't have any money here.\" I said open up this safe now! \"He yelled again and the nurse opened it up.\" Now drink this viel!\"\" But sir this is sperm!\"\" I said drink! \"And the nurse drank with disgust.\" Drink another! \"And she emptied another viel with less resistance. The robber reveals his face and nurse found out that the robber was actually her husband.\" Now Sharon, was it really that hard? \"",
            "fix": "viel",
            "length": 581,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the lumberjack who was looking oking for help? He went to town and found another feller.",
            "fix": "oking",
            "length": 107,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy died and went to Hell: He goes all OH NO I'M DAMNED -- the Devil says calm down, the place is nicer than you think. It is? Sure. Do you like to drink? I guess so. Good! Wednesday is Drinking Day! We have all beverages from all over the world, you can drink anything you like! Is that so? Yes! And that's not all. Do you like to smoke? Uh yes? Good! Thursday is Smoke Day in Hell! All cigars, narguile pipes you name it we got it! Cool, heh? Yes it is! I see Hell is really a nice place! Told you so! Say, do you like to take dicks in the ass? What? No, I don't! Uh, I think you wont like Fridays much.",
            "fix": "narguile",
            "length": 607,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did Avril Lavigne say when she found out her massuse was actually an undercover cop? All this time you were pretending? So much for my happy ending... I can't promise I am the first one to say it, but I did make it up myself.",
            "fix": "massuse",
            "length": 230,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the cannibal do after he dumped his girlfriend? Wiped his ass. Ba dum tschhh.",
            "fix": "tschhh",
            "length": 86,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How did the geometry teach kill himself? He used a hypote, -\"noose.\"",
            "fix": "hypote",
            "length": 70,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I cumfronted my girlfriend this morning... What did she have to say? Get me a towel.",
            "fix": "cumfronted",
            "length": 84,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "How do you stop a lawyer from drowing? Shoot him before he hits the ground.",
            "fix": "drowing",
            "length": 75,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I was laying on my significant other's chest and commented on how comfortable it was... And she hits me with a, \"It's like it's MAMMorey foam!\" Line. I was quite impressed.",
            "fix": "MAMMorey",
            "length": 174,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What was the name of Europe's most famous Jewish knight? Sir cumcised.",
            "fix": "cumcised",
            "length": 70,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "A frog walks into a bank: A frog is looking to open up a new business, so he stops by his local bank to see about financing. His loan officer, Mrs. Paddywhack, is going through his financials. \"Do you have any collateral?\" She asks. \"We can't give you any money without something to secure the loan.\" The frog pulls out a small figurine from his briefcase. \"This was my great-great-great grandfathers. It I s vary valuable and is in perfect condition; It has never left its place on my mantle until today.\" Mrs. Paddywhack looks it over and over. She knows it is valuable, but can't quite figure out what it is. \"I'll have to clear this with my boss,\" she says. She walks back to her bosses office, explains the whole situation and sets the figurine down on the desk. \"I just can't figure out what it is,\" she says. Her boss takes one look at it and says, \"It's a nick-knack, Paddywhack. Give the frog a loan.\"",
            "fix": "financials",
            "length": 922,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a baby deer's droppings? FawnDoo! Nailed it.",
            "fix": "FawnDoo",
            "length": 61,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A vampire walks into a bar: This vampire walks into a bar. Says ooOOOooOOOooo boogity boogity. Bar tender says, \"Alright, well what'll you have?\" Vampire sits down and says can I get a big glass of hot water? \"Bartender goes, gets a giant cup of boiling water and says.\" Here. I thought you guys needed blood or something like that though, why hot water? \"Vampire reaches into his coat pocket, pulls out this giant tampon and says.\" I'm making tea. \"",
            "fix": "boogity",
            "length": 457,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What so you call a bulldog mixed with a shih tzu? A bull shiht.",
            "fix": "shiht",
            "length": 63,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two friends join the SAS. Two friends, Pat and Mick, are trying to join the SAS. After doing all the training their commanding officer in charge tells them, \"Now you two must realise that you have to do anything your commanding officer says no question asked, so Mick go into that room there,\" so Mick walks in. The officer then says to Pat, \"Do you think you could kill a friend Pat?\" To which Pat replies, \"oh no I love all my friends.\" \"WHAT DID I JUST SAY PAT!\" \"Yes sir!\" Pat exclaims. The officer then says, \"Do you think you could kill Mick, Pat?\" \"Oh never sir Mick is like a brother to me I have kno...\" \"WHAT DID I JUST SAY!\" \"Oh right, yes sir.\" \"Well then take this gun, and walk into that room, where you shall kill Mick,\" so Pat goes in and 5 minutes later he goes back to his commanding officer and he says, \"I've done it sir.\" \"Well you'll be glad to know that gun was fake Pat and just call Mick back in.\" Pat then replies, \"I can't sir.\" \"Why?\" \"I strangled him.\"",
            "fix": "kno",
            "length": 1011,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A zoophil, a murderer, a necrophiliac, a pyromaniac and a sadomasochist were gathered at a party. After a while they started to get bored, and the zoophile suggested they go out to find a cat they could rape. The killer was enthusiastic and suggested they kill it afterwards. The necrophilic was happy and wanted to sleep with it after it was dead. The pyromaniac looks at the others with wide eyes and suggest they burn it afterwards. Everyone looks at the sadomasochist and asks him: So what do you have to contribute to this conversation? The sadomasochist: Mjaaauuu ...",
            "fix": "zoophil",
            "length": 573,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Little salamander: So this happy little salamander is taking a stroll through the woods one day, and all of a sudden gets a whiff of some weed. Smells like pretty good stuff too, so he decides to investigate... He follows his nose for a little and then looks up, there is a monkey up in a tree. This monkey is smoking a huge joint, the salamander yells, \"hey! Monkey! Smells like some good ass weed you got,\" the monkey looked down, startled.. And said, \"hell yeah! C'mon up man have a puff!\" So the salamander made his way up the tree, took a few fat rips and coughed his ass off. \"Monkey! That shit is the SHIT!\" The salamander exclaimed. \"But... I have dry mouth so bad now man! Sandpaper!\" So the monkey pointed to the left and said, \"go over that little hill and through the bushes. You'll find a nice cool stream to drink out of.\" So he made his way over the hill, and through the bushes down to the stream. He started drinking away with his eyes closed. After a satisfying drink, he opened his and eyes and WHOA! He was face to face with a big ass alligator. The alligator spoke before he could.. \"Salamander... Looks like you have been chiefing some fine ass weed! Where may I ask did you partake?\" \"Through those bushes and over the hill, there is a nice monkey in a tree. He will smoke you up!\" \"Thank you man,\" replied the alligator. And he started walking, through the bushes and over the hill. It took him a few minutes but he followed the smell and at last saw the monkey up in a tree. The monkey looked down and saw the alligator and said, \"FUUUUUCK DUDE! YOU MUSTVE BEEN REEEEEEEALY THIRSTY!\"",
            "fix": "chiefing",
            "length": 1626,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Who is this Rorschach guy? And why did he paint so many pictures of my parents fighting? -Rob DenBleyker.",
            "fix": "DenBleyker",
            "length": 105,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Chin nut: What do you call nuts on a wall? A wallnut What do you call nuts on a chest? A chestnut What do you call nuts on your chin? A blowjob.",
            "fix": "wallnut",
            "length": 144,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A Modern Islamic Couple are getting married.. A modern Islamic couple preparing for a religious wedding meet with their Mullah for counseling. The Mullah asks if they have any last questions before they leave. The man says, \"We realize it's tradition in Islam for men to dance with men, and women to dance with women. But, at our wedding reception, we'd like your permission to dance together.\" \"Absolutely not,\" says the Mullah. \"It's immoral. Men and women always dance separately.\" \"So, after the ceremony I can't even dance with my own wife?\" \"No,\" answers the Mullah. \"It ' s forbidden in Islam.\" \"Well, OK,\" says the man. \"What about sex? Can we finally have sex?\" \"Of course!\" Replies the Mullah. \"AlIa ho Akber! Sex is OK within a marriage to have children!\" \"What about different positions?\" Asks the man. \"AlIa ho Akber! No problem,\" says the Mullah. \"Woman on top?\" The man asks. \"Sure,\" says the Mullah. \"AlIa ho Akber. Go for it!\" \"Doggy style?\" \"Sure! AlIa ho Akber!\" \"On the kitchen table?\" \"Yes, yes! AlIaho Akber!\" \"Can I do it with all my four wives together on rubber sheets with a bottle of hot oil, a couple of vibrators, leather harnesses, a bucket of honey and a porno video?\" \"You may, indeed. AlIa ho Akber!\" \"Can we do it standing up?\" \"No,\" says the Mullah. \"Why not?\" Asks the man. \"Because that could lead to dancing.\"",
            "fix": "AlIaho",
            "length": 1397,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple with five kids had to be careful when trying to have sexy times. The codenamed it, \"doing the laundry.\" One day the husband was trying to get frisky, but the wife just had too much to do with the kids. Well she thought, he has been working a lot of overtime to pay for christmas and has been attentive to every other need that has come up. She calls her sister and makes plans for her to pick up one of the kids giving her some extra time that day. She walks up behind him and whispers, \"I have some time to help you out with that laundry.\" \"It's ok sweetie, it was a small load, I did it by hand.\"",
            "fix": "codenamed",
            "length": 613,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Wittle Wabbit: Little girl walks into a pet shop and asks in the sweetest little lisp: \"Excuthe me, mithter, do you keep wittle wabbits?\" And the shopkeeper gets down on his knees, so that he's on her level, and asks: \"Do you want a wittle white wabby or a soft and fuwwy bwack wabby or maybe one like that cute wittle bwown wabby over there?\" The little girl puts her hands on her knees, leans forward and says in a quiet voice: \"I don't fink my pyfon really giveths a thit.\"",
            "fix": "giveths",
            "length": 482,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "Baseball heaven? There were two old guys, Abe and Sol, sitting on a bench in a park feeding pigeons and talking about baseball, just like they did every day. Abe turns to Sol and says, \"Do you think there's baseball in heaven?\" Solomon thinks about it for a minute and replies, \"I dunno, Abe. But let's make a deal: If I die first, I will come back and tell you, and if you die first, you come back and tell me, if there is basebal l in heaven.\" They shake on it and, sadly, a few months later poor Abe passes on. One day soon afterward, Sol is sitting there feeding the pigeons by himself when he hears a voice whisper, \"Sol... Sol...\" Sol responds, \"Abe! Is that you?\" \"Yes it is Sol,\" whispers the spirit of Abe. Sol, still amazed, asks, \"So, is there baseball in heaven?\" \"Well,\" says Abe says, \"I got good news and I got bad news.\" \"Gimme the good news first,\" says Sol. Abe says, \"Well... There is baseball in heaven.\" Sol says, \"That's great! What news could be bad enough to ruin that!?\" Abe sighs and whispers, \"You're pitching on Friday.\"",
            "fix": "basebal",
            "length": 1072,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Mike Wazowski opens up a tattoo shop: Called Monsters Ink.",
            "fix": "Wazowski",
            "length": 58,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A woman with small breasts is fed up with her bust line: So she goes to a witch doctor. He does a ceremony where he tells her, \"everytime someone says I'm sorry to you your breast will grow.\" So she leaves and on her way out knocks into someone who says pardon me. She looks down and her breast double in size. So while walking down the street she turns the corner and knocks into someone else who says I'm sorry. She looks down again and the are huge. Too huge. So she starts rushing back to the witch doctor to get him to stop the spell. She bumps into an Asian man who says to her, \"Thousand Pardons.\" The next day the headline of the news paper read, \"Man killed by flying torpedos.\"",
            "fix": "everytime",
            "length": 693,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I'm part indian: My ancestors are from the slapahoe tribe.",
            "fix": "slapahoe",
            "length": 58,
            "source": "Reddit",
            "nsfw": true,
            "tags": []
        },
        {
            "joke": "A man's wife loves to go commando... When she's wearing a dress and one day she goes to the mall to get a new pair of shoes. The salesman helps her try on a few pairs and notices jer lackbof underwear. He says, \"Miss I could eat that pussy full of ice cream.\" She gets offended and storms home to complain to her husband and demands he go beat the shit out of the salesman. He says, \"No for 3 reasons. One you've got too damn many shoes already. Two you should have worn panties. And three... Any man who can eat that much ice cream is a man I will not fuck with.\"",
            "fix": "lackbof",
            "length": 568,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do a politician and a sperm have in common? One in thousnads has a chance to e a human being.",
            "fix": "thousnads",
            "length": 98,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy moves into a new neighborhood... And a redneck knocks on the door. The guy opens and the redneck says, \"howdy neighbor! Welcome to the neighborhood! Tonight I'm gona throw a party in your honor - there's gona be a whole lot of dancin, a whole lot of drinkin and a whole lot of screwin!\" The guy replies, \"sounds great! What should I bring?\" The redneck replies, \"wll - you can bring whatever you want, it's just gona be you and me.\"",
            "fix": "wll",
            "length": 444,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call an asian lounge singer? George Crooney.",
            "fix": "Crooney",
            "length": 56,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So a man dies and finds himself in hell. As he is sitting in the waiting lobby the devil walks up to him and they strike up a conversation. \"So what do you do here in Hell anyway?\" Says the man. \"Well do you like to smoke weed?\" Answers the devil, \"Fuck yes!\" \"You are gonna looove Mondays! We all gather together and smoke as much weed as we can handle!\" \"What else?\" \"Do you like to drink?\" Asks the devil. \"Of course!\" \"You are gonna loooove Tuesdays! We drink as much as we want with no risk of a hangover!\" \"Awesome! Hell doesn't sound half bad!\" \"And do you like to eat?\" Asked the devil. \"HELL YEAH!\" Replies the man. \"You are gonna loooooove Wednesdays! We always have a huge feast and you can eat all day without feeling sick!\" Says the devil. \"Alright!\" \"And are you a homosexual?\" \"Um.. No.\" \"You're gonna hate Thursdays.\"",
            "fix": "looove",
            "length": 865,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Do you love multiple trees?... No. I'm mahogamous.",
            "fix": "mahogamous",
            "length": 50,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you circumsize a redneck? Kick his sister in the jaw.",
            "fix": "circumsize",
            "length": 60,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a group of politically similar crows? A cawcus.",
            "fix": "cawcus",
            "length": 64,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a zoo enclosure without any change? A nickeless cage.",
            "fix": "nickeless",
            "length": 70,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two aliens sitting in a bar... The first looks at the second and says, \"bleep loop do dooee day baaarrggg.\" The second looks ask at the first a d says, \"shut up frank, you're drunk.\"",
            "fix": "dooee",
            "length": 186,
            "source": "Reddit",
            "nsfw": false,
            "tags": []
        }
    ]
}
