{
    "count": 745,
    "jokes": [
        {
            "joke": "Is it true that cannibals don't eat clowns because they taste funny?",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What kind of pig can you ignore at a party? A wild bore.",
            "length": 56,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What kind of murderer has fiber? A cereal killer.",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walking down the streets sees another man with a very big dog. One man says to the other, \"Does your dog bite?\" The man replies, \"No my dog doesn't.\" The man pats the dog and has his hand bitten off, \"I thought you said your dog didn't bite,\" said the injured man. \"That's not my dog,\" replied the other.",
            "length": 318,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a shopping trolley and a University vice chancellor? You fill them both up with as much food and alcohol you can, but it's only the shopping trolley that has a mind of its own.",
            "length": 206,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you catch a polar bear? You cut a hole in the ice and you put peas all round the edge and when the polar bear comes along and stops for a pea, you kick it in the ice hole.",
            "length": 178,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do Marxists like fruit infusions? Because all proper tea is theft!",
            "length": 70,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What was born to succeed? A budgie with a blunt beak.",
            "length": 53,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three budgies in a cage, one on the top perch, one on the middle and one on the bottom perch. Which Budgie owns the cage? The one on the bottom perch, the other two are on higher perches.",
            "length": 187,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a fly with no wings? A walk.",
            "length": 45,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a teacher with no arms, no legs, and no body? The Head...",
            "length": 74,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why should you never iron a four leaf clover? You should never press your luck!",
            "length": 79,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's ET short for? Because he's got little legs.",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An 8-year-old girl went to her dad, who was working in the yard. She asked him, \"Daddy, what is sex?\" The father was surprised that she would ask such a question, but decides that if she is old enough to ask the question, then she is old enough to get a straight answer. He proceeded to tell her all about the 'birds and the bees'. When he finished explaining, the little girl was looking at him with her mouth hanging open. The father asked her, \"Why did you ask this question?\" The little girl replied, \"Mom told me to tell you that dinner would be ready in just a couple of secs.\"",
            "length": 589,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What lies on the bottom of the ocean and shakes? A nervous wreck.",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two cannibals are sitting around eating a clown. One says to the other, \"Does this taste funny to you?\"",
            "length": 105,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A piece of straight, clean string goes into a bar and orders a gin and tonic. The barman serves the drink, the string downs it and walks out. Ten minutes later a dirty, twisted, ragged piece of string walks into the bar. \"Here, are you that piece of string that was here ten minutes ago?\" Asks the barman. \"No,\" replies the string, \"I'm a frayed knot.\"",
            "length": 358,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There are these two sausages sizzling in a frying pan. The one turns to the other and says, \"Gees, it's hot in here,\" and the second one turns around and goes, \"AAAAH!, A talking sausage.\"",
            "length": 192,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the grape say when the elephant trod on it? Nothing, it just gave a little wine.",
            "length": 89,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There were two cows in a field. One said, \"moo,\" the other one said, \"I was going to say that!\"",
            "length": 99,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A three legged dog walks into a Saloon in the Wild West, the barman asks him what he wants. The dog replies, \"I'm looking for the man that shot my paw.\"",
            "length": 154,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two owls are playing in the final of the Owl Pool Championship. It comes down to the last frame. One of the owls is just about to play his shot, when his wing accidentally touches a ball. \"That's two hits,\" says the other owl. \"Two hits to who?\" Says the first.",
            "length": 265,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An atom walks into a bar and asks the bartender if he's seen his missing electron. \"Are you sure she's missing,\" asks the bartender. \"I'm positive,\" replies the atom.",
            "length": 170,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two aerials met on a roof, fell in love and got married. The ceremony was rubbish but the reception was brilliant.",
            "length": 114,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a donkey with 3 legs? A Wonky.",
            "length": 47,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's brown and sticky? A stick.",
            "length": 33,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A horse walks into a bar. The bartender says: \"Why the long face?\"",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A Buddhist walks up to a hot dog vendor and says, \"Make me one with everything.\"",
            "length": 82,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A mushroom walks into a bar. The bartender says to the mushroom. \"Hey we don't serve your kind here.\" The mushroom says, \"Why not, I'm a fun guy.\"",
            "length": 150,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the mayonnaise say to the refrigerator? \"Close the door! Can't you see I'm dressing?\"",
            "length": 96,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a buffalo and a bison? You can't wash your hands in a buffalo.",
            "length": 92,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How long did Cain hate his brother? As long as he was able.",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A grad student, a post-doc, and a professor are walking through a city park and they find an antique oil lamp. They rub it and a Genie comes out in a puff of smoke. The Genie says, \"I usually only grant three wishes, so I'll give each of you just one.\" \"Me first! Me first!\" Says the grad student. \"I want to be in the Bahamas, driving a speedboat with a gorgeous woman who sunbathes topless.\" Poof! He's gone. \"Me next! Me next!\" Says the post-doc. \"I want to be in Hawaii, relaxing on the beach with a professional hula dancer on one side and a Mai Tai on the other.\" Poof! He's gone. \"You're next,\" the Genie says to the professor. The professor says, \"I want those guys back in the lab after lunch.\"",
            "length": 717,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A penguin walks into a store and asks the teller, \"Do you have any grapes?\" \"No.\" He replies. This same thing happens the next day. On the third day the teller replies, \"No, and if you come in asking for grapes again I will nail your flippers to the floor!\" On the next the penguin walks in and asks, \"Got any nails?\" \"No.\" Replies the teller. \"Got any grapes!\" The penguin asks!",
            "length": 391,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"I got that job down the bowling alley.\" \"What, tenpin?\" \"No it's permanent.\"",
            "length": 83,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes into the doctor with a penguin on his head. The doctor says, \"What can I do for you?\" And the penguin says, \"Well doc, it started as this growth on my foot...\"",
            "length": 174,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes to the doctor and says, \"Doctor, it hurts when I do this,\" and raises his arm. \"Well, don't do it then,\" says the doctor.",
            "length": 136,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the Ice Cream Salesman that was found dead in his store covered in chocolate sauce and syrup? Police think he topped himself!",
            "length": 144,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many surrealists does it take to change a light bulb? 2. One to hold the giraffe and one to fill the bathtub with brightly coloured machine tools.",
            "length": 150,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three vampires are sitting at a bar. Bartender asks the first one what he wants. \"I think I'll have a glass of blood.\" \"Okay, what'll you have?\" He asks the second vampire. \"That sounds good. I'll have a glass of blood too.\" \"And what can I get for you?\" He asks the third vampire. \"I'll have a glass of plasma,\" said the third vampire. \"Okay,\" said the bartender, \"That's two bloods and a blood light, then.\"",
            "length": 423,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A polar bear walks into a bar and the barman says, \"What would you like to drink?\" The polar bear hangs his head and sighs deeply and then says, \"I'll have a pint of bitter barman.\" The barman looks at the bear and says, \"Why the big paws?\"",
            "length": 246,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What does an agnostic, dyslexic, insomniac do? Stays up all night wondering if there is a Dog.",
            "length": 94,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes to the vet about his dog's fleas. The vet says, \"I'm sorry, I'll have to put this dog down.\" The man is incredulous and asks why, and the vet says, \"Because he is far too heavy.\"",
            "length": 193,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An Englishman, an Irishman and a scotsman walk into a bar, the barman asks, \"Is this a joke?\"",
            "length": 95,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy goes to the Doctors and he says, \"Doctor, I'm really worried about my brother, he thinks he's a Hen!\" The Doctor says, \"Well have you taken him to see a psychiatrist?\" And the guy says, \"Don't be stupid, we need the eggs!\"",
            "length": 234,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A group of Chess enthusiasts were kicked out of a hotel reception for discussing their winning games. The manager can't stand chess nuts boasting in an open foyer.",
            "length": 163,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A brain and a pair of jumpleads walks into a bar. The brain orders two pints from the barman but the barman refuses to serve him. When asked why, the barman replies, \"Well you're clearly out of your head, and your friend there looks as if he's about to start something.\"",
            "length": 272,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The police arrested two men, one for drinking battery acid and the other for eating firecrackers. They charged one and let the other one off.",
            "length": 141,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man went to a horse breeder and said, I want that horse. The breeder said that horse ain't looking so good, but the man still wanted to buy it, so he did. The next day he came back with the horse and said, you sold me a blind horse, the breeder replied I told you that horse ain't looking so good.",
            "length": 299,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two hikers were walking through the woods when they noticed a bear charging towards them in the distance. The first hiker removed his trail boots and began to lace up his running shoes. The second hiker laughed and said, \"Why bother changing out of your boots? You can't outrun a bear.\" The first hiker replied, \"I don't have to outrun the bear, I only have to outrun you.\"",
            "length": 377,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Before you criticize someone, walk a mile in their shoes. Then when you do criticize them, you'll be a mile away and have their shoes.",
            "length": 134,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man on a business trip is staying in a high-rise hotel with a bar on the top floor. After checking in and seeing his room, he decides to go upstairs. There's only one other patron in the bar. The businessman orders a drink and then watches in surprise as the other patron quickly eats an orange, chugs his beer, and jumps out the window. A minute later, the man returns. The businessman is shocked to see him again eat an orange, chug his beer and then jump out the window. When the man returns a third time, the businessman decides he can do this, too. He eats an orange, chugs his beer, then jumps out the window to his death. The bartender turns to the man and says, \"You know, Superman, you're a real jerk when you're drunk.\"",
            "length": 733,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many surrealists does it take to change a lightbulb? Two, one to do it, and another to hold the fish.",
            "length": 105,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "As a funeral train passes by a golf course, a golfer on one of the greens stops, stands at attention with hat held over his heart as the hearse goes by. Then he goes back to lining up his putt. His playing partner remarks how that was the nicest gesture he'd ever seen, to show such respect for the dead. The first golfer sinks his putt and says, \"Well, she was a good wife for sixteen years.\"",
            "length": 395,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A woman has twin boys and gives them up for adoption. One goes to a family in Egypt, and is named 'Amahl'. The other goes to a family in Spain and is named 'Juan'. Years later, Juan sends a picture of himself to his birth mom. Upon receiving the picture, she tells her husband that she wishes she also had a picture of Amahl. Her husband responds, \"But they are identical twins. If you've seen Juan, you've seen Amahl.\"",
            "length": 421,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a boomerang that doesn't come back? A stick.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Man walking down the street meets a friend who has a lobster tucked under his arm. \"Are you taking that lobster home to dinner?\" He asks. \"No,\" says friend, \"He's had his dinner and now I'm taking him to the pictures.\"",
            "length": 224,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man is sat at home watching TV when he hears a knock at the door. The man gets up and answers the door, to his astonishment there is a snail at the door. The snail says, \"Can I sell you some double glazing.\" To which the man replies, \"No,\" and kicks him down the street. Two weeks later there is another knock at the door. The man answers it and it is the snail again. The snail then say, \"What did you do that for then.\"",
            "length": 429,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Patient: \"Doctor, Doctor I think I'm a pair of curtains.\" Doctor: \"Pull yourself together man.\"",
            "length": 99,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Extra strong mint and Mars bar are having a drink in the pub. Extra strong mint says to Mars Bar, \"I'm the hardest mint in town me! No-one's harder than me!\" With that, the bar doors swing open and in walks a Halls mint. Mars bar turns around and extra strong mint is quivering under the table. Mars bar says, \"Hang on a minute, I thought you were the hardest mint in town?!\" Extra strong mint says, \"I might be hard, but he's menthol!\"",
            "length": 442,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do cows have bells? Because their horns don't work.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three American Indian women in the wild west are about to give birth. One is lying on a buffalo skin; One is lying on a moose skin; And one is lying on a hippopotamus skin. The first woman gives birth to a boy. The second gives birth to a girl. And the third gives birth to a boy and a girl. And this proves... The squaw of the hide of the hippopotamus is equal to the sum of the squaws of the other two hides!",
            "length": 410,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Guy walks into the doctor's with a strawberry growing out of his head. Doctor says 'I can give you some cream for that'.",
            "length": 120,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes to a diner. On the menu it says, \"Breakfast Served Anytime,\" so, when the waitress comes he orders French Toast during the Renaissance!",
            "length": 148,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What happens to Composers when they die. They decompose.",
            "length": 56,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Atoms were talking, 1 atom said to the other, \"Why are you crying?\" The atom replied, \"I've lost an electron.\" The first atom said, \"Are you sure?\" \"Yes,\" replied the other, \"I'm positive!\"",
            "length": 199,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A drunk driver is stopped for heading the wrong way on a one-way street. The police officer asked the driver, \"Didn't you see the arrows?\" The drink responds, \"Arrows, I couldn't even see the Indians.\"",
            "length": 205,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man took his dog to the vet. \"Sorry,\" said the vet, \"but your dog is dead.\" Distraught man asks the vet for a second opinion. The vet brings in the practice cat. Cat sniffs around. No response from dog. Vet says, \"Sorry, but your dog is dead.\" Man insists on a third opinion, so vet brings in the practice labrador. Practice dog sniffs around. No response from man's dog. Reluctantly the man accepts his dog is dead. On the way out, the receptionist gives him a bill for $1000. \"Good grief, what is this for?\" \"Well,\" said the receptionist, \"it's $100 for the vet, $300 for the catscan and $600 for the lab report.\"",
            "length": 629,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What game do you play with a wombat? Wom.",
            "length": 41,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a shop and says, \"I'd like to buy a wasp, please.\" The shopkeeper replies, \"I'm sorry, sir, we don't sell wasps.\" \"But,\" says the man, \"You have one in the window.\"",
            "length": 189,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A white horse walked into a pub and ordered a lager. The landlord put the drink on the bar and said, \"We've got a whisky named after you.\" The horse replied, \"What, Eric?\"",
            "length": 175,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "While robbing a home, a burglar hears someone say, \"Jesus is watching you.\" To his relief, he realizes it is just a parrot mimicking something it had heard. The burglar asks the parrot, \"What's your name?\" The parrot says, \"Moses.\" The burglar goes on to ask, \"What kind of a person names their parrot Moses?\" The parrot replies, \"The same kind of person that names his Rottweiler Jesus.\"",
            "length": 398,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many psychiatrists does it take to change a light bulb? Only one, but the light bulbs got to want to change.",
            "length": 112,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where can you find a Mozambique. On a mozam-bird!",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man gets knocked down by a truck. A guy says to him, \"Are you comfortable?\" He says I make a living!",
            "length": 104,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why does a chicken coop have 2 doors? Because if had 4 doors it would be a chicken sedan.",
            "length": 89,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where do you keep a baby ape? In an apricot.",
            "length": 44,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a cow in a paddock with only two right legs? Lean Beef.",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Kid, \"Mummy! Mummy! There is a man with a bill at the door.\" Mother, \"Don't be silly dear, it must be a duck with a hat on!\"",
            "length": 128,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A shipwreck survivor washes up on the beach of an island and is immediately surrounded by a group of native warriors. \"I'm done for,\" the man cries in despair. \"No you are not,\" comes a booming voice from the heavens. \"Listen carefully, and do exactly as I say. Grab the spear from the one who is beside you and shove it through the heart of the chief.\" The man does so, and the remainder of the band stare in disbelief. \"Now, what?\" The man asks the heavens. \"Now, you are done for.\"",
            "length": 494,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two caterpillars were crawling along a leaf when a butterfly flew past overhead. One caterpillar turned to the other one and said: \"You'll never get me up in one of those things!\"",
            "length": 181,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a chip and asks for fish and chips twice please. The man behind the counter says, \"I heard you the first time.\"",
            "length": 130,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I was in the waiting room of my doctor's office the other day when the doctor started yelling, \"Typhoid! Tetanus! Measles!\" I went up to the nurse and asked her what the hell was going on. She told me that the doctor liked to call the shots.",
            "length": 243,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is a tractor magic? Because it can go down a road and turn into a field!",
            "length": 76,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Sally, can you spell 'water' for me?\" The teacher asked. H I J K L M N 0 answered Sally promptly Her teacher look puzzled. \"That doesn't spell 'water'.\" \"Sure it does,\" said Sally. \"It's all the letters from H to O.\"",
            "length": 225,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a bar and notices two pieces of beef nailed to the ceiling. He asks the barman why they're there. \"It's a competition. If you can climb up there and get those bits of meat down you'll get free drinks all night. But if you try and fail then you'll have to buy a round for everyone in the pub. Do you fancy having a go?\" The man has a long, hard look at the ceiling before saying, \"No, I'll just have a pint thanks. The steaks are too high.\"",
            "length": 460,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Close your eyes. Dark isn't it?",
            "length": 31,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did Ludwig v. Beethoven kill his two ducks? They wouldn't stop saying, \"Bach bach,\" all the time..",
            "length": 104,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is green and if it were to fall from a tree would kill you? A snooker table.",
            "length": 81,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why don't polar bears eat penguins? Because they can't get the wrappers off.",
            "length": 76,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A skeleton walks into a pub and says, \"Pint of bitter and a mop.\"",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the bird say as it flew over ASDA? \"Cheap Cheap.\"",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "For a laugh three french soldiers put mustard in their ears from then on they were called the three mustardears!",
            "length": 112,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A blonde girl's husband buys her a mobile phone. She takes it out and he decides to test it out. He phones her and she answers it. \"It's very good,\" she says, \"But how did you know I was at the hairdressers?\"",
            "length": 212,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a bar and orders a pint. Then he hears little voices saying things like, \"Oooh, you look really nice,\" and, \"That haircut really suits you.\" He tells the barman about it who says, \"Just ignore it, it's the peanuts, they're complimentary.\"",
            "length": 261,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An aardvark walks into a bar and the bartender says why the long face.",
            "length": 70,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A worried man goes to see his priest. \"Father, I am worried. I think that my wife is trying to poison me.\" Said the priest: \"Hold on my son, let me talk to your wife and come back to see me tomorrow, then I shall be able to give you some advice.\" The following day the man aging came to his priest who tells him: \"Well my son, I have talked to your wife for nearly two hours. My advice to you is: Take the poison.\"",
            "length": 420,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the koala fall out of the tree? Because it was dead Why did the second koala fall out of the tree? Because it was holding on to the first koala. Why did the third koala fall out of the tree? Because he thought it was a game. Why did the little boy fall off his bike? Because he was hit by three koalas.",
            "length": 310,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A horse walks into a bar, the bartender turns and asks the horse what's with the long face.",
            "length": 91,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An Englishman, an Australian and an American walk into a bar. The barman asks them, \"Is this a joke?\"",
            "length": 103,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man put on a clean pair of socks every day of the week. By Friday he could hardly get his shoes on.",
            "length": 101,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many psychiatrists does it take to change a light bulb? Just one, but the light bulb really has to want to change.",
            "length": 118,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when you pour boiling water down a rabbit hole? Hot cross bunnies.",
            "length": 82,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the termite who walked into an all-wooden bar and asked, \"Is the bartender here?\"",
            "length": 102,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The doctor says to the patient, \"You're in excellent health, you'll live to be 90.\" The patient replies, \"But Doctor, I am 90!\" The doctor responds, \"Well, that's it, then.\"",
            "length": 179,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There are three wives who want to decide what to wear. First one says, my husband has black hair I will wear black dress. Second says my husband hair is grey and I will wear a grey dress and the third one gets worried and starts panicking. When asked she tells the other two that her husband is bald so she would have to wear nothing to the party.",
            "length": 347,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What will Postman Pat be called when he retires? Pat.",
            "length": 53,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the monkey fall out of the tree? He was dead.",
            "length": 53,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man took his Rottweiler to the vet and said to him, \"My dogs cross-eyed. Is there anything you can do for it?\" \"Well,\" said the vet, \"Let's have a look at him.\" So he picks the dog up by the ears and has a good look at its eyes. \"Well,\" Says the vet, \"I'm going to have to put him down.\" \"Just because he's cross-eyed?\" Said the man. \"No, because he's heavy,\" said the vet.",
            "length": 389,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "George Howard, the man famous for writing the Hokey Polky died last week. They had a horrible time at the funeral parlor, first they put his left leg in...",
            "length": 155,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man died and his wife phoned the newspaper to place an obituary. She called the obituary department and said, \"This is what I want to print: Bernie is dead.\" The man at the newspaper said, \"But for $25 you are allowed to print six words.\" The woman answered, \"Ok. Then print: Bernie is dead. Toyota for sale.\"",
            "length": 317,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Sadie's husband Jake has been slipping in and out of a coma for several months, yet his faithful wife stays by his bedside day and night. One night, Jake comes to and motions for her to come closer. He says, \"My Sadie, you have been with me through all the bad times. When I got fired, you were there to support me. When my business failed, you were there. When I got shot, you were by my side. When we lost the house, you gave me support. When my health started failing, you were still by my side. You know what, Sadie?\" \"What dear?\" She asked gently. \"I think you're bad luck.\"",
            "length": 585,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A little boy went up to his father and asked: \"Dad, where did all of my intelligence come from?\" The father replied: \"Well, son, you must have gotten it from your mother, 'cause I still have mine.\"",
            "length": 201,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A neutron walks into a bar, and says, \"Give me a beer.\" The bartender says, \"Hey! Neutron! For you, no charge!\"",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One morning, a girl says to her mum, \"Does God use our bathroom?\" Her mum replies, \"No dear, why do you ask?\" The little girl says, \"Well, every morning daddy says 'Oh God, are you still in there!'\"",
            "length": 204,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man driving into town spots a truck broken down on the side of the road. He stops to help. The truck driver says he is on his way to deliver some penguins to the zoo. The truck driver says, \"I'll give you some cash if you could take the penguins to the zoo for me.\" The man agrees. Later, when the truck is fixed, the truck driver drives into town and spots the man close to the zoo, walking with a row of penguins waddling behind him, away from the zoo. The truck driver stops and asks, \"What are you doing? I gave you money to take the penguins to the zoo?\" The man replies., \"I did, but we got change so we're going to the movies!\"",
            "length": 642,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where do sheep get their haircut? At the Bah-Bah-Shop.",
            "length": 54,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get if you cross frosty the snowman with count dracula? Frostbite.",
            "length": 78,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the two maggots who were fighting in dead Earnest?",
            "length": 69,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a woodpecker without a beak? A head banger.",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where do computers go on holiday? The big apple.",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you catch a unique rabbit? Unique up on it. How do you catch a tame rabbit? The tame way.",
            "length": 96,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the chicken cross the road? To get to the other side.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two sailors are eating biscuits together. One breaks a biscuit and two bugs, one large and one small, jump out and run across the table. The sailor asks his mate, \"Now, is it better to eat the big one or the small one?\" The other replied, \"The answer is simple: You must always choose the lesser of two weevils.\"",
            "length": 316,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the Buddhist say to the hot dog vendor? \"Make me one with everything.\"",
            "length": 81,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the 0 say to the 8? Nice belt!",
            "length": 39,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where would you find a tortoise with no legs? Wherever you left it.",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the squirrel fall out of the tree? It was dead. Why did the second squirrel fall out of the tree? It thought it was a game. Why did the tree fall over? It thought it was a squirrel!",
            "length": 189,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A sandwich walks into a bar and orders a beer and the barman says, \"I'm sorry, we don't serve food.\"",
            "length": 102,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's brown and sits on a piano bench? Beethoven's Last Movement.",
            "length": 66,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Bob is sitting in a bar next to a guy named Clark. Clark gets his usual and drains it he then turns to Bob and says, \"I bet you I can jump off the roof and float to the ground.\" Bob says, \"Okay go for it.\" So clark jumps and floats to the ground. So Bob orders what clark just had and tries to jump and float. So he jumps and SPLAT he hits the ground and dies. Clark walks back in the bar and the barkeep says, \"You know Superman you're really mean when your drunk!\"",
            "length": 472,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear that they dug up Beethoven's body last week? They found him decomposing.",
            "length": 85,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do an eagle and a lion have in common? They both have wings, except for the lion.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you get a pikachu onto a bus? You pokemon.",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the worker get fired from the orange juice factory? Because he couldn't concentrate.",
            "length": 92,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a man in a bush? Russell.",
            "length": 42,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a bar and says, \"Ouch that's hot.\" It was a BARbeque.",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There's a toilet on a hill. There is a man walking up the hill and a man walking down and a man in the toilet. What are their nationalities? The man going up is Russian and the man going down is Finishin and the man in the toilet is European.",
            "length": 242,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do Mexicans keep under the carpet? Underlay! Underlay! Underlay!",
            "length": 69,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Newspaper Headline: Man who commits suicide twice is sentenced to life in prison.",
            "length": 81,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is red and looks like a bucket? A Red bucket! What is blue and looks like a bucket A Red bucket in disguise!",
            "length": 113,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is gray? A melted penguin!",
            "length": 31,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the monkey fall out of the tree? It was dead. Why did the squirrel fall out of the tree? It was stapled to the monkey.",
            "length": 126,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man driving on a highway is pulled over by a police officer. The officer asks, \"Did you know your wife and children fell out of your car a kilometre back?\" A smile creeps onto the man's face and he exclaims, \"Thank God! I thought I was going deaf!\"",
            "length": 254,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where is a cemetery located in any town? In the Dead center of it!",
            "length": 66,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple of New Jersey hunters are out in the woods when one of them falls to the ground. He doesn't seem to be breathing, his eyes are rolled back in his head. The other guy whips out his cell phone and calls 911. He gasps to the operator, \"My friend is dead! What can I do?\" The operator, in a calm soothing voice says, \"Just take it easy. I can help. First, let's make sure he's dead.\" There is a silence, then a shot is heard. The guy's voice comes back on the line. He says, \"Ok, now what?\"",
            "length": 501,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a bar and says ouch!",
            "length": 37,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Baby polar bear asks its dad, \"Am I a black bear?\" \"No,\" says dad. \"Am I a grizzly bear?\" \"No, you're a polar bear. Go ask your mother, son.\" Baby polar bear asks its mum, \"Am I a brown bear, or a sun bear?\" \"No,\" says mum. \"Am I a black bear or a koala bear?\" \"No, you're a polar bear. Why do you ask, son?\" \"Because I am so cold...!\"",
            "length": 353,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A newly ordained priest is nervous about hearing confessions and asks an older priest to observe one of his sessions to give him some tips. After a few minutes of listening, the old priest suggests that they have a word. \"I've got a few suggestions,\" he says. \"Try folding your arms over your chest and rub your chin with one hand.\" The new priest tries this. \"Very good,\" says his senior. \"Now try saying things like 'I see', 'I understand', and 'Yes, go on.'\" The younger priest practises these sayings, too. \"Well done,\" says the older priest. \"Don't you think that's better than slapping your knee and saying, 'No way! What happened next?'\"",
            "length": 656,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Knock Knock. Who's there? An interrupting cow. An interrupt.. MOO!",
            "length": 66,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes to the doctor and complains that every time he touches his foot he feels excruciating pain. The doctor writes it down and asks if it hurts anywhere else. To demonstrate, the man also touches his shin and thigh and screams out with pain. Although the doctor examines that man, he can not diagnose the source of the pain and refers him to a specialist. A few weeks later the man returns and the doctor eagerly asks the man if the specialist found out what was wrong. Yes, said the man. He discovered my finger was broken!",
            "length": 530,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call an aardvark that has been beaten up? A vark.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the difference between a doctor and God? God doesn't think he is a doctor!",
            "length": 82,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the whale jump out of the water? To get to the other side.",
            "length": 66,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the English policeman say when he came home and found his wife in bed with three men? 'Ello. 'Ello. 'Ello!",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man is looking down from a plane as it flies over the Pacific Ocean. He turns to the lady next to him and asks: That island down there. Is it pronounced Hawaii or Havaii? The woman replies Havaii. The man says: Thank you. The woman replies: You're velcome!",
            "length": 258,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the 'possum cross the road? To get half-way across. Why did the chicken cross the road? To show the 'possum it could be done. Why did the anarchist monkey cross the road? He was stapled to the chicken. Why didn't the skeleton cross the road? No guts.",
            "length": 258,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a restaurant and growls at the maitre d, ', \"Do you serve crabs here?\" The maitre d' responds, \"We serve anyone. Have a seat sir.\"",
            "length": 151,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "In a 3rd grade class Johnny was asked if he knew what a cannibal was. He said to the teacher, \"No sir.\" \"Well, if you ate your parents what would you be?\" Johnny's teacher asked him and Johnny said, \"An orphan, sir.\"",
            "length": 222,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the rooster who stayed awake all night so that he could see where the sun went? It finally dawned on him.",
            "length": 124,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two guys walk into a bar. The third guy ducks.",
            "length": 46,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the new pirate movie rated? Arrrrrrrrrrr.",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The monks were busy in the monastery copying those beautiful illuminated manuscripts that they used to do when one young monk suggested that since they were copying copies perhaps it might be timely to examine the original to make sure that their copies were correct. The Abbot agreed and sent the monk down into the basement of the monastery to find and examine the original. The young monk was away for some time and finally the abbot went to find him. When he did he found him in tears and asked him what was wrong. Through his tears the monk blurted out, \"The word was celebrate!\"",
            "length": 586,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Learn the rules so you know how to break them properly.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I was getting forgetful so I went to the neighbors and asked the husband what is the name of your mental doctor that you have been bragging about. He asked me what flower has a long stem with thorns. I said a rose. He said thank you, thank you. Hey, Rose what is the name of my memory doctor.",
            "length": 292,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Never wrestle with a pig: You both get all dirty, and the pig likes it.",
            "length": 71,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I have seen the truth and it makes no sense.",
            "length": 44,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man ran into the house breathless and he said to his wife, \"Honey, you should be so proud of me, I just saved $1.50 by not taking the bus, but I chased it all the way home.\" The wife replied, \"You want a medal for that? You should have chased a cab and saved yourself 15!\"",
            "length": 278,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A duck walks into a pharmacy. He says, \"I'd like a chapstick.\" The pharmacist hands him the chapstick and asks, \"Will that be cash or charge?\" The duck replies, \"Just put it on my bill.\"",
            "length": 192,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There are two fish in a tank. The first fish says to the second fish: \"How the hell do we drive this thing?\"",
            "length": 110,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Helicopters can't really fly, they're just so ugly that the Earth immediately repels them.",
            "length": 90,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the maniac riding on the subways chopping peoples' arms off? The police caught him and charged him with armed robbery!",
            "length": 137,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A biology student had to write a computer program, but he had trouble to make it work. He asked his roommate, who was a computer science major, to look at his program and tell him where the error is. The computer guy looked through the code for some time, then glanced desperately at his friend and said: \"It's DNA.\"",
            "length": 318,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a cow with no legs? Ground beef.",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How can you tell the difference between a dead cat in the road or a dead lawyer in the road? The dead cat has tread marks.",
            "length": 122,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Well, you see, there are basically three kinds of people in the world. Those who can count and those that can't.",
            "length": 112,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Can you swim? Some times. What do you mean by, \"Some times?\" Only when I'm in the water.",
            "length": 90,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a psychiatrist's office dressed only in saran wrap. The psychologist takes one look at him and says, \"I can clearly see you're nuts.\"",
            "length": 152,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the monkey fall out of the tree? He was dead. Why did the second monkey fall out of the tree? He was stapled to the first monkey. Why did the third monkey fall out of the tree? Peer pressure.",
            "length": 199,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "First magician: \"Who was that lady I sawed with you last night?\" Second magician: \"That was no lady; That was my half-sister!\"",
            "length": 130,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why does a golfer bring two pairs of pants when he plays golf? Incase he gets a hole in one.",
            "length": 92,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's a good parting gift? A comb.",
            "length": 35,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Knock knock Who's there? Dishwasher Dishwasher who? Dish wash er way I spoke until I got my false teeth.",
            "length": 104,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you make a handkerchief dance? Put a little boogie in it.",
            "length": 64,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you hide an elephant in a cherry tree? You paint its toenails red!",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is read, white, and black all over? A used newspaper!",
            "length": 58,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the two antennae that got married? The wedding wasn't very good, but the reception was terrific!",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy takes his nasty dog for a walk every night and manages to beat up another dog every night. One night while walking his dog he comes upon this guy walking a yellow dog, he unleashes his nasty dog saying, \"Go get him boy,\" as he runs up to the yellow dog, the yellow dog grabs him by the neck, shakes him a couple of times, Flips him over and breaks his neck and the nasty dog is dead. The owner of the nasty dog says, \"Wow! That's the first time in two years that my dog has lost a fight, what kind of dog do you have?\" The other guy says, \"Before I cut off his tail and painted him yellow, he used to be an alligator.\"",
            "length": 630,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The man had gone to the dentist for his annual checkup. The dentist asked the man if he had been eating anything over the past few months that was not ordinarily in his diet. The man said, \"Why yes, I have as a matter of fact. My wife developed a new recipe for hollandaise sauce that is just terrific and I have been putting it on almost everything that I eat.\" \"Well,\" said the dentist, \"I'm afraid that the acid in the lemon juice used in the hollandaise sauce has started to corrode your dental plate. I'll have to make you a new plate. But this time, I'll make it out of chrome.\" \"Out of chrome!\" Exclaimed the man. \"Why would you do that?\" \"Because,\" said the dentist... \"As everyone knows, there's no plate like chrome for the hollandaise.\"",
            "length": 761,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why don't English rugby players get vaccinated before touring? They never catch anything.",
            "length": 89,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why can't two elephants go swimming at the same time? Because they only have one pair of trunks!",
            "length": 96,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many surrealists does it take to change a lightbulb? Fish.",
            "length": 62,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A length of Rope went into a bar, sat on a stool, and ordered a beer. The Bartender said, \"We don't serve Ropes here.\" Dismayed and disappointed, the Rope went out and then got an idea. He stopped a man and asked, \"Will you please tie a knot in me and separate my strands at both ends?\" The man obliged, and with this done, the Rope went back into the bar and again ordered a beer. The Bartender looked him over and said, \"Say, aren't you the same rope who was in here before?!\" \"No,\" was the reply, \"I'm a frayed knot.\"",
            "length": 530,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the ram jump over the cliff? He didn't see the ewe turn.",
            "length": 64,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do bees hum? Because they don't know the words.",
            "length": 51,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two not so bright people walking along one day. One says, \"Horse tracks!\" The other disagrees, \"Rabbit tracks I think,\" just before the train hit them!",
            "length": 155,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you read about the midget clairvoyant who escaped from jail? The headline said, \"Small medium at large.\"",
            "length": 110,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A penguin walks into a bar and asks the barman, \"Have you seen my brother?\" The barman replies, \"I dunno, what does he look like?\"",
            "length": 134,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There was a husband and his wife sitting next to a drunk in a bar. Suddenly the drunk stands up and yells, \"ATTENTION ALL,\" and farts loudly. The wife is extremely embarrassed, and the husband looks at the drunk and says, \"Excuse me, you just farted before my wife.\" The drunks replies, \"I'm sorry I didn't know it was her turn.\"",
            "length": 335,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the tomato turn red? He saw the salad dressing!",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a deer with no eyes? No idear.",
            "length": 47,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy walks into his psychiatrists office and says, \"Doc you got to help me. One night I dream I'm a tepee and the next night I dream that I am a wigwam.\" The doctor says, \"Relax, you're two tents.\"",
            "length": 202,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "From The Times: 'A young girl, who was blown out to sea on a set of inflatable teeth, was rescued by a man on an inflatable lobster. A coast-guard spokesman commented: \"This sort of thing is all too common these days.\"",
            "length": 220,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What has 2 legs and bleeds profusely? Half a cat.",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man wakes up in hospital. \"Doctor, Doctor, I can't feel my legs!\" \"I know,\" replies the doctor, \"We had to amputate your arms.\"",
            "length": 135,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One penguin says to another, \"You look like you're wearing a tux.\" The second penguin replies, \"Who says I'm not?\"",
            "length": 118,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do elephants put ketchup in their navels? So they can eat french fries while lying on their backs.",
            "length": 102,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "This chap lives alone and he was feeling a bit lonely, so he goes to the pet shop to get something to keep him company. The pet shop owner suggested an unusual pet, a talking millipede. \"Ok,\" thought the man, \"I'll give it a go...\" So he bought a millipede, took it home, and for lack of advance preparations, made it a temporary home in a cardboard box. That evening testing his new pet, he leaned over the closed box and said, \"I'm going to the pub for a drink, do you want to come too?\" He waited a few moments but there was no reply. He tried again, \"Hey, millipede, wanna come to the boozer with me?\" Again, no response. Disgusted by his gullible nature, he decided to give it one more try before returning the millipede to the pet shop. So he got real close to the box and repeated rather loudly, \"I SAID I'M GOING TO THE PUB FOR A DRINK. DO YOU WANNA COME?\" \"I heard you the first time!\" Snapped the millipede, \"I'm just putting my bloody shoes on...\"",
            "length": 972,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the farmer who won the Nobel Prize for being outstanding in his field?",
            "length": 89,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two drunks are sitting at a bar. The first one says, \"What's this thing that they call a 'Breathalyzer'?\" The second guy says, \"It's a bag that can tell how much you drank.\" The first guy says, \"I married one of those things years ago.\"",
            "length": 242,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There were three guys. They each were asked to name something green, pink and yellow. The first guy said, \"My shirt is green, my tie is pink and my pants are yellow.\" The second guy said, \"The grass is green, the sun is yellow and my door is pink.\" The third guy said, \"The phone goes 'green green', I pink it up and say 'yellow'\"",
            "length": 336,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a woman with one leg shorter than the other? Ilene. What do you call her if she's Japanese? Irene.",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's orange and sounds like a parrot? A carrot!",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A truck driver saw a priest hitchhiking. He thought he would do a good turn and pulled the truck over. \"No problem, Father! I'll give you a lift. Climb in the truck.\" The happy priest climbed into the passenger seat and the truck driver continued down the road. Suddenly the truck driver saw a lawyer walking down the road and instinctively he swerved to hit him. But he remembered there was a priest in the truck with him, so at the last minute he swerved back away, narrowly missing the lawyer. But even though he was sure he missed the lawyer he still heard a loud, \"THUMP.\" He glanced in his mirrors and when he didn't see anything, he turned to the priest and said, \"I'm sorry Father. I almost hit that lawyer.\" \"That's okay,\" replied the priest. \"I got him with the door!\"",
            "length": 788,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Craig David, Shaggy, and Britney Spears were stuck in an elevator when they smelled something like rotten eggs, Craig David said, \"I'm walkin' away,\" shaggy said, \"It wasn't me,\" and Britney Spears said, \"Oops I did it again.\"",
            "length": 232,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when you cross an elephant and a kangaroo? Big holes all over Australia!",
            "length": 88,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Who won the boxing match between the beaver and the hedgehog? The hedgehog, on points.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man was walking in the park when he came across a koala. He took it to the policeman and said, \"I've found this koala what should I do with him?\" The policeman said, \"Take him to the zoo.\" The next day the policeman was walking in the same park when he saw the same man with the same koala. He said, \"Didn't I tell you to take that koala to the zoo?\" \"Yes,\" the man answered, that's what I did and today I'm taking him to the movies.",
            "length": 443,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man finds a genie who says that it will grant him three wishes but that every politician in Australia would get double. The man says, \"Ok, I wish for $1 million.\" \"Granted,\" says the genie, \"But remember every politician in Australia will get double.\" The man says, \"Ok, now I wish for a Ferrari.\" \"Granted,\" says the genie, \"But remember every politician in Australia will get double. Your final wish?\" The man says, \"I wish to have one of my kidneys removed.\"",
            "length": 477,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's white, blue, and green? A fridge wearing jeans sitting in a field!",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's brown and sounds like a bell? Dung!",
            "length": 42,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is grey and goes bang, bang, bang, bang? A four-door elephant.",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call am italian with a rubber toe? Roberto.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do elephants have big ears? Noddy wouldn't pay the ransom.",
            "length": 62,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you stop a bear from charging? You take away its credit card.",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why didn't the skeleton cross the road? He didn't have the guts to do it!",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What time is it? Time you got a new watch.",
            "length": 42,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two elephants fall off a cliff. Thud. Thud.",
            "length": 43,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do ducks have flat feet? To stamp out forest fires!",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a child who fries and eats both his parents? An orphan.",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Newspaper Reports say a toilet has been stolen. Police say they have nothing to go on.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why has Edward Woodward got so many 'D's in his name? Because otherwise he'd be called Ewar Woowar.",
            "length": 99,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the scarecrow that won a Nobel prize? He was out, standing in his field.",
            "length": 91,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the golfer wear two pairs of trousers? In case he got a 'hole in one'!",
            "length": 78,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you get four elephants into a Mini? Two in the front, two in the back.",
            "length": 77,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a mushroom at a disco? A fun guy.",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two atoms are walking down the road. One says to the other, \"OH NO! I just dropped an electron!\" \"Are you sure?\" Asks his friend. \"Yes,\" he replies, \"I'm POSITIVE!\"",
            "length": 172,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A bunch of highland cows are standing in a field in Scotland. Which one's on holiday?... The one with the wee calf!",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Knock knock. Who's there? Buh. Buh who? Don't be sad.",
            "length": 53,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two pieces of tarmac go into a pub and boast to the barman about how hard they are, \"We're motorway us.\" Then another piece of tarmac enters and the first two hide under a table. \"What's wrong?\" Says the barman, \"I thought you were really hard?\" \"We are,\" they say, \"but he's a cycle path.\"",
            "length": 300,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A long time ago, there were 3 little bears... Now there's lots of them.",
            "length": 71,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is black and white and eats like a horse? A Zebra.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you kill a circus? Go for the juggler.",
            "length": 45,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you turn a duck into a soul singer? Stick it in the oven and wait till its Bill Withers.",
            "length": 95,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the Swedish factory worker get sacked? Because he always took stock home!",
            "length": 81,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There was a teddy bear who went to work on a building site. On his first day he went off for lunch and left his tools behind. When he came back he noticed that his pick was missing. When he told the foreman the foreman said, \"Didn't you know today's the day the teddy bears get their picks nicked!\"",
            "length": 300,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes to the doctor and says 'Doctor, there's a piece of lettuce sticking out of my bottom'. The doctor asks him to drop his trousers and examines him. The man asks 'Is it serious, doctor?' And the doctor replies 'I'm sorry to tell you but this is just the tip of the iceberg'.",
            "length": 282,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do u call thieves on a washing line? Knickers.",
            "length": 51,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the man who drowned in a bowl of muesli? He was pulled under by a strong currant!",
            "length": 100,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A young girl is walking along the river and comes across a religious gathering where the minister is baptizing members of his flock. The minister asks the girl if she has found Jesus. \"No,\" she says. Whereupon the minister pushes her underwater, pulls her back up, and repeats, \"Have you found Jesus?\" \"No,\" she says, and is dunked back in the water and again asked, \"Have you found Jesus?\" \"No!,\" She says in exasperation. \"Are you sure this is where he fell in?\"",
            "length": 476,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Shakespeare walks into a pub. The bloke behind the counter says, \"I'm not serving you mate, you're Bard.\"",
            "length": 107,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two parrots sitting on a perch. One says to the other, \"Can you smell fish?\"",
            "length": 78,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is 6 afraid of 7? Because 7 ate 9.",
            "length": 38,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's red and invisible? No tomatoes.",
            "length": 38,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Marge: \"Homer, you never listen to anything I say!\" Homer: \"Thank you. I would like an omelet.\"",
            "length": 99,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two cows are in a field. The first cow says, \"Hmm, I feel a little bit sick.\" The second cow replies, \"Shut up! Or you'll get us both killed!\"",
            "length": 146,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the sleepiest fish? A kipper.",
            "length": 37,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a cow that eats grass? A lawn moo-er.",
            "length": 54,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two robbers went to the gates of heaven, an angle said God there are two robbers at the gates, God said let them in so the angle went to let them in he came running in and said, \"They're gone, they're gone.\" \"Who the robbers?\" \"No, the gates!\"",
            "length": 249,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why don't anteaters get sick? Because they're full of antibodies.",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A Texan is bragging, as usual: \"You know,\" he says, \"I can get in my Cadillac at 7 a. M., Drive all day long and still be on my property.\" \"Yes,\" replies his listener, \"I had a car like that once.\"",
            "length": 205,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two sheep were standing on a hillside in Scotland, one looks up and says, \"Baaaaaaaaaa...\" The other says, \"Bloody hell, I was gonna say that!\"",
            "length": 147,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "When's the best time to have a tooth pulled? Tooth-Hurty.",
            "length": 57,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A dog walks into a bar and says to the bartender, \"Hey bartender, it's my birthday! How about a free drink?\" The bartender says, \"Sure pal, the toilet's down the hall.\"",
            "length": 172,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Sherlock Holmes and Dr Watson were going camping. They pitched their tent under the stars and went to sleep. Sometime in the middle of the night Holmes woke Watson up. \"Watson, look up at the stars, and tell me what you see.\" Watson said, \"I see millions and millions of stars.\" Homes: \"And from that you deduce?\" Watson: \"Well, if there are millions of stars, and in even a few of those have planets, its quite likely there are some planets like earth like earth out there. And if there are a few planets like earth out there, there might also be life.\" Holmes: \"Watson, you idiot, somebody stole our tent.\"",
            "length": 618,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the last thing a fish says when it hits a wall? Dam!",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the magic tractor? It was driving down a lane then it turned into a field!",
            "length": 93,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where do you find a dog with no legs? Wherever you left him.",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three guys walk into an office building, you think one of them would have noticed it was there.",
            "length": 95,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two peanuts walk into a bar. One was a salted.",
            "length": 46,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Apparently 1 in 5 people in the world are Chinese. And there are 5 people in my family, so it must be one of them. It's either my mum or dad, my older brother Colin or my younger brother Ho-Cha-Chu. But I think its Colin.",
            "length": 221,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a mushroom who buys you drinks all night? A real Fungi to be with.",
            "length": 83,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "You know, somebody actually complimented me on my driving the other day. They left a little note on my windscreen saying parking fine. So that was nice.",
            "length": 152,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the egg cross the road? To research its genealogy.",
            "length": 58,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the monk say when returning to his monastery after a trip around the world? The world is my cloister.",
            "length": 110,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's black and shiny and sails the seven seas? Binbag the sailor!",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What has more courage, a stump or a rock? A rock, because it's a little boulder.",
            "length": 80,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A neutron walks into a bar. He asks the bartender for a drink. When it's served, he asks how much it will be. \"For you,\" the bartender answers, \"no charge.\"",
            "length": 160,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "News Flash from Chicago: Man found face down in a bathtub full of milk and corn flakes with banana in rear! Police looking for cereal killer.",
            "length": 141,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two jelly babies walked into a bar with their friend the Hard Gum. When they went up to get drinks, some cough sweets went up to them and started hassling them. The jelly babies were a bit scared and went to the Hard Gum to ask for a bit of help. He replied, \"I'm not going anywhere near them, they're menthol!\"",
            "length": 313,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A turtle was walking down an alley in New York when he was mugged by a gang of snails. A police detective came to investigate and asked the turtle if he could explain what happened. The turtle looked at the detective with a confused look on his face and replied, \"I don't know, it all happened so fast.\"",
            "length": 305,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where does a King keep his armies? In his sleevies.",
            "length": 51,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A woman walked into a bar and ordered a double entendre, so the barman gave her one.",
            "length": 84,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where do horses go when they are injured or hurt? The Horsepital.",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "It's a hot day, and everyone is on the beach. And it's strange, because everyone has bought an ice-cream cone, and is feeding the sea-gulls with it; Two gulls to each person. So I went and bought an ice-cream, and straight away the gulls came down to steal it. So of course I chased them away, but they kept on coming, and then this old man wanders over in my direction. He's got an ice-cream, and two gulls eating it. And he says: \"You'll never stop them, so do what everyone else is doing: Relax, enjoy yourself, and let the gulls have the ice-cream...\" \"Why?\" I asked. \"Because,\" he said, \"that way you'll be chilling two birds with one cone.\"",
            "length": 654,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Rene Descarte walks into a bar. Bartender says, \"have a beer?\" Descarte says, \"I think... Not...\" And disappears.",
            "length": 117,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the mouse squeak? Because it needed oiling.",
            "length": 51,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when you cross an elephant with a rhino? Hellifino.",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Name two crustaceans. King Crustacean and Charring Crustacean.",
            "length": 62,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I've heard that cardiovascular exercise can prolong life. Is this true? Your heart is only good for so many beats, and that's it. Everything wears out eventually. Speeding up your heart will not make you live longer; That's like saying you can extend the life of your car by driving it faster. Want to live longer? Take a nap.",
            "length": 326,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two spiders were playing football in a saucer. One says to the other: \"I'm getting really bored with this.\" The other says: \"Don't worry, we're playing in the cup next week.\"",
            "length": 178,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why can't you milk a mouse? Because you can't get a bucket under it.",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "It's reported that a new kind of pillowcase has been invented, made out of corduroy. It's making headlines.",
            "length": 107,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "This guy is walking past a wooden fence. On the other side of the fence is an asylum. The inmates are all screaming at the tops of their lungs, \"Thirteen! Thirteen! THIRTEEN!\" The guy notices a small hole in the fence and his curiosity naturally gets the better of him. He takes a peek and a finger suddenly pops out and jabs him in the eye. He yells in pain as the inmates start shouting, \"Fourteen! Fourteen! FOURTEEN!\"",
            "length": 425,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the chicken cross the road? To get to the rooster on the other side.",
            "length": 76,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two Bears in an airing cupboard, which one is in the army? The one on the tank!",
            "length": 79,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A little boy mouse goes into a music shop and asks for a mouse-organ. The shopkeeper says: \"That's a coincidence, we had a little girl mouse in here yesterday, asking for the same thing.\" The mouse replies: \"That must have been our Monica.\"",
            "length": 244,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A doctor says to his patient, \"I have bad news and worse news.\" \"Oh dear, what's the bad news?\" Asks the patient. The doctor replies, \"You only have 24 hours to live.\" \"That's terrible,\" said the patient. \"How can the news possibly be worse?\" The doctor replies, \"I've been trying to contact you since yesterday.\"",
            "length": 325,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two hunters were walking through the woods. Suddenly, a naked lady stepped out of the brush and said, \"I'm game!\" So they shot her.",
            "length": 133,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"My wife's gone to the West Indies.\" \"Jamaica?\" \"No she went of her own accord.\"",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you keep your nose from running? Teach it to walk!",
            "length": 57,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What can you eat in a Cyber Cafe? Micro Chips.",
            "length": 46,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A young karate champion joined the Army. The first time he saluted, he killed himself.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If I had a pet newt I would call him, \"Tiny,\" because he'd be my newt.",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If corn oil comes from corn, where does baby oil come from?",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A piece of string walks into a bar one day and asks for a beer. The bartender says, \"I'm sorry but we don't serve string in this bar.\" The piece of string walks out and returns the next day asking for a beer. No luck. The bartender turns him away again, \"Sorry but we don't serve string in this bar.\" The next day the piece of string returns to the bar, but before entering, he ties a knot in himself and messes up his hair. He enters the bar and asks for a beer. \"Aren't you a piece of string?\" The bartender asks. \"No,\" he replies, \"I'm a frayed knot.\"",
            "length": 564,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do gorillas have big nostrils? Because they have big fingers!",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Doctor, Doctor. I've got a strawberry stuck up my bum.\" \"I've got some cream for that.\"",
            "length": 92,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How much does a pirate pay to have his ear pierced? A Buccaneer.",
            "length": 64,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A drunk was standing on a London Street corner shouting, \"It can't be done! It can't be done!\" Just then, a Bobby approached him and said: \"What can't be done?\" The drunk answered, \"Look, up there on that sign, it says 'DRINK CANADA DRY.' It just can't be done. It's too Bloody big!\"",
            "length": 289,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A mother and daughter go out looking for Barbie Dolls, but can't find any prices in the shop, so they ask an assistant to help. \"This is Single Barbie, she cost $20, and this is Married Barbie, she costs $40, and this one is Divorced Barbie, she costs $250,\" says the assistant. \"Why so much for the Divorced Barbie?\" Ask the mother. \"Well, with the Divorced Barbie,\" says the assistant, \"You get the House, the Car, the Children.\"",
            "length": 439,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the new restaurant on the moon? I hear the food is great, but the atmosphere is lousy.",
            "length": 105,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A newly married man asks his wife, \"Would you have married me if my father hadn't left me a fortune?\" \"Darling,\" the woman replied sweetly, \"I'd have married you no matter who left a you a fortune.\"",
            "length": 204,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Mahatma Gandhi, as you know, walked barefoot most of the time, which produced an impressive set of calluses on his feet. He also ate very little, which made him rather frail and with his odd diet, he suffered from bad breath. This made him what? A super calloused fragile mystic plagued with halitosis.",
            "length": 302,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two shepherds lean on their crooks at the end of a long day and the first asks the second, \"So, how's it going?\" The second one sighed and shook his head, \"Not good, I can't pay my bills, my health isn't good, my kids don't respect me, and my wife is leaving me.\" The first replied, \"Well, don't lose any sheep over it.\"",
            "length": 326,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "James wanted to start a new hobby, and he decides he's going to learn a new flying sport. So he invites his friends to come and watch. He takes them to the top of a cliff, and produces three bird cages: One containing a budgerigar, the second containing a chicken, and the third a parrot. \"What *are* you up to?\" Asked one of his friends. \"Well,\" said James, \"I couldn't decide between budgie-jumping, hen-gliding or parrot- shooting... So I thought I'd try all three.\"",
            "length": 475,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "World's best oxymoron: Windows Operating System.",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Little Johnny watched, fascinated, as his mother gently rubbed cold cream on her face. \"Why are you rubbing cold cream on your face, mommy?\" He asked. \"To make myself beautiful,\" said his mother. A few minutes later, she began removing the cream with a tissue. \"What's the matter?\" Asked Little Johnny. \"Giving up?\"",
            "length": 323,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man in a hurry taking his 8-year-old son to school, made a turn at a red light where it was prohibited. \"Uh-oh, I think I just made an illegal turn!\" The man said. \"It's okay, Dad,\" the boy said. \"The police car right behind us did the same thing.\"",
            "length": 256,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the new Barbie Doll they are making? It's called, \"Divorced Barbie.\" She comes with all of Ken's things.",
            "length": 125,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three men walk into a bar. The fourth one ducks.",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Some tourists in the Chicago Museum of Natural History were marveling at the dinosaur bones. One of them asked the guard, \"Can you tell me how old the dinosaur bones are?\" The guard replied, \"They are 3 million, four years, and six months old.\" \"That's an awfully exact number,\" says the tourist. \"How do you know their age so precisely?\" The guard answered, \"Well, the dinosaur bones were three million years old when I started working here, and that was four and a half years ago.\"",
            "length": 493,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two nuns walked into a building, you would have thought they would have seen it!",
            "length": 80,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One day little Johnny was in his backyard digging a hole. His neighbor, seeing him there, decided to investigate. \"Whatcha doin?\" He asked. \"My goldfish died and I'm burying him,\" Johnny replied. \"That's an awful big hole for a goldfish, ain't it?\" Asked the neighbor. \"That's because he's inside your cat!\"",
            "length": 315,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear what happened to the hyena who swallowed an Oxo cube? He became a laughing stock ...",
            "length": 97,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Went to the doctor and he told me I would have to take a pill every day for the rest of my life. He only gave me 4?",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Give me a sentence about a public servant,\" said a teacher. The small boy wrote: \"The fireman came down the ladder pregnant.\" The teacher took the lad aside to correct him. \"Don't you know what pregnant means?\" She asked. \"Sure,\" said the young student confidently. \"It means carrying a child.\"",
            "length": 305,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "My wife and I were happy for 20 years. Then we met...",
            "length": 53,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A neurotic is a man who builds a castle in the air. A psychotic is one who lives in it. A psychiatrist is the one who collects the rent!",
            "length": 136,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the Invisible Man that married the Invisible Woman? Yeah, their kids aren't much to look at either.",
            "length": 118,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So these vultures decide to fly to Florida on an airline. They got on board carrying six dead raccoons and the flight attendant says, \"I'm sorry, but there's a limit of two carrion per passenger.\"",
            "length": 198,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you keep an idiot in suspense? I will tell you later.",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Are you a lawyer?\" \"Yes.\" \"How much do you charge?\" \"A hundred dollars for four questions.\" \"Isn't that awfully expensive?\" \"Yes. What is your fourth question?\"",
            "length": 173,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An eskimo husband and wife in an igloo. They hear, \"thump thump thump thump,\" on the roof. The wife turns to the husband and says, \"What's that noise?\" He looks out the window and says, \"Don't worry love, it's only rain dear.\"",
            "length": 232,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is one side of a, \"V,\" of geese always longer? Because there are more geese on that side.",
            "length": 95,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why don't cannibals like clowns? Because they taste funny!",
            "length": 58,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do cannibals like missionaries? Because they give them a taste of christianity!",
            "length": 83,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a musician whose girlfriend has dumped him? Homeless.",
            "length": 70,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy walks into a bar with a piece of tarmac and said to the bartender, \"Give me one, and one more for the road.\"",
            "length": 116,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A boy was walking down the street when he was stopped by a man holding a sofa. The man said to the boy, \"Here you go you can have this sofa for nothing, I don't need it anymore.\" The boy thanked him and took the sofa home to his dad. When he arrived home his dad went mad, the boy said to him, \"Dad, I thought you would be pleased.\" His dad replied, \"No son, what have I told you about taking suites off strangers!\"",
            "length": 421,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walked into a bar and the barman said to him, \"Hello, do you want a drink?\" \"Yes please,\" replied the man. The barman then gave him a drink and waited for his money but the man didn't pay the barman argued with him and said, \"That's $3.00 please.\" But the man replied, \"No you asked me if I wanted a drink not if I wanted to buy one.\" A lawyer sitting in the corner agreed so the barman let him off and banned him from the pub. The next day the man went back to the pub and the barman said, \"Oi aren't you the man I barred yesterday?\" \"No,\" replied the man. \"Oh,\" said the barman. \"You must have a double.\" \"Yes please,\" said the man, \"I'll have a malt whiskey.\"",
            "length": 688,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"My dog has no nose.\" \"Then how does it smell?\" \"Bad.\"",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is red and stands in the corner? A naughty strawberry.",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A group of 99 ostriches is standing around with their heads buried in the sand, an ostrich runs up to join the group, looks around and says, \"Hey! Where did everyone go?\"",
            "length": 172,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There were three tomatoes walking down a street. The daddy tomato and the mammy tomato were way ahead of the baby tomato. The daddy tomato got so annoyed at the baby tomato for being so slow that he turned around real quickly and smacked his hands together and roared, \"KETCHUP!\"",
            "length": 281,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A grasshopper walks into a bar. The bartender says, \"Hey! We've got a drink named after you!\" The grasshopper says, \"You have a drink named Murray?!\"",
            "length": 153,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man buys two monkeys. Those monkeys multiply and soon he's got 10 monkeys. The city gets wind of it and threatens heavy fines if he doesn't get rid of the monkeys. So the man calls his cousin Pedro and offers him $50.00 to take the monkeys to the zoo. A couple of hours pass, Pedro calls and asks for fifty MORE dollars! The man says, \"Listen, I just gave you $50.00 to take them to the zoo.\" Pedro says, \"Yes, but now they want to go to the movies!\"",
            "length": 456,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy is driving down the motorway, knitting. Obviously this is dangerous driving as the driver has no hands on the wheel, so before long the police are catching up with him. One police car drives up alongside the offending vehicle, and motions for him to open his window. \"Pull over!\" The policeman shouts across. \"No, pair of socks!\"",
            "length": 339,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Who is a penguin's favourite relative. His Aunt Arctica!",
            "length": 56,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why was there a fish in the piano? Because it was a piano tuna.",
            "length": 63,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get if you cross a bird a car and a dog? A flying carpet.",
            "length": 69,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is white and walks through the desert? A herd of yoghurt.",
            "length": 62,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a tennis ball and the Prince of Wales? One is thrown to the air and the other is heir to the throne.",
            "length": 130,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the fly do an old-fashioned dance on the jam jar? Because it said 'twist to open'.",
            "length": 90,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get if you cross a snowman with a vampire? Frostbite!",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A square and a circle walk into a bar. The square says to the circle, \"Your round!\"",
            "length": 85,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A linguistics professor was lecturing to his class. \"In English,\" he said, \"a double negative forms a positive. In some languages, though, such as Russian, a double negative is still a negative. However, there is no language wherein a double positive can form a negative.\" A voice from the back of the room piped up, \"Yeah, right.\"",
            "length": 337,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There's a sausage and an egg in a frying pan. The sausage turns to the egg and says: \"Gosh egg, it's really hot in here, isn't it?\" The egg turns to the sausage and says: \"Oh my god! A talking sausage!\"",
            "length": 206,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy phones the local hospital and yells, \"You've gotta send help! My wife's in labour!\" The nurse says, \"Calm down. Is this her first child?\" He replies, \"No! This is her husband!\"",
            "length": 188,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the policeman say to his belly? You're under a vest!",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the chicken cross the playground? To get to the other slide.",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do deep sea divers jump out of the boat backwards when they want to go into the water? Because if they jumped forward, they would fall into the boat.",
            "length": 153,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you tell a mathematician on a Saturday night? Don't drink and derive.",
            "length": 77,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A mother in Law sent two ties to her son-in-law. Some weeks later, she was invited for lunch, and so he wore one of them in the hope of pleasing her. The meal was a tense and uncomfortable one, with the Mother in Law maintaining a stony silence. Finally she spoke. \"Alright, what's wrong with the other tie.\"",
            "length": 310,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the orange say to the banana on the street corner? \"Hi.\"",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A family of tortoises went into a cafe for some ice cream. They sat down and were about to start when father tortoise said, \"I think its going to rain, Junior, will you pop home and fetch my umbrella?\" So off went Junior for father's umbrella, but three days later he still hadn't returned. \"I think, dear,\" said mother tortoise to father tortoise, \"That we had better eat Juniors ice cream before it melts.\" And a voice from the door said, \"If you do that I won't go.\"",
            "length": 477,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did Batman say to Robin before they got in the car? Robin, get in the car.",
            "length": 79,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you catch a rhino wearing a wool-hat? You kick it's back. Then let the rhino chase you around a lake until the rhino is hot and takes off the hat. Now you can catch it like a normal rhino.",
            "length": 195,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There was a knock on the door in the early hours. The man went downstairs, opened the door, and a voice said, \"Will you give us a push, mate?\" The man was very angry, saying that this was a ridiculous hour to be knocking people up, shut the door, and went back upstairs. When his wife asked who it was, he told her some nutter wanting a push. She said, \"You shouldn't have refused him; Don't you remember when we broke down and were glad of a push?\" So he went downstairs again, opened the door, and said, \"Ok, mate, where are you?\" And a voice said, \"Over here on the swings.\"",
            "length": 585,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is a tree better than a guard dog? It has more bark!",
            "length": 56,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two ducks were sitting in a pond, one of the ducks said, \"Quack.\" The other duck said, \"I was going to say that!\"",
            "length": 117,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's black and white and black and white and black and white? A Penguin rolling down a hill. What's black and white and laughing? The Penguin that pushed him.",
            "length": 160,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the small rug say to the large rug? Cover me I'm cold.",
            "length": 63,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An old lady knocks down a cat as she drives along the main street. A police man comes along as she drives off. He calls, \"Hey you can't leave that lying there.\" She calls back, \"That's not a lion it's a cat.\"",
            "length": 212,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do telephones get married? They just give each other a ring.",
            "length": 64,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An engineer, a physicist, and a mathematician are on a train in Scotland. The engineer looks out the window and sees a black sheep. He comments, \"Look, they have black sheep in Scotland.\" Then physicist looks and comments, \"From this observation, we can only say there is at least one black sheep in Scotland.\" The mathematician then looks and comments, \"Actually, from this we can only say there is at least one sheep in Scotland that's black on one side.\"",
            "length": 463,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What happened to the car mechanic that fell asleep dreaming about cars? He woke up exhausted.",
            "length": 93,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do birds sing and hummingbirds hum? Hummingbirds don't know the words.",
            "length": 74,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A businessman is hurrying home on the motorway after a hard days work when he was stopped by a policeman. \"Do you know you were driving 30 miles over the limit?\" Asks the policeman. \"Eh, actually no, officer, it's a big car and it just sort of coasts along, you know.\" \"And what were you planning on doing if you met Mr Fog?\" Demands the policeman. \"Well,\" says the businessman, thinking it best to play along, \"I suppose I'd ease off on Mr accelerator, and switch on Mr headlights and Mr windscreen wipers.\" The policeman leans in the window and eyeballs the businessman. \"I asked you what you were planning on doing if you met MIST OR FOG!\"",
            "length": 654,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"You're a high-priced lawyer! If I give you $500, will you answer two questions for me?\" \"Absolutely! What's the second question?\"",
            "length": 134,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Johnny why are you late for class?\" \"Well I was on my way to school and I was almost here but then I crossed a sign saying SLOW so I had to go really slow and that's what took me so long.\"",
            "length": 193,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's green and sings? Elvis Parsley.",
            "length": 38,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get if you cross a mammal with a reptile? A Nobel prize.",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What has four wheels and flies? A garbage truck.",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a trampoline and a bagpipe? Eventually you get tired of jumping on a trampoline.",
            "length": 110,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A mechanic, an engineer and a computer scientist are travelling together in a car, when the motor suddenly fails. The mechanic and engineer each try various techniques to restart the car... \"Pump the accelerator a couple of times,\" says the mechanic. \"No,\" replies the engineer, \"turn the ignition key without touching the pedal...\" The car refuses to start. After the failure of several more attempts, the computer scientist confidently announced his solution. \"Let's all get out of the car, then get back in.\"",
            "length": 519,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Police were called to a Pizza Hut in Leeds at the weekend after the body of a worker was found covered in mushrooms, onions, ham and cheese. A police spokesman said that the cause of death had not been established, but there was a strong possibility that the man had topped himself.",
            "length": 282,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man is driving down the road when he gets pulled over by a copper. The copper draws a circle on the floor and asks the man to stand in it. While the man stands in the circle, the copper gets out a hammer and smashes the cars headlights. The copper turns around and sees the man laughing! So the copper goes and smashes each of the cars windows. The copper turns around again and sees the man laughing even harder! The frustrated copper then shouts to the man, \"What the hell do you find so funny?\" The man replies, \"Every time you turned around, I've been jumping in and out of this circle!\"",
            "length": 597,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A little babymouse is walking hand in hand together with her mother. Suddenly a bat comes flying in the air. The little mouse points at the bat saying: \"Look Mammi, an angel.\"",
            "length": 177,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a princess who worries all the time? A warrior princess.",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the Buddhist monk who refused to have his mouth frozen when he went to the dentist? He wanted to transcend dental medication.",
            "length": 144,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man had a dog called Minton. One day Minton ate two shuttlecocks. When the owner found out he said bad Minton!",
            "length": 112,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy takes a trip for a short holiday. His wife is on a business trip that is ending the next day and she plans to fly down and meet him. When he arrives at his hotel he sends her a quick message. Unable to find the piece of paper on which he wrote her company e-mail address, he does his best from memory. Unfortunately, he doesn't get it exactly right and the message is routed instead to someone whose husband recently passed away. When the grieving widow opens her e-mail, she takes one look at her monitor, screams and faints. The message on the computer screen read: My darling wife... Just checked in, everything is prepared for your arrival tomorrow. Looking forward to us being together again. Your loving husband. PS It sure is hot down here.",
            "length": 753,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy walks up to the receptionist in the Psychiatrist's office and says, \"I'm the Invisible man and I'd like to talk to the Doctor.\" She pokes her head into the Psychiatrist's office and says there is a man here who wants to talk to you and he claims he's the Invisible man. The Psychiatrist replies, \"Tell him I can't see him right now.\"",
            "length": 343,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's black, white, blue, and purple all over? A zebra with a bruise!",
            "length": 70,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An unemployed jester is nobody's fool.",
            "length": 38,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Was that wig expensive? How much did you have toupee for it?",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a Swiss Financier on the Paris Underground? A metronome.",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the chicken cross the road? To show the possum that it could be done.",
            "length": 77,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two men are hired to do a job in a building. After the owner explains everything, he leaves. When he returns a while later, he sees one man working diligently and the other man hanging on the ceiling, singing: \"I'm a chandelier, I'm a chandelier.\" The owner orders him to come down and get back to work. A while later the owner returns to find the one working diligently and the other back on the ceiling, singing: \"I'm a chandelier, I'm a chandelier,\" again. \"That's it,\" the owner replies, \"You are fired.\" Then the owner notices that the man who had been working all the time was packing up all his things also. \"You're not fired, just him,\" the owner says. The man replies, \"Are you kidding? I can't work without any light!\"",
            "length": 740,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A group of dentists decided to set up a new surgery. Since competition in their area was quite fierce, they wanted their new business to have something unique about it. After much thought, they decided to set up shop on board a boat, moored on the banks of the river. As an added bonus, they also offered river crossings in the boat, with the dentistry work being performed during the crossing. The business quickly became known as the Tooth Ferry.",
            "length": 448,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A group of astronauts are on the moon. They've been mining the surface, and have discovered that it really is made of cheese. One particular area of cheese that they're quite interested in is a large vein of brie, and they've already been there twice, and collected samples to be returned to mission control. All of a sudden, the radio crackles into life: \"Mission control to cheese-base-one, we need you to get a third load of that brie!\" But the astronauts are unhappy with the idea. They try to come up with all sorts of excuses why they shouldn't dig any more... \"It'll spoil the environment if we take too much. We don't want to leave this place looking bad... After all, have you ever seen such a site in your life as brie mined thrice?\"",
            "length": 747,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Once a village bum went on an airplane for the first time. After some turbulence the village bum asked the man sitting next to him to open the window so he can throw up. The man told him the window cannot be opened so the village bum started beating up the man. Soon a flight attendant came and asked him the reason for his behaviour. After listening to his complaint the flight attendant told him about the barf bag. After a while the flight attendant came and saw all the passengers barfing. Since the village bum was the only one not throwing up the flight attendant asked him what had happened. To this the village bum replied that as he was throwing up everyone stared at him so being embarrassed he drank it back.",
            "length": 719,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a woman who can balance 4 pints of beer on her head? Beatrix.",
            "length": 78,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why are seagulls called seagulls? Because if they flew over the bay, they'd be bagels.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the snail say while riding on the turtle's back? WHEEEE!",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Early one morning a gentleman was doing his push up exercises in central park when a drunk came along and tapped him on the shoulder and said, \"Say mister, I think your girlfriends gone home.\"",
            "length": 194,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I had a dream that I was a muffler last night. I woke up exhausted.",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why can't an Engineer tell a joke? Timing.",
            "length": 42,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why didn't the teddy bear finish its dinner? It was stuffed.",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An American, an Australian and a Japanese man become stranded on a tropical island. The American decides to take charge and says. \"I'll be in charge of engineering.\" He then looks at the Australian and says, \"You can be in charge of building,\" and finally looks at the Japanese man and says, \"You're in charge of the supplies.\" They all wander off into the jungle and all except the Japanese man returned a few hours later. Months go by and the Australian and American have made do without the Japanese man and have built a rigid bamboo hut. Finally, on the horizon a Navy helicopter appears and lands of the beach, the Australian and American joyfully run up to it. Suddenly, the Japanese man jumps out from behind a palm tree and screams, \"SUPPLIES!\"",
            "length": 760,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do elephants drink? To try and forget.",
            "length": 42,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A black man walks into a store with a parrot on his shoulder. The clerk asks where he got him from. The parrot said, \"Africa, there is a whole bunch of them down there.\"",
            "length": 171,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do nuns boil water? They boil the hell out of it.",
            "length": 53,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A male ostrich was chasing two female ostriches. The one female said to the other, \"He's starting to gain on us, we better hide!\" So, they stopped and stuck their heads in the sand. The male ostrich said, \"Hey, where'd they go?\"",
            "length": 232,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "When NASA first started sending up astronauts, they quickly discovered that ballpoint pens would not work in zero gravity. To combat the problem, NASA scientists spent a decade and $12 billion to develop a pen that writes in zero gravity, upside down, underwater, on almost any surface including glass and at temperatures ranging from below freezing to 300C. The Russians used a pencil.",
            "length": 386,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A fish walks into a bar and the bartender says what will it be. The fish replies, water!",
            "length": 88,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A depressed horse walks into a bar. The barman asks him, \"Why the long face?\"",
            "length": 79,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the male volcano say to the female volcano? Do you lava me like I lava you!",
            "length": 84,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A new teacher was trying to make use of her psychology courses. She started her class by saying, \"Everyone who thinks they're stupid, stand up!\" After a few seconds, Little Johnny stood up. The teacher said, \"Do you think you're stupid, Little Johnny?\" Little Johnny replied, \"No, ma'am, but I hate to see you standing there all by yourself.\"",
            "length": 348,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the football coach go to the bank? To get his quarterback!",
            "length": 66,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the ship that ran aground carrying a cargo of red paint and black paint? The whole crew was marooned.",
            "length": 120,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many surrealists does it take to change a light bulb? To get to the other side.",
            "length": 83,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why didn't the Clam share his candy? Because he was Shellfish.",
            "length": 62,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the difference between ignorance, apathy, and ambivalence? I don't know and I don't care one way or the other.",
            "length": 118,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A Philosopher and scientist were being chased by a lion. The Scientist looked back and made a swift calculation. Puffing, he said to the philosopher, \"We can't outrun it you know.\" The Philosopher was slightly ahead, he replied, \"I am not trying to outrun the lion, I am trying to outrun you!\"",
            "length": 297,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Charles Dickens walks into a bar and orders a Martini. Bartender asks, \"Olive or Twist?\"",
            "length": 90,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why can't dalmations play hide and seek? Because they are always spotted.",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An inebriate enters a restaurant and asks the cashier, \"Did you see me come in the door, there?\" \"Yes I did, sir.\" \"Have you ever seen me before?\" \"No, I haven't.\" \"Then, how did you know it was me?\"",
            "length": 209,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a one legged ballerina's costume? A One-One.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A doctor says to his patient, \"Without these treatments, you've got 3 months to live,\" and hands him a bill. The patient says, \"My God! Look at all these. I can't come up with this kind of money in 3 months!\" The doctor says, \"Alright! You've got 6 months to live.\"",
            "length": 271,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you make a cat go woof? Pour petrol on it.",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If Sondra Locke married Elliot Ness, divorced him and married Herman Munster, she'd be Sondra Locke Ness Munster.",
            "length": 113,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy goes to the doctor and complains that he can't stop singing the 'Green, Green Grass Of Home'. The doctor says: \"It's the Tom Jones Syndrome.\" The guys asks if it's common. The doctor replies: \"It's not unusual.\"",
            "length": 221,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Doctor, I used to think I was a dog, but I reckon I'm cured now-wow-wow!\" \"I see. How long did you have this complaint?\" \"Ever since I was a puppy.\" \"Interesting. Well, just lie on the couch there.\" \"But I'm not allowed on the couch.\"",
            "length": 245,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is big, grey and sings the Blues? Elephant Gerald.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's yellow and stupid? Thick custard!",
            "length": 40,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Knock Knock. Who's there? Boo. Boo who? Don't cry.",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If I eat three cakes in the morning and three for tea, what will I have? A tummy ache.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A pirate walks into a pub. Another patron, having never met a pirate before, wants to know the stories behind the battle scars. He buys the pirate a pint, and strikes up a conversation. \"How'd you get the peg leg?\" \"Shark took off me leg in the South Seas.\" \"How about that hook?\" \"Lost the hand in a sword fight.\" \"And the eye patch?\" \"Seagull pooped in me eye.\" \"Are seagull droppings really that dangerous?\" \"No, but it were me first day with the hook.\"",
            "length": 472,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes into a pub and sees his best friend playing chess with a dog. He says, \"That's a very clever dog you've got there!\" To which his friend replied, \"He's not that clever, he doesn't often win!\"",
            "length": 205,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A magician is very happy because he has got a job on the Titanic. So he gets on the ship, and that night he does his act in front of hundreds of people but doesn't get very far for his parrot keeps giving away the answers: \"It's under the table. It's up his sleeve. It's behind his back.\" The magician goes off the stage very depressed, and this happened again and again and again until one night, unfortunately, the ship hit an ice-berg and sank! Luckily, the magician and his parrot escaped in a lifeboat. They sailed on and on for days without seeing anyone, and through all of this time, the parrot had a look of total confusion on his face and didn't utter a single word. The magician thought that the parrot must be sick of hunger, until one day when the parrot said. \"O. K. I give up. Where have you hidden the stupid ship?!\"",
            "length": 836,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man is driving to work and is called on his mobile. It's his boss saying he's been promoted. The man is so happy his car wobbles in the road. A little while later there is another phone call and he's been promoted again. He is so happy he swerves into the middle of the road and back into his lane. Later there is another phone call. For the 3rd time he is promoted. He is so overwhelmed with joy that he swerves off the road and bangs into a tree. A passing car stops and a man gets out and says, \"Are you alright, what happened?\" The other man replies, \"I 'careered' off the road.\"",
            "length": 589,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the mermaid blush? Because the seaweed!",
            "length": 47,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the muddy chicken cross the road twice? He was a Dirty Double-Crosser!",
            "length": 78,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the dog cross the road twice? He was trying to fetch a boomerang!",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why does a moon rock taste better than an earth rock? A moon rock is a little meteor.",
            "length": 85,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There's this guy with a wooden eye. He's very sensitive about it, so he doesn't get out much. One day, he sees an ad for a dance, and he decides to go. He gets there, and he sees an attractive young lady with a gigantic nose. He thinks to himself, \"Well, she has that huge nose. Maybe she'll be more accepting of my wooden eye.\" He walks over to her and says, \"Would you like to dance?\" She replies, \"Oh! Wouldn't I!\" He shouts, \"Big nose! Big nose!\"",
            "length": 458,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Guy is sitting in a bar. A beautiful woman walks in. She's a knock-out and he can't take his eyes off her. She notices him and smiles. She sashays over and sits beside him. She looks into his eyes and tells him, \"For $200 I'll do anything you want.\" He's astounded. \"Anything?!\" He asks her. \"Yes, _anything_!\" She replies. He takes out his wallet and slaps $200 on the bar. \"Here's $200. Paint my house!\"",
            "length": 413,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man came home from golfing one Saturday a little later than he usually did. His wife asked him why. \"Bob had a heart attack and died right there on the 9th hole!\" He explained. \"Oh, my goodness, how horrible!\" She exclaimed. \"No wonder you're late!\" \"Yeah,\" he said. \"For the whole rest of the course, it was 'hit the ball, drag Bob, hit the ball'.\"",
            "length": 361,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a shark and a lemon? They both swim, except for the lemon.",
            "length": 88,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's blue and square? A banana in disguise.",
            "length": 45,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A mother put her child to sleep and then went to the kitchen. She then saw her son and he asked, \"Can I have a glass of water?\" The mother gave him a glass and he back upstairs. Minutes later the boy returned asking for a glass again. The mother wondered what could make her child so thirsty and when he came back down, asking for another glass of water, the mother said, \"That's your third glass tonight! What's wrong with you? Why are you so thirsty?\" \"Oh!\" Said the little boy. \"The water's not for me. The roof's on fire.\"",
            "length": 534,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the leading cause of dry skin? Towels.",
            "length": 46,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks up to the main desk a library and says in a loud commanding voice to the librarian, \"I'll take two hamburgers, no mayonnaise, and an order of fries.\" The librarian looks up at him, shocked. Summoning up all the authority she can, she says to him, \"Sir, this is a library!\" The man pauses for only a split second and then leans over close to her, cups his hand over his mouth so as to direct his voice only to her ear, and whispers, \"I'll take two hamburgers, no mayonnaise, and an order of fries.\"",
            "length": 515,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What goes haha, bonk? A man laughing his head off!",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Doctor!\" Said the patient. \"I keep seeing spots before my eyes.\" The physician scratched his head, \"Why have you come to me? Have you seen an ophthalmologist?\" \"No,\" replied the patient, \"just spots.\"",
            "length": 211,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two televisions walk into a bar and the barman says, \"Sorry, we don't serve your kind here.\" One television turns to the other and says, \"We're not getting a great reception in here.\"",
            "length": 187,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the projector blush? Because it saw the film strip.",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two penguins are sitting in a bathtub. The first one asks the second one to pass him the soap. The second one says, \"What do you think I am, a typewriter?\"",
            "length": 157,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why are chickens considered good employees? Because they work around the cluck.",
            "length": 79,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "In a dark night, under a street lantern, someone seeks after a lost key. Another helps seeking, and after half an hour on their knees, the other asks: \"Are you really sure that you lost your key right at this place?\" The one answers: \"No, I lost it further down the road, but here the lightning is better!\"",
            "length": 310,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A young lad came home after his first day at school was asked by his mother how did he enjoy his first day at school. He told her that the other kids were teasing him. They kept laughing and calling him big head. His mother told him to ignore them. She also told him that there was nothing wrong with his head. She then asked him to go to the store and get ten pounds of potatoes. He asked her what could use to carry them in. She replied, \"Use your hat.\"",
            "length": 457,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why aren't elephants allowed on the beach? They can't keep their trunks up.",
            "length": 75,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An elephant and a mouse were talking together. The elephant said to the mouse, \"Why am I so big and strong and heavy and you are so tiny, weak and puny and grey?\" The mouse said, \"Well, I've been ill haven't I!\"",
            "length": 215,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Waiter, there's a fly in my soup.\" \"There can't be. We used them all in the raisin bread.\"",
            "length": 95,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "To tell the weather, Go to your back door and look for the dog. If the dog is at the door and he is wet, it's probably raining. But if the dog is standing there really soaking wet, it is probably raining really hard. If the dog's fur looks like it's been rubbed the wrong way, it's probably windy. If the dog has snow on his back, it's probably snowing. Of course, to be able to tell the weather like this, you have to leave the dog outside all the time, especially if you expect bad weather. Sincerely, The cat.",
            "length": 512,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A group of managers were given the assignment to measure the height of a flagpole. So they went to the flagpole with a ladder and measuring tape. They keep falling off the ladder, dropping the tape and the whole thing is a mess. An engineer comes along and sees what they are trying to do. He walks over, pulls the flagpole out of the ground, lay it flat, measures it from end to end, gives the measurement to one of the managers and walks away. After the engineer left, one manager turns to another and laughs. \"Isn't that just like an engineer? We are looking for the height and he gives us the length!\"",
            "length": 607,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A husband stepped on one of those penny scales that tell you your fortune and weight and dropped in a coin. \"Listen to this,\" he said to his wife, showing her a small, white card. \"It says I'm energetic, bright, resourceful and a great person.\" \"Yeah,\" his wife nodded, \"and it has your weight wrong too.\"",
            "length": 313,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a pub and sees Vincent Van Gogh sitting in the corner. \"Fancy a pint Vincent?\" He asks, \"No thanks,\" Van Gogh replies, \"I've got one 'ere.\"",
            "length": 162,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Man walks into a bar and immediately notices two pieces of meat nailed to the ceiling. \"What's with the meat?\" He asks the barman. \"Oh, that's just a little competition,\" the barman explained. \"If you can jump up and catch a piece of meat between your teeth, then you get a free drink.\" \"If you fail, however, you buy the whole bar a drink.\" \"Would you like to have a go?\" The barman asked. \"I don't think so,\" replied the man, \"the steaks are too high.\"",
            "length": 468,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What have an orange and a parrot got in common? Neither of them can drive a tractor.",
            "length": 84,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two oranges are walking down the road. The one orange says to the other, \"So, where do you live then?\" And the other replies, \"I'm not telling you, you'll nick my washing off the line!\"",
            "length": 189,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the man that was walking down the street and turned into a hotel?",
            "length": 84,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A frog telephones a psychic hotline and is told: \"You are going to meet a beautiful young girl who will want to know everything about you.\" \"Great!\" Says the frog. \"Will I meet her at a party?\" \"No,\" replies the psychic. \"Next year, in a biology class.\"",
            "length": 263,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many pragmatists does it take to change a lightbulb? One.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes into a pet shop to buy a parrot. The shop owner points to three identical looking parrots on a perch and says: \"The parrot to the left costs 500 dollars.\" \"Why does the parrot cost so much?\" The customer asks. The owner says, \"Well, it knows how to use a computer.\" The customer asks about the next parrot and is told, \"That one costs 1,000 dollars because it can do everything the other parrot can do plus it knows how to use the UNIX operating system.\" Naturally, the increasingly startled man asks about the third parrot and is told, \"That one costs 2,000 dollars.\" Needless to say this begs the question, \"What can IT do?\" To which the owner replies, \"To be honest I have never seen it do a thing but the other two call him boss!\"",
            "length": 759,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the necktie say to the hat? You go on a head and I'll just hang around.",
            "length": 80,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two statisticians went duck hunting. Not being very good, they did not see a duck all day. Just as they agreed to leave, a duck flew out in front of them. Both aimed and fired. One shot went two metres to the left of the duck, the other two metres to the right, and the duck escaped. However, they went home very happy, because on average the bird was dead!",
            "length": 357,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man and a friend are playing golf one day at their local golf course. One of the guys is about to chip onto the green when he sees a long funeral procession on the road next to the course. He stops in mid-swing, takes off his golf cap, closes his eyes, and bows down in prayer. His friend says, \"Wow, that is the most thoughtful and touching thing I have ever seen. You truly are a kind man.\" The man then replies, \"Yeah, well we were married 35 years.\"",
            "length": 459,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two cows in a field. One turns to the other and says, \"Are you worried about this Mad Cow Disease?\" The other cow says, \"Non, je suis Napoleon.\"",
            "length": 148,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If at first you don't succeed, Skydiving isn't the sport for you.",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One dark foggy night, I was walking alone on a narrow country road when out of the fog appeared a small car moving very slowly and with no sound! I jumped to the side of the road but as it drew level, it stopped! Through the windows I could see no-one, no driver, nothing. I looked closer and then opened the passenger door and braced myself to climb in. Immediately the car started to move again, just as slowly! I froze, kneeling on the seat clutching its back. Moments later the car stopped and I almost fell out. As I scrambled to my feet, the ghostly, shambling figure of a man drifted towards me out of the fog and I screamed out, \"Oh, god, there's something wrong about this car!\" The shadowy figure stopped. It gasped, and then a voice croaked, \"I know, I've been pushing it for half a mile!\"",
            "length": 804,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a butchers shop, \"A pound of kidleys please.\" The butcher replies, \"What?\" \"I said a pound of kidleys!\" \"Don t you mean a pound of kidneys?\" \"That's what I said, diddle I?\"",
            "length": 199,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you get a philosopher off your porch? Pay for the pizza.",
            "length": 63,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do u call a gingerbread man with only one leg? Limp Biscuit.",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do Cats like to eat for breakfast? Mice-Krispies.",
            "length": 54,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many punk rockers does it take to change a light bulb? Two, one to change the bulb and one to kick the chair out from underneath him.",
            "length": 137,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you give dead bread? A toast-mortem.",
            "length": 44,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Knock knock. Who's there? Alison. Alison who? Alison Wonderland.",
            "length": 64,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a nun with a washing machine on her head? Sister Matic.",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two elderly gentlemen were talking. One says, \"Boy, this new hearing aid I got works great! I can hear everything now.\" The other one says, \"That's wonderful! What kind is it?\" \"It's a quarter past two.\"",
            "length": 209,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is television called a medium? It is neither rare nor well-done.",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A large hole appeared in the High Street this morning. The police are looking into it.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple are out touring a house that they want to buy with a realtor when they ask the realtor, \"The house is very nice, but is this a quiet neighborhood?\" The realtor answers, \"Sure, there have been six murders, seven robberies, and no one heard a thing.\"",
            "length": 261,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Time flies like the wind. Fruit flies like a banana.",
            "length": 52,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If miss universe is not fixed then why are all the winners from Earth?",
            "length": 70,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Bacon and eggs walks into a bar, and the bartender says, \"Sorry, we don't serve breakfast.\"",
            "length": 93,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did one snake say to another? \"Mum, are we supposed to be poisonous?\" \"No son, why?\" \"Because I just bit my lip!\"",
            "length": 124,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A business owner has just moved places and was reopening soon. A friend of his wanted to congratulate him so he went to the local florist and asked if he could have some flowers delivered to the man. He then asked the florist worker to write something clever to go with the flowers. A few days later the florist receives phone call. It was the boss. \"I am sure there was a muck up in your delivery service, my flowers came but it said: 'Rest In Peace' on it.\" \"Well I'm sorry,\" was the reply, \"But you think of these mourners at a funeral at the moment with flowers with a card saying: 'Congratulations on your new place!'\"",
            "length": 629,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What should you do if you get snow in your mouth? Just grit your teeth!",
            "length": 71,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A husband and wife were having a fine dining experience at their exclusive country club when this stunning young woman comes over to their table, gives the husband a big kiss, says she'll see him later and walks away. His wife glares at him and says, \"Who was that?!\" \"Oh,\" replies the husband, \"she's my mistress.\" \"Well that's the last straw,\" says the wife. \"I've had enough, I want a divorce. I am going to hire the most aggressive, meanest divorce lawyer I can find and make your life miserable.\" \"I can understand that,\" replies her husband, \"but remember, if we get a divorce it will mean no more wintering in Key West, or the Caribbean, no more summers in Tuscany, no more Cadillac STS in the garage, and no more country club, and we'll have to sell the 26-room house and move to two smaller homes, but the decision is yours.\" Just then, a mutual friend enters the restaurant with a gorgeous young woman on his arm. \"Who's that with Jim?\" Asks the wife. \"That's his mistress,\" says her husband. The wife replies, \"Ours is prettier.\"",
            "length": 1060,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I collect badgers. One day I'll have the full set.",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What time did the Chinaman go to the dentist? Tooth hurty.",
            "length": 58,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A monastery falls on hard times so two monks decided to open a FISH and CHIP bar. On the first day of opening a woman comes in and sees one of the monks peeling spuds, so she says to him, \"You must be the chipmunk,\" he replies, \"No, I'm the friar.\"",
            "length": 252,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Jesus decided to help St. Peter at the Pearly Gates. A very old man approached and Jesus asked him, \"How have you lived your life?\" The old man replied, \"I was a carpenter.\" Jesus looked closely at the old man. \"Is it, is it... You, father?\" The old man peered back at him. \"Is it you, Pinocchio?\"",
            "length": 305,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple goes to a psychiatrist. The woman says, \"Doc, my husband thinks he's a dog. Can you help him?\" The shrink says, \"Sure, have him lie down on the couch.\" The woman says, \"Oh no. He's not allowed on the couch.\"",
            "length": 222,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man was walking in the country and saw a pig with a wooden leg sitting outside a barn. As he was pondering this, the pig's owner came along. The man asked the farmer how the pig got his wooden leg. The farmer said, \"Let me tell you, that is some pig! Our house caught fire last May, and he dragged my kids to safety!\" \"Is that how he lost his leg?\" The man asked. \"No,\" replied the farmer. \"But a month ago, I almost drowned and that pig swam through icy water to pull me to shore!\" \"So that's how he lost his leg,\" the man asked. \"Oh, no. And just a week ago, my wife's car slid off the road onto the train tracks. That pig broke through the window and helped her out just as a freight train came through!\" \"So THAT'S how he lost his leg!\" The man said. \"No, sir.\" \"Then HOW did he lose it?\" The man begged. \"Well sir,\" the farmer replied, \"when you got a pig that terrific, you don't want to eat it all at once.\"",
            "length": 938,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A teacher was taking her class for a walk in the woods. \"Now Mary,\" she said. \"What do you call the outside of a tree?\" \"I don't know miss,\" said Mary. \"Bark, you silly girl,\" said the teacher. \"Bark!\" \"Oh all right then,\" said Mary. \"Woof-Woof!\"",
            "length": 260,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Mother: \"Come on, John, eat your breakfast; You'll be late for school.\" John: \"I don't want to go to school. The teachers don't like me, the children don't like me, even the caretaker doesn't like me!\" Mother: \"All the same, you must go.\" John: \"Why should I go?\" Mother: \"Well, for one thing you're forty five years old, and for another your the headmaster.\"",
            "length": 369,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There are two teddy bears in the airing cupboard. Which one is in the army? The one on the tank.",
            "length": 96,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is Toblerone triangular? So it will fit in the box.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do John the Baptist and Winnie the Pooh have in common? The same middle name!",
            "length": 82,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the Hamster found dead in his cage? Apparently he fell asleep at the wheel!",
            "length": 94,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One afternoon, a little boy was playing outdoors. He used his mother's broom as a horse and had a wonderful time until it was getting dark. He left the broom on the back porch. His mother was cleaning up the kitchen when she realized that her broom was missing. She asked the little boy about the broom and he told her where it was. She then asked him to please go get it. The little boy informed his mom that he was afraid of the dark and didn't want to go out to get the broom. His mother smiled and said, \"The Lord is out there too, don't be afraid.\" The little boy opened the back door a little and said, \"Lord if you're out there, hand me the broom.\"",
            "length": 659,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Joan, the town gossip and supervisor of the town's morals, recently accused George, a local man, of being an alcoholic because she saw his pickup truck parked outside the town's only bar. George stared at her for a moment, and said nothing. Later that evening, he parked his pickup truck in front of her house and left it there all night.",
            "length": 338,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There was a lawyer and he was just waking up from anesthesia after surgery, and his wife was sitting by his side. His eyes fluttered open and he said, \"You're beautiful!\" And then he fell asleep again. His wife had never heard him say that so she stayed by his side. A couple minutes later his eyes fluttered open and he said, \"You're cute!\" Well, the wife was disappointed because instead of, \"beautiful,\" it was, \"cute.\" She said, \"What happened to 'beautiful'?\" His reply was, \"The drugs are wearing off!\"",
            "length": 520,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Give a man a fish and he will eat for a day. Teach him how to fish and he will sit in a boat and drink beer all day!",
            "length": 116,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"This day holds a lot of meaning for me. It was on this day two years ago that I lost my dear wife and children. I'll never forget that game of cards...\"",
            "length": 155,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "After a trial had been going on for three days, Finley, the man accused of committing the crimes, stood up and approached the judge's bench. \"Your Honor, I would like to change my plea from 'innocent' to 'guilty' of the charges.\" The judge angrily banged his fist on the desk. \"If you're guilty, why didn't you say so in the first place and save this court a lot of time and inconvenience?\" He demanded. Finley looked up wide-eyed and stated, \"Well, when the trial started, I thought I was innocent, but that was before I heard all the evidence against me.\"",
            "length": 563,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Our supermarket had a sale on boneless chicken breasts, and a woman I know intended to stock up. At the store, however, she was disappointed to find only a few skimpy prepackaged portions of the poultry, so she complained to the butcher. \"Don't worry, lady,\" he said. \"I'll pack some more trays and have them ready for you by the time you finish shopping.\" Several aisles later, my friend heard the butcher's voice boom over the public-address system: \"Will the lady who wanted bigger breasts please meet me at the back of the store.\"",
            "length": 540,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Sean got home in the early hours of the morning after a night at the local pub. He made such a racket hitting into the furniture as he weaved his way through the house, that he woke up the missus. \"What on earth are you doing down there?\" She yelled down from the bedroom. \"Get yourself up here to bed and don't wake the neighbours.\" \"I'm trying to get a barrel of Guinness up the stairs,\" he shouted. \"Leave it 'till the morning,\" she shouted down, \"I can't,\" he said, \"I've drank it!\"",
            "length": 498,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A group of kindergarten children were on a class outing to their local police station where they saw pictures, tacked to a bulletin board, of the 10 most wanted men. One of the youngsters pointed to a picture and asked if it really was the photo of a wanted person. \"Yes,\" answered the policeman. \"Well,\" wondered the child, \"why didn't you keep him when you took his picture?\"",
            "length": 383,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "While making his rounds, a doctor points out an X-ray to a group of interns. \"As you can see the patient is limping because his left fibula and tibia are radically arched. Michael, what would you do in a case like this?\" \"Well,\" said the intern, \"I suppose I'd limp too.\"",
            "length": 277,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man commits suicide. In one of his pockets, the police find an envelope. Inside the envelope is a note that reads: \"What are you looking in here for?\"",
            "length": 154,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A worried Mrs. Melchnik sprang to the telephone when it rang and listened with relief to the kindly voice in her ear. \"How are you, darling?\" It said. \"What kind of a day are you having?\" \"Oh, mother,\" said the housewife, breaking into bitter tears, \"I've had such a bad day. The baby won't eat and the washing machine broke down. I haven't had a chance to go shopping, and besides, I've just sprained my ankle and I have to hobble around. On top of that, the house is a mess and I'm supposed to have two couples to dinner tonight.\" The mother was shocked and was at once all sympathy. \"Oh, darling,\" she said, \"sit down, relax, and close your eyes. I'll be over in half an hour. I'll do your shopping, clean up the house, and cook your dinner for you. I'll feed the baby and I'll call a repairman I know who'll be at your house to fix the washing machine promptly. Now stop crying. I'll do everything. In fact, I'll even call George at the office and tell him he ought to come home and help out for once.\" \"George?\" Said the housewife. \"Who's George?\" \"Why, George! Your husband!... Is this 555-1374?\" \"No, this is 555-1375.\" \"Oh, I'm sorry. I guess I have the wrong number.\" There was a short pause and the housewife said, \"Does this mean you're not coming over?\"",
            "length": 1289,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the three eggs? Two bad.",
            "length": 43,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What you call a snowman with a sun tan? A puddle!",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If athletes get athlete's foot, what do astronauts get? Missile toe!",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Ted: I had the worst dream last night. I dreamed I ate a 2-ton marshmallow. Steve: What's wrong with that? Ted: When I woke up my pillow was gone.",
            "length": 146,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I was offered a job in a monastery laundry. My mother would not let me take it as she did not want me to pick up any dirty habits.",
            "length": 130,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many balls of wool would it take to reach the moon. One, but it would need to be very large.",
            "length": 96,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a big white bear with a hole in his middle? A polo bear.",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why was the back end of a horse walking down the road? Because the front end was.",
            "length": 81,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a chicken in a shellsuit? An egg!",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How is a lawyer different than and angry chicken? The angry chicken, \"clucks defiance!\"",
            "length": 89,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Doctor, doctor, I've only got 50 seconds to live!\" \"Just a minute.\"",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a butcher's shop and asks the butcher, \"Have you got a sheep's head?\" \"No,\" replies the butcher, \"it's just the way I part my hair.\"",
            "length": 155,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "There were two boys called manners and shut up. Shut up went to the sweet shop and manners went to the fish and chip shop. The shop keeper said to shut up. What's your name and shut up said shut up. The shop keeper said that's not nice where's your manners. In the fish and chip shop said shut up.",
            "length": 297,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Doctor, doctor I swallowed a camera!\" \"Let's hope nothing serious develops.\"",
            "length": 81,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is square and blue? An orange. I lied about its shape and colour!",
            "length": 70,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple comes up to a wishing well. The guy leans over, makes a wish, and throws in a penny. His wife decides to make a wish, too, but she leans over too far, falls into the well, and drowns. The guy says, \"Wow, it really works.\"",
            "length": 232,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "This guy runs home and bursts in yelling, \"Pack your bags sweetheart, I've just won the lottery, all six numbers!\" She says, \"Oh wonderful! Should I pack for the beach or the mountains?\" He replies, \"I don't care, just pack and shove off!\"",
            "length": 245,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Ariel and Times New Roman walk into a bar. The Barman takes one look and says, \"Sorry fellas, we don't serve your type in here.\"",
            "length": 130,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Tell a man that there are 400 billion stars, and he'll believe you. Tell him a bench has wet paint, and he has to touch it.",
            "length": 123,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a man with seagulls flying around his face? Cliff.",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when you play a country song backwards? You get your dog back, your wife back, your house back, and you sober up.",
            "length": 129,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the dyslexic devil worshipper? Sold his soul to Santa.",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A cross and hungry panda went into a bar and, without ordering a drink, demanded a bowl of free bar-snacks. The bartender refused: \"Those snacks are for paying patrons.\" So the panda grabbed the nearest bowl, gobbled up all the snacks. Then he pulled out a revolver, shot the bartender dead, and stalked out. The patrons all asked each other, \"Who was that masked marauder?\" The quiet little guy at the end of the bar calmly answered: \"That was a panda. He eats shoots and leaves.\"",
            "length": 487,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the difference between a duck? One of its legs is both the same!",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A bloke handed his mate an octopus that looked to be at death's door, and said, \"There's the six quid I owe you.\"",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Early morning in december 1968 a journalist calls Lyndon B. Johnson and asks what he most wishes for Christmas. Johnson is desperately trying to make his drowsy brain work. Bedazzled he tries to think of something adequate but not too exaggerated. Next morning The Sunday Times says: Brezhnev wishes to end famine for Christmas, de Gaulle hopes all wars to end, and Johnson likes to have after shave and a new pair of slippers.",
            "length": 427,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One day, an HR woman was hit by a bus and killed. Her soul arrived in heaven and she was met by St. Peter. \"Welcome to Heaven. Before you get settled in, it seems we have a problem. We've never once had an HR manager make it this far. What we're going to do is let you have a day in Hell and a day in Heaven, then you can choose your eternity,\" said St. Peter. St. Peter put her in an elevator, it went down-down-down. The doors opened, she stepped onto a beautiful golf course. In front of her were all her fellow HR professionals. They were all dressed in evening gowns. They ran up and kissed her. They played golf and she enjoyed steak and lobster dinner. She met the Devil who was a really nice guy, she had a great time telling jokes and dancing. When it was time to leave, everyone shook her hand and waved goodbye. So she spent the next 24 hours lounging around on the clouds, playing the harp and singing. \"Now you must choose your eternity,\" he said. She paused and then replied, \"Well, Heaven has been great but I think I had a better time in Hell.\" So she went down-down-down. When the doors opened, she was standing in a desolate wasteland covered in garbage. Her friends were dressed in rags and were picking up garbage for the evening meal. The Devil came up to her and put his arm around her and laughed. \"I don't understand,\" she stammered. \"Yesterday I had a great time here, there was a golf course and we ate lobster. Now all there is a wasteland and all my friends look miserable.\" The Devil looked at her and grinned, \"That's because yesterday we were recruiting you, but today you're staff.\"",
            "length": 1626,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the last thing to go through a bug's mind after it hits the windshield of a car? It's rear end!",
            "length": 102,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What happens when monsters have a beauty contest? No-one wins!",
            "length": 62,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A small man jumped on a table in a bar and yelled: Show me an Irishman, and I'll show you a coward! A huge, bodybuilder looking guy stood up, walked to the little man and said: \"Here's an irishman.\" The little guy darted out of the door and yelled over his shoulder: \"And here goes the coward!\"",
            "length": 298,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the traffic light say to the car. Don't look now I'm changing.",
            "length": 71,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy walks into a doctor's office with a strawberry growing out of his head. The doctor says, \"Don't worry, I've got cream for that.\"",
            "length": 136,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How is the new furniture store doing? Sofa so good!",
            "length": 51,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Is it okay to kiss a nun? Yes but don't get into the Habit!",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why should you take care of your grandparents in an Indian restaurant? In case your Nan slips into a Korma!",
            "length": 107,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Little Johnny is working away furiously in the woodwork room when the teacher enters. \"What are you making there, Johnny?\" He asks. \"A portable,\" replies Johnny. The teacher looks puzzled, \"A portable what?\" Johnny replies, \"I don't know yet Sir, I've only made the handles!\"",
            "length": 283,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did Jim bring his car into school? Because he wanted to drive his teacher up the wall!",
            "length": 90,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two knights went into a hotel and said to the woman at reception, \"I would like a room for two nights!\"",
            "length": 105,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A husband and wife are traveling by car from Key West to Boston. After almost twenty-four hours on the road, they're too tired to continue, and they decide to stop for a rest. They stop at a nice hotel and take a room, but they only plan to sleep for four hours and then get back on the road. When they check out four hours later, the desk clerk hands them a bill for $350. The man explodes and demands to know why the charge is so high. He tells the clerk that although it's a nice hotel, the rooms certainly aren't worth $350. When the clerk tells him that $350 is the standard rate, the man insists on speaking to the manager. The manager listens to the man and then explains that the hotel has an Olympic-sized pool and a huge conference center that were available for the husband and wife to use. He also explains that they could have taken in one of the shows for which the hotel is famous. \"The best entertainers from New York, Hollywood and Las Vegas perform here,\" explains the manager. No matter what facility the manager mentions, the man replies, \"But we didn't use it!\" The manager is unmoved and eventually the man gives up and agrees to pay. He writes a check and gives it to the manager. The manager is surprised when he looks at the check. \"But sir,\" he says, \"this check is only made out for $100.\" \"That's right,\" says the man. \"I charged you $250 for sleeping with my wife.\" \"But I didn't!\" Exclaims the manager. \"Well,\" the man replies, \"she was here, and you could have.\"",
            "length": 1511,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Near dawn in a colony of Vampire bats, all are still hungry but one hangs there with blood on its face. They all pester and nag, \"Well it's alright for some! Why don't you share this great feeding place with the rest of us?!\" Only to get told, \"Really, you dob't wadt to gnow,\" which does nothing to calm them down so finally they are led off along the hedge and over the pastures to a big tree in the middle of a field, where usually there are cattle to feed from. Flying round and round the tree they are again getting angry as there are no cattle to be seen, but the bloody-nosed bat just says, \"You all thee dis tree dob't you, well I dibn't!\"",
            "length": 653,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a pub where everybody else is having coffee with cream. \"I would like a coffee. No cream on it.\" \"Sorry, we ran out of cream. Could it be with no milk?\"",
            "length": 173,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a person who used to like tractors a lot? An ex-tractor fan!",
            "length": 77,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A woman gives birth and it is just a head with no body or limbs. The father decides to love it and give it the life that it deserves. He takes it to the park and loves it as if it was a normal child. On his 18th birthday the father decides to take him down to the pub to give him his first ever drink. \"Give me a shot of absinthe,\" the father asks the landlord. The drink is poured and the son drinks it down. Suddenly a body pops out of the head. The father is amazed. \"Give him another!\" The father exclaims. The son drinks and arms pop out. \"Another!\" Cries the man. Then the son has all his limbs. He is stumbling around the bar, after all he has never used them before. He stumbles outside and is promptly run over by a bus. The barman turns to the father and says, \"He should have quit while he was ahead!\"",
            "length": 820,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the skeleton cross the road? To get to the body shop.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man on holiday in India soon finds out about a monastery, high in the hills, the only way to get to it is to take a half hour ride in a basket, being hoisted up the cliff face. The man decides this would be an adventurous thing to do, so he goes and asks the monk at the bottom of the cliff whether he can get a lift Up. The monk agrees and they begin the journey. About halfway through, the man notices that the rope that basket is hoisted up on is very frayed, fearful, he asks the monk, \"How often does this rope get replaced?\" The monk thinks on this for a few seconds and replies, \"Whenever it breaks.\"",
            "length": 613,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when you cross a penguin with a centipede? Cold feet.",
            "length": 69,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Doctor, doctor. I've developed spots like cherries on a cake. Ah, you must have analogy.",
            "length": 88,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the black stuff between elephant's toes? Slow ants.",
            "length": 58,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy walks into a bar carrying a giraffe. He sets the giraffe down by the door and walks up to the bartender. \"Bartender, give me a whisky,\" he says. The bartender looks at him and says, \"You know, you can't just leave that lying over there.\" The guy looks at him and says gruffly, \"It's not a lion, it's a giraffe.\"",
            "length": 323,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Troy's all excited about his new rifle. So he goes bear hunting in Alaska. The first bear he sees is a little brown bear, and he kills it with his first shot. There is a tap on his shoulder, and he turns around to see a big black bear. The black bear says, \"You've got two choices. One, I maul you to death or Two, we have sex.\" Troy bends over for the bear. He's sore for two days, but he recovers and vows revenge. Troy heads out on another trip to Alaska and he finds the black bear and kills him. At that moment there is a tap on his shoulder. A huge grizzly is standing right behind him. The grizzly says, \"That was a big mistake. You've got two choices: Either I maul you to death or we have sex.\" Troy bends over. He survives, but he's really hurting and takes quite a bit of time to recover, and he's outraged. Sure enough, he heads back to Alaska and finds the grizzly and shoots him at point blank range. There's a tap on his shoulder. He turns around to find an enormous polar bear. The polar bear says, \"Hey, pal, you're not really coming up here for the hunting, are you?\"",
            "length": 1091,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why was Cinderella such a bad football player? Her coach was a pumpkin.",
            "length": 71,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a doll with sausages on her head? Barbie.",
            "length": 58,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "You can take a horse to water, but a pencil must be lead.",
            "length": 57,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the chicken cross the road? To get to the other side. Why did the rooster cross the road? He was glued to the chicken. Why was the rooster glued to the chicken? They ran out of tape.",
            "length": 190,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a dog with no legs. A hotdog.",
            "length": 46,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get if you mix a cow with a camel? Lumpy milkshakes.",
            "length": 64,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between roast beef and pea soup? You can roast beef but you can't pea soup!",
            "length": 97,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An Insurance Assessor is at a wedding reception, and asks the bride; \"So this is your fourth husband?\" \"Yes, that's right,\" she replied. \"Can I ask what happened to your first husband?\" \"Oh, very sad, he died quite suddenly.\" \"Oh, I am sorry, what happened?\" \"He unfortunately ate some poisoned mushrooms and passed away. The insurance paid out, of course, but it can never really compensate.\" \"That's terrible, what happened to the second husband?\" \"Another tragic case, he too, ate some poisoned mushrooms and passed away. The money didn't compensate for his loss.\" By now, the Assessor was very suspicious, and asked; \"Did your third husband die from ingesting poisoned mushrooms?\" \"Oh no,\" she stated, \"He died from a fractured skull!\" \"My word, I am very sorry. How did he get that?\" \"Well, he wouldn't eat the mushrooms!\"",
            "length": 853,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A snail is on the bar one Christmas, and asks the barman, \"Excuse me, can I have a pint of beer please?\" The barman says, \"You WHAT?\" \"May I have a pint of beer, please?\" Repeats the snail. \"Don't be so stupid, snails don't drink beer,\" snarls the bar man and sweeps the snail off the bar on to the floor. The following Christmas, in the same bar, a snail appears on the counter. The barman asks, \"What do you want?\" Whereupon the snail shouts, \"What did you do THAT for?!\"",
            "length": 485,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call an Earl who is awarded an OBE? An earlobe.",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What was the film about referees called? The umpire strikes back.",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call 100 penguins in Trafalgar Square? Lost.",
            "length": 56,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a fish with no eyes? Fsh!",
            "length": 42,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's red and white on the outside, grey and white on the inside? Campbell's Cream of Elephant Soup.",
            "length": 101,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks up to the bar with an ostrich behind him, and as he sits, the bartender comes over, and asks for his order. The man says, \"I'll have a beer,\" and turns to the ostrich. \"What about you?\" \"I'll have a beer too,\" says the ostrich. The bartender pours the beer and says, \"That will be $3.40 please,\" and the man reaches into his pocket and pulls out exact change for payment. The next day, the man and ostrich come again, and the man says, \"I'll have a beer,\" and the ostrich says, \"I'll have the same.\" Once again the man reaches into his pocket and pays with exact change. This becomes a routine until, late one evening, the two enter again. \"The usual?\" Asks the bartender. \"Well, it's close to last call, so I'll have a large scotch,\" says the man. \"Same for me,\" says the ostrich. \"That will be $7.20,\" says the bartender. Once again the man pulls exact change out of his pocket and places it on the bar. The bartender can't hold back his curiosity any longer. \"Excuse me sir. How do you manage to always come up with the exact change out of your pocket every time?\" \"Well,\" says the man, \"several years ago I was cleaning the attic and found an old lamp. When I rubbed it a Genie appeared and offered me two wishes. My first wish was that if I ever had to pay for anything, I just put my hand in my pocket, and the right amount of money will always be there.\" \"That's brilliant!\" Says the bartender. \"Most people would wish for a million dollars or something, but you'll always be as rich as you want for as long as you live!\" \"That's right! Whether it's a gallon of milk or a Rolls Royce, the exact money is always there,\" says the man. The bartender asks, \"One other thing, sir, what's with the ostrich?\" The man replies, \"My second wish was for a chick with long legs.\"",
            "length": 1822,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A woman went to a seance and was successful in contacting her husband. \"Hi,\" he said, \"it's me. Everything's better; Sky is bluer; Grass is greener. Nothing to do but eat and sleep all day.\" \"Oh, thank goodness. You did get to Heaven.\" \"Heaven? I'm a buffalo in Montana!\"",
            "length": 279,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's gray on the inside and clear on the outside? An elephant in a baggie!",
            "length": 76,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's green and likes snow? Ski-weed.",
            "length": 38,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a greengrocers and says, \"Can I have a hammer please?\" The assistant says, \"Sorry this is a greengrocers.\" The man replies, \"That's O. K. I've got my bike outside.\"",
            "length": 187,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A priest conducts a service in a church, \"The person who puts the most in the church collection box can choose three hymns,\" he says. The collection box comes back to him after being filled up and he finds that someone has donated a thousand pounds. \"Who has donated a thousand pounds?\" He asks. A woman raises her hand! The priest invites her to the front and tells her to choose three hymns. Pointing at the three most handsome men in the church she says, \"I'll have him, him, and him.\"",
            "length": 494,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's yellow and always points north? A magnetic banana!",
            "length": 57,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two kids were talking in the playground. The first kid says, \"My mum is from Ireland and my dad is from America. That makes me an Irish-American.\" The second kid says, \"Well my mum is from Iceland and my dad is from Cuba. So I guess that makes me an Icecube.\"",
            "length": 263,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did the robot say to the petrol pump? Take your finger out of your ear when I'm talking to you!",
            "length": 100,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a fish with three eyes? Fiiish.",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Bill happened by his neighbor's house one day. He saw his friend, farmer John in the apple orchard holding his favorite, prize pig. John would patiently hold Snooks up so she could munch an apple right off the twig, then move on to the next apple and the next. \"Hello, John,\" says Bill, \"not to interfere with your pastime but why don't ya pick Snooks a bucket of them apples? It would save time!\" \"Eh' yeah, Bill, it would, but then, what's time to a pig!\"",
            "length": 463,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A greyhound is sitting in a pub, drinking its beer when the door opens and a horse comes in. It sits down beside another horse and starts to talk of its troubles. \"Same as before, Des,\" says the horse, \"I get to within a hundred feet of the winning post and I fall over.\" The other horse commiserates, \"That's happening to all of us flat racers, Red. It must be some sort of disease.\" The dog interrupts, \"I can't believe it!, That's exactly what happened to me at Whitecity yesterday.\" The horses look at each other in surprise; \"Will you look at that. A talking dog!\"",
            "length": 579,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man sees an ad for a joke contest in his local newspaper so he sends in ten puns. He gets a letter back from the newspaper thinking he win, but no pun in ten did.",
            "length": 164,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is 6am like a pig's tail? Because it's twirly!",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you tell if an ant is a male ant or a female ant. Drop it in water, if it floats it's boy-ant!",
            "length": 101,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why can't a rope? Because it can knot.",
            "length": 38,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a judge with no thumbs? Justice Fingers.",
            "length": 57,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I joined an origami club, but it folded.",
            "length": 40,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is ET short for? So that he fits in his spaceship.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when you sit under a cow? A pat on the head.",
            "length": 60,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get hanging from apple trees? Sore arms!",
            "length": 52,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is a crocodile's favourite card game? Snap.",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why can't you play poker in the jungle? Because there are too many cheeters.",
            "length": 76,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If a pig loses its voice, is it disgruntled?",
            "length": 44,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "When the wheel was invented, did it cause a revolution?",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into a barbers shop. He says, \"I want to buy a comb.\" \"Steel one?\" Says the barber. \"No, I want to pay for it.\"",
            "length": 129,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many mystery crime novel writers does it take to change a lightbulb? One, but he has to give it a really good twist.",
            "length": 120,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Tonto and the Lone Ranger are riding through the desert when they spy a small town on the horizon. It's a cold desert night and the Lone Ranger fancies a whiskey or two to warm him up so they stop into a saloon. The barman is happy to serve the Lone Ranger but refuses to serve Tonto. \"Sorry Tonto, but I really want this drink,\" says the Lone Ranger, \"would you mind waiting outside for a little while?\" \"But it's cold outside,\" says Tonto. \"Well, run up and down to keep yourself warm,\" says the Lone Ranger. So the Lone Ranger has his whiskey and Tonto goes outside and runs up and down to keep himself warm. A few minutes later another cowboy walks into the bar, struts up to the Lone Ranger and demands: \"Are you the Lone Ranger?\" \"Yes,\" the Lone Ranger replies. \"Well you left your injun running.\"",
            "length": 817,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man was going to bed one night when there was a knock at the door, he answered and there stood a giant ant that punched him in his eye. Now he made up and excuse when his friends asked him, because he thought he couldn't say he had been punched by an ant, so he said he had had a punch up in the pub. Anyway, the next night the same happened again, but this time he got beaten up really bad, so he went to the hospital and told the doctor everything that had happened and the doctor said, \"Ahhhh yes there is a nasty bug going round.\"",
            "length": 538,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man walks into the doctors and says: \"I think I'm Schizophrenic.\" The doctor replies, \"That makes four of us!\"",
            "length": 116,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man went into a pet shop and said: \"I would like a pet parrot for my daughter.\" Then the owner of the pet shop said: \"Sorry, this is a pet shop, we don't do swaps!\"",
            "length": 170,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do ducks have webbed feet? To stamp out fires. Why do elephants have flat feet? To stamp out burning ducks.",
            "length": 111,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you get two whales in a car? Drive down the M4!",
            "length": 54,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"Doctor, Doctor I feel like a goat!\" \"How long have you been feeling like this?\" \"Ever since I was a kid!\"",
            "length": 112,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A tomato, a faucet, and a lettuce decided to have a race. Who won? At the finish, the lettuce was ahead, the tomato couldn't ketchup, and the faucet was still running.",
            "length": 167,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A noble aristocrat was captured during the French Revolution. The captors said, \"Tell us the names of the people you are hiding!\" \"I won't say a word!\" Says the aristocrat. They place his head in the guillotine. \"Talk to us or die!\" \"I will not!\" He replies. They then draw the blade to the top of the guillotine. \"Last chance to talk!\" \"Never!\" Cries the Count. Then, just as they release the blade, the Count screams, \"Wait, wait, I'll talk!\" But, alas, it was too late. The moral of the story: Never hatchet your Counts before they chicken!",
            "length": 557,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why didn't the watermelon marry the honeydew? Because they cantaloupe!",
            "length": 70,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did they only make one Yogi Bear? They made a Boo Boo of the second.",
            "length": 72,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the difference between a tire and a bench? None, they're both made of wood. Except the tire.",
            "length": 100,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "As migration approached, two elderly vultures doubted they could make the trip south, so they decided to go by airplane. When they checked their baggage, the attendant noticed that they were carrying two dead racoons. \"Do you wish to check the raccoons through as luggage?\" She asked. \"No, thanks,\" replied the vultures. \"They're carrion.\"",
            "length": 345,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "My sister is reacting very slowly. Last week this guy wanted to take advantage of her and before she could say she wasn't that kind of a girl. She was.",
            "length": 151,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why is being a test tube baby so great? You get a womb with a view.",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is old, dusty and tucked away behind the bookshelf? The 1974 hide n seek champion!",
            "length": 87,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "John and Tracy were in a very posh restaurant. John asked for the menu. He brought the menu to them but stated, \"I am not a waiter, my name is Hans and I wash the dishes for Yosfayce (Pronounced yo's face), The Russian chef.\" A few minutes later, Hans came back and said, \"I can't find Yosfayce or the waiter, but I will take your order.\" They had decided to have Squid. Hans went to get the tank. John chose the Squid, and Hans removed it from the tank and rushed it to the kitchen. Hans returned, \"I cannot kill that squid, as it has lots of little hairs around its mouth, I can't kill that.\" John insisted that he was going to have the Squid. \"Ok,\" said Hans, \"I will find Yosfayce and get him to do it. He will kill anything!\" Five minutes later, Yosfayce comes over to the table and says, \"I can't kill the Squid, It has lots of hairs around its mouth.\" John asked, \"WHAT DOES THIS MEAN?\" The Waiter appeared, and said, \"This means Hans that do dishes can be soft as yosfayce, with mild green hairy lipped squid.\"",
            "length": 1034,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two ladies were walking in the woods when they saw a raccoon on top of a tree stump. The first lady asked, \"What do you think? Do you think it's rabid?\" The second lady answered, \"No, raccoon.\"",
            "length": 197,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What are hippies? They're what leggies hang from.",
            "length": 49,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Golfer on Par 3 tee, large pond between tee and green. He puts an old ball on the tee. Hears a voice: \"Use a new ball!\" The old ball is replaced with a new one, then he takes a practice swing. \"Use the old ball!\"",
            "length": 216,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why couldn't the Prince Potato marry the BBC correspondent? Because she was a common-tater.",
            "length": 91,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many boring people does it take to change a lightbulb? One.",
            "length": 63,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Bob recently bought a new car and is driving back home on the M1 highway. Suddenly the music on the radio is interrupted and a special broadcast is heard: \"This is breaking news, there one car going the wrong way on the highway M1, drivers please be aware!\" Bob looks around and says, \"One? There are hundreds!\"",
            "length": 315,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Knock knock. Who's there? Canoe. Canoe who? Canoe open the door please!",
            "length": 71,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when you divide the circumference of a pumpkin by its diameter? Pumpkin pi!",
            "length": 91,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So there's these two talking muffins, and they're sitting in an oven. One of them looks at the other and says, \"Boy, it's hot in here!\" And the other one says, \"Oh my god, it's a talking muffin!\"",
            "length": 199,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The night watchman was making his rounds and was surprised that no one was in the office except a big dog emptying wastebaskets. The watchman stared at the animal, wondering if his imagination could be playing tricks on him. The dog looked up and said, \"Don't be surprised. This is just part of my job.\" \"Incredible!\" Exclaimed the man. \"I can't believe it! Does your boss know what a prize he has in you? An animal that can talk!\" \"No, no,\" pleaded the dog. \"Please don't, If that man finds out I can talk he will make me answer the phone as well!\"",
            "length": 559,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man hurrying home on a cold, rainy night takes a shortcut through the local cemetery and falls into a freshly dug, empty grave. He struggles to get out but can't climb the wet, slippery walls. He begins shouting for help but has little hope as the rain is making a thunderous noise and it is late at night. A drunk, oblivious to the weather, is wending his way through the graveyard when he hears the frantic cries. He goes to the gravesite and looks down incredulously. \"Help me!\" The stranded man pleads. \"Well. What's the matter?\" The drunk asks, struggling to keep his balance on the edge of the grave. \"What's the matter? Look at me! I'm wet and I'm freezing,\" the man shouts in exasperation. \"Well... No wonder,\" the drunk replies, \"You kicked all your dirt off!\"",
            "length": 781,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "After years of nagging, the wife was finally going deer hunting with her husband. \"I'll drop you off here and go park the car. Don't get into trouble,\" says her husband. He drove the car down the road and parked it. Walking back he could hear a heated argument between his wife and some man. \"It's my deer. I shot it!\" He could hear his wife shouting. The man's voice kept insisting, \"That's NOT your deer, lady!\" The husband started walking faster. His wife said, \"It is TOO, my deer. I shot it and it's mine.\" \"No it's NOT!\" Said the man. The argument got louder and louder with his wife shouting about her killing her first deer. Finally, the weary voice of the man was heard admitting defeat, \"Okay, lady, it's YOUR deer. Just let me get my saddle off it.\"",
            "length": 772,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One woman had always wanted to take a bath in a tub filled with warm milk. So she called the dairyman out to measure the tub and find out how much milk she would need and how much it would cost. He began measuring and asked her, \"Do you want it pasteurized?\" And she said, \"No, just up to my bosom would be fine.\"",
            "length": 317,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did one casket say to the other? That you coughin'?",
            "length": 56,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "On Monday a delivery van was stolen containing files and diaries. The next day another van was stolen, this time containing filing cabinets. The police believe it was organised crime.",
            "length": 183,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A city feller goes to a dude ranch and arrives in the evening. Making conversation with the cow-hand, he asks, \"Are we going to be driving that bunch of cows over there?\" \"Herd,\" is the cowhand's reply. \"Heard? Heard of what?\" Asks the city slicker. \"Herd of COWS,\" replies the cow-hand. \"Course I've heard of cows,\" says the indignant city dweller. \"There's a bunch of 'em right over there!\"",
            "length": 404,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Three men were on a boat and they wanted a smoke. They had a packet of cigarettes, but no matches. So how did they get to have their smoke? Don't know? Simple. They threw one of the cigarettes overboard and then the boat was a cigarette lighter!",
            "length": 245,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man in a balloon calls down to a fellow on the ground. \"Where am I?\" He asks. \"You're in a balloon,\" the fellow replies. \"You must be a software engineer,\" says the man in the balloon, \"For where else could I receive such a useless, yet technically correct answer?\" The fellow on the ground yells, back: \"Very good guess! I am a software engineer, you must be a manager!\" The startled man in the balloon admits this is true and asks how the fellow on the ground knew this. \"Because you don't know where you are, or where you are going, and are still in the same situation you were before asking for my help, but now you've somehow managed to make it my fault,\" the fellow replied.",
            "length": 694,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A ship carrying artificial limbs has sunk. All hands are reported lost.",
            "length": 71,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a cow spying on another cow? A steak out.",
            "length": 58,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get if you cross a pit bull with a collie? A dog that will chew your leg off then run for help.",
            "length": 107,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Bob received a parrot for his birthday. The parrot was fully grown, with a very bad attitude and worse vocabulary. Every other word was an expletive; Those that weren't expletives were, to say the least, rude. Bob tried to change the bird's attitude by constantly saying polite words, playing soft music... Anything he could think of. Nothing worked. He yelled at the bird, and the bird got worse. He shook the bird, and the bird got madder and more rude. Finally, in a moment of desperation, Bob put the parrot in the freezer. For a few moments he heard the bird swearing, squawking, kicking and screaming and then, suddenly, there was absolutely quiet. Bob was frightened that he might have actually hurt the bird, and quickly opened the freezer door. The parrot calmly stepped out onto Bob's extended arm and said, \"I'm sorry that I offended you with my language and my actions, and I ask for your forgiveness. I will endeavour to correct my behaviour.\" Bob was astounded at the changes in the bird's attitude and was about to ask what had changed him, when the parrot continued, \"May I ask what the Chicken did?\"",
            "length": 1120,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do mommy brooms and daddy brooms make baby brooms? They sweep together!",
            "length": 75,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Johnny was having trouble in math, so his parents sent him to catholic private school. On the first day he came rushing back home and started working furiously on his math. He did the same after supper. His mother was impressed and commented to him, \"Wow, Johnny, you're really working hard!\" Johnny looked up and said, \"Well, when I went in there and saw that guy nailed to the plus sign, I just knew they weren't messing around.\"",
            "length": 435,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two men on the 9th tee tired of waiting for two women to get off the fairway. One man approaches them but before he reaches the women he does an abrupt U turn, and explains to his partner that one of the women is his wife and the other is his girlfriend. The second man agrees to go but also does a U turn before reaching the ladies and explains to his partner on returning, \"Small world, isn't it!\"",
            "length": 401,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A scientist who thought he knew everything was going on a business trip. On the airplane, he sat next to a lady. He asked her, \"Do you want to play a game where I ask you a question and if you can't answer, you give me $5 and then you ask me a question and I give you $5 if I can't answer?\" \"No.\" \"How about if when I can't answer, I give you $1000, but if you can't answer, you only have to give me $5?\" \"No.\" \"How about if I can't answer, I give you $2000?\" \"Ok.\" \"What is the top speed of an Indian fruit bat?\" The lady gave him $5 and asked him, \"What has 15 legs going up a hill, 137 legs at the top, and 57 legs coming down?\" The man searched in every resource he had and eventually gave up and gave the lady $2000, then asked, \"What is the answer?\" The lady gave him $5.",
            "length": 795,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy goes into a restaurant on Christmas morning for breakfast. The waitress serves him his eggs benedict on a large and very shiny, metal plate. The guy says, what's with this plate? The waitress says: \"It's Christmas, and there's no plates like chrome for the hollandaise.\"",
            "length": 278,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Victor was out playing golf with his good friend John. After a few holes John was getting frustrated as he was not that good a golfer. Finally when he missed an easy putt he blurted out, \"Damn, I missed the bugger!\" Victor said, \"Now John, you must be careful as God may punish you if you say that again.\" On the next hole the Victor stayed close to John offering quiet support. As John missed an even easier putt he shouted, \"Damn, I missed the bugger!\" Suddenly there was a large clap of thunder and a lightning bolt pierced the air and killed Victor. And a voice from the sky said, \"Damn, I missed the bugger!\"",
            "length": 621,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do otters say when they get stuck in seaweed? Kelp! Kelp!",
            "length": 62,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple is vacationing somewhere in France. One fine afternoon, they visit a historic church. They climb up to the bell tower to take a few pictures, and there they find a little hunch-backed man. \"Hello,\" they greet him, but he ignores them and cries: \"I must ring the bell!\" He then runs face first into the enormous church bell, ringing it, and then falls from the tower to his death below. \"Who was that?\" The man asks his wife. \"I'm not sure,\" she answers, \"but his face certainly rings a bell.\" The next day the couple returns to the tower. A second hunchback, identical to the first, appears and exclaims: \"I must ring the bell!\" He runs into the bell, falls from the tower, and dies. \"Well, who was that?\" The man wonders, to which his wife replies: \"I don't know, but he was a dead ringer for the other guy.\"",
            "length": 834,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a coyote and a flea? One howls on the prairie, and one prowls on the hairy.",
            "length": 105,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An elderly couple was on a cruise and it was really stormy. They were standing on the back of the boat watching the moon, when a wave came up and washed the old woman overboard. They searched for days and couldn't find her, so the captain sent the old man back to shore with the promise that he would notify him as soon as they found something. Three weeks went by and finally the old man got a fax from the boat. It read: \"Sir, sorry to inform you, we found your wife dead at the bottom of the ocean. We hauled her up to the deck and attached to her rear was an oyster and in it was a pearl worth $50,000, please advise.\" The old man faxed back: \"Send me the pearl and re-bait the trap.\"",
            "length": 692,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two magpies were sitting on the telegraph wires. One turned to the other and said, \"Don't those long words tickle your bum?\"",
            "length": 126,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "An elderly couple had dinner at another couple's house, and after eating, the wives left the table and went into the kitchen. The two elderly gentlemen were talking, and one said, \"Last night, we went out to a new restaurant, and it was really great. I would recommend it very highly.\" The other man said, \"What was the name of the restaurant?\" The first man thought and thought and finally said, \"What is the name of that flower you give to someone you love? You know... The one that is red and has thorns.\" \"Do you mean a rose?\" \"Yes,\" the man said. He then turned towards the kitchen and yelled, \"Rose, what's the name of that restaurant we went to last night?\"",
            "length": 676,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A dog comes into a bar and asks for a beer. The bartender, a little surprised serves the dog the beer the dog drinks the beer and asks for the bill. \"It'll be 10 dollars,\" says the bartender the dog pays and is leaving through the door when the bartender says, \"It is not usual to have dogs here drinking.\" The dog hears and answers, \"For 10 dollars a beer no dog can keep drinking here.\"",
            "length": 394,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you get Holy Water? You boil the Hell out of it.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A wife went to the police station with her next-door neighbor to report her husband was missing. The policeman asked for a description. She said, \"He's 35 years old, 6 foot 4, had dark eyes, dark wavy hair, an athletic build, weighs 185 pounds, is soft-spoken, and is good with the children.\" The next-door neighbor protested, \"Your husband is 5 foot 4 inches, chubby, bald, has a big mouth, and is mean to your children.\" The wife replied, \"Yeah, but who wants HIM back?\"",
            "length": 478,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why was tigger looking in the toilet? To find pooh.",
            "length": 51,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What fizzy drink does a frog drink? Croca cola.",
            "length": 47,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's yellow and can't waterski? A bulldozer.",
            "length": 46,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a dry parrot? Polyunsaturated.",
            "length": 47,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The court was investigating an accident: \"What gear were you in at the moment of the impact?\" \"Gucci sweats and Reeboks.\"",
            "length": 125,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A chap goes to the doctor, who examines him and says, \"Hmmm, ok, go over to the window and stick your tongue out.\" \"But,\" protests the chap, \"I've only got a sore knee!\" \"I know,\" says the doctor, \"but I hate that bloke across the road.\"",
            "length": 247,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the definition of pain? A one-armed man hanging off a cliff with an itchy bum.",
            "length": 86,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why are giraffes necks so long? Because their heads are so far away.",
            "length": 68,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A husband tells the doctor, \"'Doctor my wife thinks she's a four poster bed.\" The doctor replies, \"In that case, she needs to go into care.\" The husband responds, \"But what will I sleep on?\"",
            "length": 196,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How do you know that you have slept like a log? You wake up in the fireplace.",
            "length": 77,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "\"I don't care whose son you are. I don't want you walking on the water here where I am fishing and scaring the fish away.\"",
            "length": 124,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do squirrels swim on their backs? To keep their nuts dry.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I stopped at a friend's house the other day and found him stalking around with a fly swatter. When I asked if he was getting any flies, he answered, \"Yeah, three males and two females.\" Curious, I inquired as to how he could tell the difference. He answered, \"Three were on a beer can and two were on the phone.\"",
            "length": 316,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes into a doctors surgery. \"Doctor, I've got a pain in my leg. Do you know what it could be?\" \"Gout,\" says the doctor. \"Why?\" Says the patient, \"I've only just come in.\"",
            "length": 185,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did one chimney say to the other? You're too young to smoke.",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A dog called, \"Rufus Jagger,\" walks into a bank. The Teller says, \"Hello my name is Sally Whack, how can I help you?\" The dog puts a keyring with a little toy elephant attached to it onto the counter and says, \"I'd like a loan please.\" Sally Whack, baffled by what's happening picks up the keyring and calls her manager, she explains the situation and show's her manager the keyring. The manager says, \"It's a nick nack Sally Whack give the dog a loan, his old man's a rolling stone.\"",
            "length": 492,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The preacher was wired for sound with a lapel mic, and as he preached, he moved briskly about the platform, jerking the mic cord as he went. Then he moved to one side, getting wound up in the cord and nearly tripped before jerking it again. After several circles and jerks, a little girl in the third pew leaned toward her mother and whispered, \"If he gets loose, will he hurt us?\"",
            "length": 383,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two elderly ladies had been friends for many decades. Over the years they had shared all kinds of activities and adventures. Lately, their activities had been limited to meeting a few times a week to play cards. One day they were playing cards when one looked at the other and said, \"Now don't get mad at me; I know we've been friends for a long time, but I just can't remember your name. I've thought and thought, but I can't recall it. Please tell me what your name is.\" Her friend glared at her. For at least three minutes she just looked at her. Finally she said, \"How soon do you need to know?\"",
            "length": 603,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What did one strawberry say to the other strawberry? If you weren't so fresh last night we wouldn't be in this jam.",
            "length": 115,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A couple in their sixties are walking along the beach to admire the sunset. The wife sees a dirty lamp, and the husband stoops down to dust it off. Magically, a genie appears out of nowhere and thanks the couple profusely for freeing him from his imprisonment. \"As a reward,\" the genie says, \"I'll grant you each one wish.\" The wife says, \"I want to sail around the world. Send me and my husband on a first class luxurious cruise.\"*POOF* she's suddenly holding two tickets on the finest ship around the world. The genie turns to the husband, \"And for you, sir?\" The husband looks at his wife, and leans in close to the genie, \"I want a wife that is thirty years younger than me.\" *POOF* And he's suddenly ninety years old.",
            "length": 732,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "One cow says to the other. \"Aren't you just so worried about the mad cow disease?\" The other answers, \"Why should I worry? I'm not a cow, I'm a helicopter!\"",
            "length": 160,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two gangsters walk into a grocery store and while they are walking through the Vegetable aisle one gangster says to the other, \"Hey, look at that, Artie-chokes, two for a Dollar!\"",
            "length": 181,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a 450-pound canary sitting in a tree? Sir.",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man left for work one Friday afternoon. But, instead of going home, he stayed out the entire weekend hunting with the boys and spending his entire paycheck. When he finally got home Sunday night, he was confronted by his very angry wife, and was barraged for two hours. Finally, his wife stopped nagging and simply said to him, \"How would you like it if you didn't see me for two or three days?\" To which he replied, \"That would be fine with me.\" Monday went by, and he didn't see his wife, Tuesday and Wednesday came and went with the same results. Thursday the swelling went down just enough where he could see her a little out of the corner of his left eye.",
            "length": 666,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's the difference between a monkey and a bicycle? They both climb trees except the bicycle.",
            "length": 95,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "The old man was sitting on the bench staring at a teen-age boy with his spiked, yellow, red, green and orange hair. The kid says, \"What's the matter old man. Haven't you ever done anything wild in your days?\" \"Yup, said the old man, made love to a parrot once, thought you might be my son!\"",
            "length": 294,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a man with a car on his head? Jack.",
            "length": 52,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A master French thief decides to pull off a huge job at the Louvre, stealing several valuable paintings. However, he was stopped and arrested just a few blocks away from the museum at a gas station. When asked how he could pull off such a heist and yet get arrested so easily, he responded, \"I had no Monet to get Degas to make the Van Gogh.\"",
            "length": 344,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy is waiting to cross the traffic lights as a pedestrian, when another guy comes up and puts his hand in his pocket. \"What do you think your doing?\" The guy asks. \"Just lookin for a light,\" the guy says. \"Well why don't you just ask?'\" Says the first guy, \"I don't like talking to strangers!'\" Comes the reply.",
            "length": 322,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What time is it when an elephant sits on a lawn chair? Time to get a new lawn chair.",
            "length": 84,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "It's Spring time and a family of moles decides it's time to come out of hibernation. The daddy mole sticks his head out of the ground, smells the air and says, \"Mmmm, smells like bacon.\" The momma mole sticks her head out, smells the air, and says, \"Mmmmm, smells like pancakes.\" The baby mole tries to stick his head out, but there isn't enough room, so he smells the air and says, \"Mmmm, smells like molasses.\"",
            "length": 418,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A bus station is where a bus stops. A train station is where a train stops. On my desk I have a workstation.",
            "length": 108,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a fish that's not very smart? A dumb bass.",
            "length": 59,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the boy whose nose grew 11 inches? He thought it might turn into a foot.",
            "length": 91,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do Skoda's have rear windscreen warmers? To keep your hands warm when your pushing it!",
            "length": 90,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a Skoda with a sunroof? A skip.",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why do Skodas have two exhaust pipes? Wheelbarrow.",
            "length": 50,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Doctor Bob had slept with one of his patients and had felt guilty all day long. No matter how much he tried to forget about it, he couldn't. The guilt and sense of betrayal was overwhelming. But every once in a while he'd hear that soothing voice, within himself, trying to reassure him: \"Bob, don't worry about it. You aren't the first doctor to sleep with one of their patients, and you won't be the last. And you're single. Let it go.\" But invariably another voice would bring him back to reality: \"Bob, you're a vet!\"",
            "length": 525,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many religious education teachers does it take to screw in a light bulb? One, and their God of choice.",
            "length": 106,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why did the bird with one eye cross the road To get two birdseye factory.",
            "length": 73,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two bugs go out of a concert. The smaller one asks: Shall we walk home or take a dog?",
            "length": 85,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you call a sheep with no head or legs? A cloud.",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "I am now on a seafood diet! I see food and I eat it!",
            "length": 52,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "So these two statues, one of a man and one of a woman, are standing in a park. Like all good statues they are nude and covered in bird poop. One day an angel comes down and says to them, \"I am going to animate you for 10 minutes and for those 10 minutes you can do whatever you want, but then you have to become statues again for the rest of your lives.\" So they both run off behind the bushes. Sounds of true enjoyment emanate from the bushes and then they return about 5 minutes later. The angel asks, \"Why don't you use your whole ten minutes?\" The woman turns to the man and says, \"I guess we could do it again, but this time you hold the bird's head and I'll poop on it.\"",
            "length": 682,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear the one about the Magician who was walking down the street when he turned into a Restaurant?",
            "length": 105,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "This woman rushed to see her doctor, looking very much worried and all strung out. She rattles off, \"Doctor, take a look at me. When I woke up this morning, I looked at myself in the mirror and saw my hair all wiry and frazzled up, my skin was all wrinkled and pasty, my eyes were bloodshot and bugging out, and I had this corpse-like look on my face! What's WRONG with me, Doctor!?\" The doctor looks her over for a couple of minutes, then calmly says, \"Well, I can tell you that there ain't nothing wrong with your eyesight.\"",
            "length": 530,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What do you get when Godzilla steps on your house? Mushrooms.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is a baby bee? A little humbug.",
            "length": 36,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the man who lived in a tyre? He had a puncture so now he lives in a flat!",
            "length": 92,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man goes to his doctor because he is not feeling well. The doctor determines his condition is very serious and tells the man he does not have long to live. The man asks how much longer he has and the doctor replies, \"10,9,8,7,...\"",
            "length": 234,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Did you hear about the cowboy who got caught shoplifting? He got two yeehars!",
            "length": 77,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "As a teacher I was trying to get my students to understand what a, \"pun,\" was. I gave them 10 examples but was not successful. They could not understand any of them. You might say that no pun in ten did!",
            "length": 205,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A pig farmer is having trouble getting his pigs to breed. So, he asks a friend what he thinks is wrong. The friend tells him that this happened to him once, and that the pigs don't know how to breed. His friend says that when it happened to him, he had to show each pig what it was supposed to do. Well, the pig farmer feels pretty stupid about this, but decides to give it a try. But in order to avoid anyone seeing this, he piles the pigs up in the truck and drives them to a hidden part of the farm, way in the back. He, \"teaches,\" of all the pigs, which exhausts him and then hauls them back to the pen. The next morning he asks his wife to check if the pigs are breeding, she tells him they aren't. Wearily, he goes out and, \"teaches,\" them all over again. The next morning he asks his wife if they are breeding yet and she says, \"No.\" Frustrated and exhausted, he asks, \"Well, what are they doing?!?!\" To which his wife replies, \"Sitting in the truck, honking the horn.\"",
            "length": 986,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A man decides to take the opportunity while his wife is away to paint the toilet seat. After he finished, he went to the kitchen to raid the fridge. The wife comes home sooner than expected, and heads to the bathroom, sits down and gets the toilet seat stuck to her rear. In a panic, she shouts to her husband to drive her to the doctor. She puts on a large overcoat to cover the stuck seat, and off they go. When they get to the doctors office, the man lifts his wife's coat to show their predicament. The man asked, \"Doctor, have you ever seen anything like this before?\" \"Well, yes,\" the doctor replied. \"But never framed.\"",
            "length": 632,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A flash flood swept over an area, stranding a man in his house. As the water rose, a rescue team came by in a boat. \"Get in,\" the rescuers said. \"We'll take you to safety.\" \"No,\" said the man. \"I have faith in the Lord. He will save me.\" The rains continued and soon the man was forced up onto his roof to avoid drowning. Soon, another boat came by. \"Sir, please get in,\" the rescuers in this boat said. \"The waters are rising. We'll take you to safety.\" \"No,\" said the man again. \"I have faith in the Lord. He will save me.\" The boat left, and soon the man was barely able to keep his head above the water. The water became rougher and a helicopter was dispatched to save the man. \"We'll lower a rope. Get in the copter!\" Yelled the rescuers from above. \"The water shows no sign of abating. You're sure to drown!\" Once again, the man refused. \"I have faith in the Lord,\" he said calmly. \"He will save me.\" Eventually, the man did, in fact, drown. When he got to heaven, he saw the Lord and approached him. \"What happened?\" Asked the man. \"I had faith that you would save me from drowning. Why didn't you?\" \"Hey,\" replied the Lord. \"I sent two boats and a helicopter. What else did you want?\"",
            "length": 1224,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is Big, Red and eats Rocks? A big red rock eater!",
            "length": 54,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If a wheel falls off a bus while traveling down a river, how long will it take to shingle a dog house? None, because there's no bones in cottage cheese!",
            "length": 152,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Matt: I got a set of golf clubs for my wife. Ben: Nice trade.",
            "length": 61,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two guys were walking on the street when one of them says: \"I've realized that my wife is an angel.\" \"Mine isn't human, either,\" said the second.",
            "length": 149,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Two nuns were travelling through Europe in their car. They get to Transylvania and are stopped at a traffic light. Suddenly, a diminutive Dracula jumps onto the hood of the car and scratches at the windshield! \"Quick, quick!\" Shouts the first nun, \"What shall I do?\" \"Turn the windshield wipers on, that will get rid of the abomination,\" shouts the second. She switches them on, knocking Dracula about, but he clings on and hisses even more loudly! \"What shall I do now?\" Shouts the first nun. \"Switch on the windshield washer. I filled it up with Holy Water in the Vatican!\" Says the second. Dracula steams as the water burns his skin, but he clings on and hisses again at the nuns. \"Now what?\" Screams the first nun. \"Show him your cross!\" Says the second. So the nun rolls down the window and shouts: \"GET OFF MY FREAKIN' HOOD!\"",
            "length": 847,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is a honeymooner's sandwich? Lettuce alone!",
            "length": 48,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's a Grecian Urn? About 50 Drachma a day.",
            "length": 45,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What can you tell when your drummer is drooling out of both sides of his mouth? The stage is level.",
            "length": 99,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A guy gets home from work one night and hears a voice. The voice tells him, \"Quit your job, sell your house, take your money, go to Vegas.\" The man is disturbed at what he hears and ignores the voice. The next day when he gets home from work, the same thing happens. The voice tells him, \"Quit your job, sell your house, take your money, go to Vegas.\" Again the man ignores the voice, though he is very troubled by the event. Every day, day after day, the man hears the same voice when he gets home from work, \"Quit your job, sell your house, take your money, go to Vegas.\" Each time the man hears the voice he becomes increasingly upset. Finally, after two weeks, he succumbs to the pressure. He does quit his job, sells his house, takes his money and heads to Vegas. The moment the man gets off the plane in Vegas, the voice tells him, \"Go to Harrah's.\" So, he hops in a cab and rushes over to Harrah's. As soon as he sets foot in the casino, the voice tells him, \"Go to the roulette table.\" The man does as he is told. When he gets to the roulette table, the voice tells him, \"Put all your money on 17.\" Nervously, the man cashes in his money for chips and then puts them all on 17. The dealer wishes the man good luck and spins the roulette wheel. Around and around the ball goes. The man anxiously watches the ball as it slowly loses speed until finally it settles into number: 21. The voice says, \"Damn.\"",
            "length": 1424,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How many ears did Davy Crockett have? Three. A left ear, a right ear, and a wild front ear.",
            "length": 91,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Where does Kylie get her kebabs from? Jason's Donervan!",
            "length": 55,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Jesus Christ walks up to an angry mob that is stoning a harlot. He steps into the fray and calls out in a commanding voice: \"Let he who is without sin cast the first stone.\" Shamefaced, the crowd stops and begins to slink away. Suddenly, a woman shrieks, \"Stone her!\" And the mob starts again with the frenzied stoning. Christ, chagrined, goes to the woman and says: \"Damn it, Mom, I hate it when you do that.\"",
            "length": 416,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "How did the elephant get on the tree? Sat on an acorn and waited for it to grow. How did the elephant get off the tree? Sat on a leaf and waited till Autumn.",
            "length": 157,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What's a cannibals favorite game? Swallow my leader!",
            "length": 52,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "If a fly and a flee pass each other what time is it? Fly past flee!",
            "length": 67,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "Why was the Egyptian girl worried? Because her Daddy was a mummy!",
            "length": 65,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "A drummer gets fed up with all the comments denying he's a real musician, and so he decides to learn some new instruments. He visits his local Music shop, and spends an hour looking around and deliberating. \"Right!\" He says, after an age. \"I'll have the shiny red one, and the accordion thing over there.\" \"I'll do you a deal,\" ays the Music Shop Manager, \"You can have the fire extinguisher, but the radiator is staying where it is.\"",
            "length": 442,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "When is a vet busiest? When its raining cats and dogs!",
            "length": 54,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        },
        {
            "joke": "What is the difference between illegal and unlawful? One is against the law and the other is a sick bird.",
            "length": 105,
            "source": "Quirkology",
            "nsfw": false,
            "tags": []
        }
    ]
}
